[
    {
        "artist": "Rush",
        "album": "2112",
        "year": "1976",
        "cover": "./assets/albumart/rush - 2112.jpg",
        "description": "This album is so good, they named the time (21:12) after it.<br><br>Rush is a band of best friends who loved music—you can feel it in the spirit of all their albums. <i>2112</i> is an album of two halves: the former tells a 20-minute, seven part story of a dystopian future where the high priests of the Temples of Syrinx control the media humanity consumes. The music is larger than life and the vocals are epic. The second side is more conventional Rush, and it's awesome too. '2112' and 'Lessons' are my favourite tracks. ",
        "genre": "Progressive Rock",
        "rating" : "90",
        "duration": "38:42",
        "tracks": [
            "2112",
            "A Passage To Bangkok",
            "The Twilight Zone",
            "Lessons",
            "Tears",
            "Something For Nothing"
        ],
        "applemusic":"https://music.apple.com/us/album/2112-remastered-2012/1445876680",
        "spotify":""
    },
    {
        "artist": "Nine Inch Nails",
        "album": "Add Violence [EP]",
        "year": "2017",
        "cover": "./assets/albumart/nine inch nails - add violence.jpg",
        "description": "Some people complain that Trent Reznor got soft in the early 2010's with the synth-driven <i>Hesitation Marks</i>. They're the same kinds of people who crap on Green Day's <i>Warning</i>, argue that The Clash isn't punk, Alice In Chains shouldn't have continued and Prog bands all committed treason in the 1980s: they're missing out on the good things in life. <br><br>The aforementioned Nine Inch Nails releases are undoubtedly Nine Inch Nails—they ooze the craftsmanship and quality of Trent Reznor's work, and they're a lot of fun to listen to. Add Violence has a bit of an angrier, harder edge than the former, and I quite like it. This certainly feels like an artist growing and evolving.<br><br>The long, repetitve breakdown of 'The Background World' bothered me at first, but I don't mind it anymore. 'Less Than' and 'Not Anymore' are my favourite tracks off this one; the former is up there with NIN's best.",
        "genre": "Industrial Rock",
        "rating" : "75",
        "duration": "27:14",
        "tracks": [
            "Less Than",
            "The Lovers",
            "This Isn't The Place",
            "Not Anymore",
            "The Background World"
        ],
        "applemusic":"https://music.apple.com/us/album/add-violence/1260014946",
        "spotify":"https://open.spotify.com/album/28DJ00Yr5oOhH0uOUgTQwc"
    },
    {
        "artist": "Pink Floyd",
        "album": "The Dark Side of The Moon",
        "year": "1973",
        "cover": "./assets/albumart/pink floyd - dark side of the moon.jpg",
        "description": "The greatest album of all time. The forth best-selling album of all time. Two sides of the record, two continuous pieces of music. How do you put the power and might of this album into words? You don't—just listen to it! If you don't like it, listen to it again. Listen to it while walking, while thinking, in a house, with a mouse; this album works anywhere, any time. It's your new best friend. 'Time' contains one of the most legendary guitar solos, too. I could go on and on about this album forever. There's nothing else like it.",
        "genre": "Progressive Rock",
        "rating" : "100",
        "duration": "42:57",
        "tracks": [
            "Speak To Me",
            "Breathe (In The Air)",
            "On The Run",
            "Time",
            "The Great Gig In The Sky",
            "Money",
            "Us And Them",
            "Any Colour You Like",
            "Brain Damage",
            "Eclipse"
        ],
        "applemusic":"https://music.apple.com/us/album/the-dark-side-of-the-moon/1065973699",
        "spotify":"https://open.spotify.com/album/4LH4d3cOWNNsVw41Gqt2kv"

    },
    {
        "artist": "Skin Yard",
        "album": "1000 Smiling Knuckles",
        "year": "1991",
        "cover": "./assets/albumart/skin yard - 1000 smiling knuckles.jpg",
        "description": "Described as their most complete work, <i>1000 Smiling Knuckles</i> is the forth album from Seattle Grunge pioneers Skin Yard. I don't see enough people talking about this one, and I can't recommend it enough; this EP-sized album is a pleasure to listen to over and over again.<br><br> Ben McMillan's signature disjointed, surrealist lyrics sounds so good over these energetic and sometimes ominous riffs. You can find meaning in these songs, or you don't have to. They're just words that sound good over music that sounds good. Good stuff! <br><br>I think it's one of the best Grunge albums any Seattle group put out. 'Burn A Hole', 'River Throat' and the titular track are my favourites off this one. I <i>highly</i> recommend this one.",
        "genre": "Grunge",
        "rating" : "95",
        "duration": "34:42",
        "tracks": [
            "1000 Smiling Knuckles",
            "River Throat",
            "Words on Bone",
            "Living Pool",
            "Headswill",
            "Psychoriflehypnotized",
            "Material Freak",
            "Jezechrist",
            "Nietzche with a Pizza",
            "Burn a Hole"
        ],
        "applemusic":"https://music.apple.com/us/album/1000-smiling-knuckles/520711376",
        "spotify":"https://open.spotify.com/album/6eEONt3JiPOcm8IoYRCtH0"
    },
    {
        "artist": "Nine Inch Nails",
        "album": "Broken [EP]",
        "year": "1992",
        "cover": "./assets/albumart/nine inch nails - broken.jpg",
        "description": "Pure, raw, relentless energy. This album spurs you up and sends you on a non-stop half-hour journey of colossal, aggressive guitars and distorted vocals. This EP unleashes the bitterness, hate and anger you can tangibly feel in the passionate—albeit subdued—singing on Pretty Hate Machine. It's an outburst of so many emotions, and I love it.<br><br>This EP was experimental for NIN; it served as a sandbox to test and refine sounds that would be used on <i>The Downward Spiral</i>. In fact, if you listen to this between the albums which come before and after it, it feels like a bridge between the two. This is my favourite NIN release. It's very heavy, and I think this isn't something you can recommend to just about anybody, but I think it's great. <br><br>My favourite tracks off this one are 'Last' and 'Happiness In Slavery', the latter of which is in my top three NIN songs overall.",
        "genre": "Industrial Metal",
        "rating" : "100",
        "duration": "33:09",
        "tracks": [
            "Pinion",
            "Wish",
            "Last",
            "Help Me I Am In Hell",
            "Happiness In Slavery",
            "Gave Up",
            "Physical [Bonus Track]",
            "Suck [Bonus Track]"
        ],
        "applemusic":"https://music.apple.com/us/album/broken-ep/1440743805",
        "spotify":"https://open.spotify.com/album/4jyWDa1yM9ul7zgUdR80hw"
    },
    {
        "artist": "Hater",
        "album": "Hater",
        "year": "1993",
        "cover": "./assets/albumart/hater - hater.jpg",
        "description": "Why didn't anyone tell me about Hater? How did I not find out about this sooner? There are many questions which will go unanswered in life.<br><br>If you like Grunge, or you're not allergic to fun, give this album a chance. It's the first effort of the emponymous supergrop featuring Matt Cameron (Skin Yard, Soundgarden, Temple of The Dog, Pearl Jam), John McBain (Monster Magnet), Brian Shepherd (Soundgarden) and Brian Wood (brother of Andy Wood). <br><br>This is <i>good</i>. It doesn't take itself too seriously, nor does it overstay its welcome. In fact, I would've liked it to take off it's jacket and stay awhile, but it had somewhere else to be. The eclectic mix of musicians blend their grunge, psychedelic rock and garage rock influences into a weird and enjoyable ride. My favourite track off this one is probably 'Tot Finder' or 'Sad McBain'. 'Lion and Lamb' reminds me of the beginning of Led Zeppelin's 'The Rain Song'.<br><br>Be a hater lover. ",
        "genre": "Grunge",
        "rating" : "80",
        "duration": "31:03",
        "tracks": [
            "Mona Bone Jakon",
            "Who Do I Kill?",
            "Tot Finder",
            "Lion and Lamb",
            "Roadside",
            "Down Undershoe",
            "Circles",
            "Putrid",
            "Blistered",
            "Sad McBain"
        ],
        "applemusic":"https://music.apple.com/us/album/hater/1443276130",
        "spotify":"https://open.spotify.com/artist/0cDULsp0aF8xxHVF7a7GwM"
    },
    {
        "artist": "The Tuesdays",
        "album": "The Tuesdays",
        "year": "1998",
        "cover": "./assets/albumart/the tuesdays - the tuesdays.jpg",
        "description": "Do you like The Bangles? If so, here's the <i>Norwegian Bangles</i>—The Tuesdays—with what seems to be their first album in this incarnation of the band. I found this one at a thrift store and bought it thinking 'I bet they sound like The Bangles, but with the 90's alternative edge'. Somehow, I got that right, and I enjoy this half-decent album from time to time.<br><br>It's certainly not amazing, but it's energetic, catchy and enjoyable. The music is awesome, but it's more often than not let down by the songwriting. I'm realizing this album doesn't really exist online, so I don't know where you'll listen to it if you want to. But hey, a wise man once said, 'life, uh, finds a way'. My favourite track off this one is 'It's up to you'.",
        "genre": "Power Pop",
        "rating" : "65",
        "duration": "44:33",
        "tracks": [
            "Too Late to Be Good",
            "It's Up to You",
            "I'll Be Here",
            "Changing The Moods",
            "Take Me Home",
            "What Is Love",
            "I Was Thinking of You",
            "I Wish It Was Yesterday",
            "Wheels",
            "Gone With The Wind",
            "When You're a Tuesday Girl"
        ],
        "applemusic": "https://music.apple.com/us/album/the-tuesdays/304805587",
        "spotify": ""
    },
    {
        "artist": "Blind Melon",
        "album": "Blind Melon",
        "year": "1992",
        "cover": "./assets/albumart/blind melon - blind melon.jpg",
        "description": "Some people call this a Grunge album, but that classification might just be due to the album having been recorded in Seattle. Whatever you may call it, <i>Blind Melon</i> is a masterpiece. It's got a clean, comfortable kind of sound to it—'intimate', as the band called it. <br><br>The album flows really well, examining the ups and downs of life through thirteen well rounded tracks. It's a real, down to Earth album which has held up to the test of time. <br><br>My favourite track off this one is 'Change' without a doubt. 'Drive' is another good one. They're all good, just listen to this one—I highly recommend it.",
        "genre": "Alternative Rock",
        "rating" : "95",
        "duration": "55:18",
        "tracks": [
            "Soak The Sin",
            "Tones of Home",
            "I Wonder",
            "Paper Scratcher",
            "Dear Ol' Dad",
            "Change",
            "No Rain",
            "Deserted",
            "Sleepyhouse",
            "Holyman",
            "Seed To A Tree",
            "Drive",
            "Time"
        ],
        "applemusic":"https://music.apple.com/us/album/blind-melon/725821342",
        "spotify":"https://open.spotify.com/artist/5sD1ZLf2dGQ9gQ3YJl1eAd"
    },
    {
        "artist": "The Sex Pistols",
        "album": "Never Mind The Bollocks",
        "year": "1976",
        "cover": "./assets/albumart/sex pistols - never mind the bollocks.jpg",
        "description": "You know that part in <i>Pride and Prejudice</i> when Elizabeth says 'Yes! A thousand times yes!'? Due to a lost manuscript, Jane Austen's most famous story has been misprinted for hundreds of years; Elizabeth was not accepting a proposal of marriage, but emphatically agreeting to listen to <i>Never Mind The Bollocks</i> for the tenth time that day.<br><br>This album is just awesome all the way through. It led a massive wave of Punk Rock in the 1970s and despite massive controversy, quickly established itself as one of the greatest albums of all time. Just listen to it! I can't recommend it enough.<br><br>My favourite tracks off this one are 'Holidays in The Sun', 'Problems' and 'God Save The Queen'. Now you got a reason now you got a reason now you got a reason to listen to this album! Now you got a reason now you got a reason now you got a reason and you're waitiiiiiing?",
        "genre": "Punk Rock",
        "rating" : "98",
        "duration": "38:48",
        "tracks": [
            "Holidays In The Sun",
            "Bodies",
            "No Feelings",
            "Liar",
            "Problems",
            "God Save The Queen",
            "Seventeen",
            "Anarchy In The UK",
            "Submission",
            "Pretty Vacant",
            "New York",
            "EMI"
        ],
        "applemusic":"https://music.apple.com/us/album/blind-melon/725821342",
        "spotify":"https://open.spotify.com/artist/5sD1ZLf2dGQ9gQ3YJl1eAd"
    },
    {
        "artist": "The Killers",
        "album": "Pressure Machine",
        "year": "2021",
        "cover": "./assets/albumart/the killers - pressure machine.jpg",
        "description": "I liked The Killers before <i>Pressure Machine</i>, I'll openly admit it. <i>Hot Fuss</i> is a good album, no matter what people might say about 'Mr. Brightside' being overplayed. That said, I didn't really take them seriously until I heard Pressure Machine.<br><br>This album is unbelievably good. Brandon Flowers woke up one day and said, 'today, I'm going to be Bruce Springsteen'. And so he did. <i>Pressure Machine</i> is a lot like <i>Nebraska</i>: a stark, semi-autobiographical album about life in small town america. It's really, really good. I know they changed a lot with their second effort, <i>Sam's Town</i>, but I think the execution is just masterful here on this album. They're in their prime, and I can't wait to see what they put out next. It's also helped me look at the rest of their discography differently and re-evaluate my opinion of <i>The Killers</i> as a whole.<br><br>My favourite tracks off this one are the titular track 'Pressure Machine', and 'In Another Life' and 'In The Car Outside'.",
        "genre": "Heartland Rock",
        "rating" : "90",
        "duration": "51:22",
        "tracks": [
            "West Hills",
            "Quiet Town",
            "Terrible Thing",
            "Cody",
            "Sleepwalker",
            "Runaway Horses",
            "In The Car Outside",
            "In Another Life",
            "Desperate Things",
            "Pressure Machine",
            "The Getting By"
        ],
        "applemusic":"https://music.apple.com/us/album/blind-melon/725821342",
        "spotify":"https://open.spotify.com/artist/5sD1ZLf2dGQ9gQ3YJl1eAd"
    }
]