[
    {
        "artist": "Rush",
        "album": "2112",
        "year": "1976",
        "cover": "./assets/albumart/rush - 2112.jpg",
        "description": "This album is so good, they named the time (21:12) after it.<br><br>Rush is a band of best friends who loved music—you can feel it in the spirit of all their albums. <i>2112</i> is an album of two halves: the former tells a 20-minute, seven part story of a dystopian future where the high priests of the Temples of Syrinx control the media humanity consumes. The music is larger than life and the vocals are epic. The second side is more conventional Rush, and it's awesome too. '2112' and 'Lessons' are my favourite tracks. ",
        "genre": "Progressive Rock",
        "rating" : "90",
        "duration": "38:42",
        "tracks": [
            "2112",
            "A Passage To Bangkok",
            "The Twilight Zone",
            "Lessons",
            "Tears",
            "Something For Nothing"
        ],
        "applemusic":"https://music.apple.com/us/album/2112-remastered-2012/1445876680",
        "spotify":""
    },
    {
        "artist": "Nine Inch Nails",
        "album": "Add Violence [EP]",
        "year": "2017",
        "cover": "./assets/albumart/nine inch nails - add violence.jpg",
        "description": "Some people complain that Trent Reznor got soft in the early 2010's with the synth-driven <i>Hesitation Marks</i>. They're the same kinds of people who crap on Green Day's <i>Warning</i>, argue that The Clash isn't punk, Alice In Chains shouldn't have continued and Prog bands all committed treason in the 1980s: they're missing out on the good things in life. <br><br>The aforementioned Nine Inch Nails releases are undoubtedly Nine Inch Nails—they ooze the craftsmanship and quality of Trent Reznor's work, and they're a lot of fun to listen to. Add Violence has a bit of an angrier, harder edge than the former, and I quite like it. This certainly feels like an artist growing and evolving.<br><br>The long, repetitive breakdown of 'The Background World' bothered me at first, but I don't mind it anymore. 'Less Than' and 'Not Anymore' are my favourite tracks off this one; the former is up there with NIN's best.",
        "genre": "Industrial Rock",
        "rating" : "75",
        "duration": "27:14",
        "tracks": [
            "Less Than",
            "The Lovers",
            "This Isn't The Place",
            "Not Anymore",
            "The Background World"
        ],
        "applemusic":"https://music.apple.com/us/album/add-violence/1260014946",
        "spotify":"https://open.spotify.com/album/28DJ00Yr5oOhH0uOUgTQwc"
    },
    {
        "artist": "Pink Floyd",
        "album": "The Dark Side of The Moon",
        "year": "1973",
        "cover": "./assets/albumart/pink floyd - dark side of the moon.jpg",
        "description": "The greatest album of all time. The forth best-selling album of all time. Two sides of the record, two continuous pieces of music. How do you put the power and might of this album into words? You don't—just listen to it! If you don't like it, listen to it again. Listen to it while walking, while thinking, in a house, with a mouse; this album works anywhere, any time. It's your new best friend. 'Time' contains one of the most legendary guitar solos, too. I could go on and on about this album forever. There's nothing else like it.",
        "genre": "Progressive Rock",
        "rating" : "100",
        "duration": "42:57",
        "tracks": [
            "Speak To Me",
            "Breathe (In The Air)",
            "On The Run",
            "Time",
            "The Great Gig In The Sky",
            "Money",
            "Us And Them",
            "Any Colour You Like",
            "Brain Damage",
            "Eclipse"
        ],
        "applemusic":"https://music.apple.com/us/album/the-dark-side-of-the-moon/1065973699",
        "spotify":"https://open.spotify.com/album/4LH4d3cOWNNsVw41Gqt2kv"

    },
    {
        "artist": "Skin Yard",
        "album": "1000 Smiling Knuckles",
        "year": "1991",
        "cover": "./assets/albumart/skin yard - 1000 smiling knuckles.jpg",
        "description": "Described as their most complete work, <i>1000 Smiling Knuckles</i> is the forth album from Seattle Grunge pioneers Skin Yard. I don't see enough people talking about this one, and I can't recommend it enough; this EP-sized album is a pleasure to listen to over and over again.<br><br> Ben McMillan's signature disjointed, surrealist lyrics sounds so good over these energetic and sometimes ominous riffs. You can find meaning in these songs, or you don't have to. They're just words that sound good over music that sounds good. Good stuff! <br><br>I think it's one of the best Grunge albums any Seattle group put out. 'Burn A Hole', 'River Throat' and the titular track are my favourites off this one. I <i>highly</i> recommend this one.",
        "genre": "Grunge",
        "rating" : "95",
        "duration": "34:42",
        "tracks": [
            "1000 Smiling Knuckles",
            "River Throat",
            "Words on Bone",
            "Living Pool",
            "Headswill",
            "Psychoriflehypnotized",
            "Material Freak",
            "Jezechrist",
            "Nietzche with a Pizza",
            "Burn a Hole"
        ],
        "applemusic":"https://music.apple.com/us/album/1000-smiling-knuckles/520711376",
        "spotify":"https://open.spotify.com/album/6eEONt3JiPOcm8IoYRCtH0"
    },
    {
        "artist": "Nine Inch Nails",
        "album": "Broken [EP]",
        "year": "1992",
        "cover": "./assets/albumart/nine inch nails - broken.jpg",
        "description": "Pure, raw, relentless energy. This album spurs you up and sends you on a non-stop half-hour journey of colossal, aggressive guitars and distorted vocals. This EP unleashes the bitterness, hate and anger you can tangibly feel in the passionate—albeit subdued—singing on Pretty Hate Machine. It's an outburst of so many emotions, and I love it.<br><br>This EP was experimental for NIN; it served as a sandbox to test and refine sounds that would be used on <i>The Downward Spiral</i>. In fact, if you listen to this between the albums which come before and after it, it feels like a bridge between the two. This is my favourite NIN release. It's very heavy, and I think this isn't something you can recommend to just about anybody, but I think it's great. <br><br>My favourite tracks off this one are 'Last' and 'Happiness In Slavery', the latter of which is in my top three NIN songs overall.",
        "genre": "Industrial Metal",
        "rating" : "100",
        "duration": "33:09",
        "tracks": [
            "Pinion",
            "Wish",
            "Last",
            "Help Me I Am In Hell",
            "Happiness In Slavery",
            "Gave Up",
            "Physical [Bonus Track]",
            "Suck [Bonus Track]"
        ],
        "applemusic":"https://music.apple.com/us/album/broken-ep/1440743805",
        "spotify":"https://open.spotify.com/album/4jyWDa1yM9ul7zgUdR80hw"
    },
    {
        "artist": "Hater",
        "album": "Hater",
        "year": "1993",
        "cover": "./assets/albumart/hater - hater.jpg",
        "description": "Why didn't anyone tell me about Hater? How did I not find out about this sooner? There are many questions which will go unanswered in life.<br><br>If you like Grunge, or you're not allergic to fun, give this album a chance. It's the first effort of the eponymous supergrop featuring Matt Cameron (Skin Yard, Soundgarden, Temple of The Dog, Pearl Jam), John McBain (Monster Magnet), Brian Shepherd (Soundgarden) and Brian Wood (brother of Andy Wood). <br><br>This is <i>good</i>. It doesn't take itself too seriously, nor does it overstay its welcome. In fact, I would've liked it to take off it's jacket and stay awhile, but it had somewhere else to be. The eclectic mix of musicians blend their grunge, psychedelic rock and garage rock influences into a weird and enjoyable ride. My favourite track off this one is probably 'Tot Finder' or 'Sad McBain'. 'Lion and Lamb' reminds me of the beginning of Led Zeppelin's 'The Rain Song'.<br><br>Be a hater lover. ",
        "genre": "Grunge",
        "rating" : "80",
        "duration": "31:03",
        "tracks": [
            "Mona Bone Jakon",
            "Who Do I Kill?",
            "Tot Finder",
            "Lion and Lamb",
            "Roadside",
            "Down Undershoe",
            "Circles",
            "Putrid",
            "Blistered",
            "Sad McBain"
        ],
        "applemusic":"https://music.apple.com/us/album/hater/1443276130",
        "spotify":"https://open.spotify.com/artist/0cDULsp0aF8xxHVF7a7GwM"
    },
    {
        "artist": "The Tuesdays",
        "album": "The Tuesdays",
        "year": "1998",
        "cover": "./assets/albumart/the tuesdays - the tuesdays.jpg",
        "description": "Do you like The Bangles? If so, here's the <i>Norwegian Bangles</i>—The Tuesdays—with what seems to be their first album in this incarnation of the band. I found this one at a thrift store and bought it thinking 'I bet they sound like The Bangles, but with the 90s alternative edge'. Somehow, I got that right, and I enjoy this half-decent album from time to time.<br><br>It's certainly not going to blow your brains out or send you to <i>The Dark Side of The Moon</i>, but it's energetic, catchy and enjoyable. The music is awesome, but it's more often than not let down by the songwriting. I'm realizing this album doesn't really exist online, so I don't know where you'll listen to it if you want to. But hey, a wise man once said, 'life, uh, finds a way'. My favourite track off this one is 'It's up to you'.",
        "genre": "Power Pop",
        "rating" : "65",
        "duration": "44:33",
        "tracks": [
            "Too Late to Be Good",
            "It's Up to You",
            "I'll Be Here",
            "Changing The Moods",
            "Take Me Home",
            "What Is Love",
            "I Was Thinking of You",
            "I Wish It Was Yesterday",
            "Wheels",
            "Gone With The Wind",
            "When You're a Tuesday Girl"
        ],
        "applemusic": "https://music.apple.com/us/album/the-tuesdays/304805587",
        "spotify": ""
    },
    {
        "artist": "Blind Melon",
        "album": "Blind Melon",
        "year": "1992",
        "cover": "./assets/albumart/blind melon - blind melon.jpg",
        "description": "Some people call this a Grunge album, but that classification might just be due to the album having been recorded in Seattle. Whatever you may call it, <i>Blind Melon</i> is a masterpiece. <br><br>It's got a clean, comfortable kind of sound to it—'intimate', as the band called it. The album flows really well, examining the ups and downs of life through thirteen well rounded tracks. It's a real, down to Earth album which has held up to the test of time. <br><br>My favourite track off this one is 'Change' without a doubt. 'Drive' is another good one. They're all good, just listen to this one—I highly recommend it.",
        "genre": "Alternative Rock",
        "rating" : "95",
        "duration": "55:18",
        "tracks": [
            "Soak The Sin",
            "Tones of Home",
            "I Wonder",
            "Paper Scratcher",
            "Dear Ol' Dad",
            "Change",
            "No Rain",
            "Deserted",
            "Sleepyhouse",
            "Holyman",
            "Seed To A Tree",
            "Drive",
            "Time"
        ],
        "applemusic":"https://music.apple.com/us/album/blind-melon/725821342",
        "spotify":"https://open.spotify.com/artist/5sD1ZLf2dGQ9gQ3YJl1eAd"
    },
    {
        "artist": "The Sex Pistols",
        "album": "Never Mind The Bollocks",
        "year": "1976",
        "cover": "./assets/albumart/sex pistols - never mind the bollocks.jpg",
        "description": "You know that part in <i>Pride and Prejudice</i> when Elizabeth says 'Yes! A thousand times yes!'? Due to a lost manuscript, Jane Austen's most famous story has been misprinted for hundreds of years: Elizabeth was not accepting a proposal of marriage, but emphatically agreeing to listen to <i>Never Mind The Bollocks</i> for the tenth time that day.<br><br>This album is just awesome all the way through. It led a massive wave of Punk Rock in the 1970s and despite massive controversy, quickly established itself as one of the greatest albums of all time. Just listen to it! I can't recommend it enough.<br><br>My favourite tracks off this one are 'Holidays in The Sun', 'Problems' and 'God Save The Queen'. Now you got a reason now you got a reason now you got a reason to listen to this album! Now you got a reason now you got a reason now you got a reason and you're waitiiiiiing?",
        "genre": "Punk Rock",
        "rating" : "98",
        "duration": "38:48",
        "tracks": [
            "Holidays In The Sun",
            "Bodies",
            "No Feelings",
            "Liar",
            "Problems",
            "God Save The Queen",
            "Seventeen",
            "Anarchy In The UK",
            "Submission",
            "Pretty Vacant",
            "New York",
            "EMI"
        ],
        "applemusic":"https://music.apple.com/us/album/blind-melon/725821342",
        "spotify":"https://open.spotify.com/artist/5sD1ZLf2dGQ9gQ3YJl1eAd"
    },
    {
        "artist": "The Killers",
        "album": "Pressure Machine",
        "year": "2021",
        "cover": "./assets/albumart/the killers - pressure machine.jpg",
        "description": "I liked The Killers before <i>Pressure Machine</i>, I'll openly admit it. <i>Hot Fuss</i> is a good album, no matter what people might say about 'Mr. Brightside' being overplayed. That said, I didn't really take them seriously until I heard Pressure Machine.<br><br>This album is unbelievably good. Brandon Flowers woke up one day and said, 'today, I'm going to be Bruce Springsteen'. And so he did. <i>Pressure Machine</i> is a lot like <i>Nebraska</i>: a stark, semi-autobiographical album about life in small town america. It's really, really good. I know they changed a lot with their second effort, <i>Sam's Town</i>, but I think the execution is just masterful here on this album. They're in their prime, and I can't wait to see what they put out next. It's also helped me look at the rest of their discography differently and re-evaluate my opinion of <i>The Killers</i> as a whole.<br><br>My favourite tracks off this one are the titular track 'Pressure Machine', 'In Another Life' and 'In The Car Outside'.",
        "genre": "Heartland Rock",
        "rating" : "90",
        "duration": "51:22",
        "tracks": [
            "West Hills",
            "Quiet Town",
            "Terrible Thing",
            "Cody",
            "Sleepwalker",
            "Runaway Horses",
            "In The Car Outside",
            "In Another Life",
            "Desperate Things",
            "Pressure Machine",
            "The Getting By"
        ],
        "applemusic":"https://music.apple.com/us/album/blind-melon/725821342",
        "spotify":"https://open.spotify.com/artist/5sD1ZLf2dGQ9gQ3YJl1eAd"
    },
    {
        "artist": "Bruce Springsteen",
        "album": "Born In The U.S.A.",
        "year": "1984",
        "cover": "./assets/albumart/bruce springsteen - born in the usa.jpg",
        "description": "This is an absolute classic and you've got to listen to it at least once from front to back. <i>Born In The U.S.A.</i> shows Bruce Springsteen at his poppiest, most accessible songwriting game. He's neatly packaged twelve lively and largely inoffensive tunes that get you grooving and make you feel just enough, not too much. This was the best selling album of 1985 and of his career overall, also making it's mark on the list of best-selling albums of all time. <br><br>This album had the honours of being the first compact disc manufactured in the United States for commercial release. Could you find a more patriotic, American fit? This guy <i>is</i> the American Dream. He's hardworking red-blooded American who made it, and sings about all the other hardworking red-blooded Americans who want to make it, too. Sarcasm aside, I love this album, an I love that original master from 1984; it's one of the crispiest, cleanest, most dynamic pop mixes I've got in my collection. <br><br>My favourite tracks off this one are 'I'm Goin' Down', 'Bobby Jean' and the titular track 'Born in the U.S.A.'",
        "genre": "Heartland Rock",
        "rating" : "95",
        "duration": "46:41",
        "tracks": [
            "Born In The U.S.A.",
            "Cover Me",
            "Darlington County",
            "Working on the Highway",
            "Downbound Train",
            "I'm On Fire",
            "No Surrender",
            "Bobby Jean",
            "I'm Goin' Down",
            "Glory Days",
            "Dancing In The Dark"
        ],
        "applemusic":"https://music.apple.com/us/album/blind-melon/725821342",
        "spotify":"https://open.spotify.com/artist/5sD1ZLf2dGQ9gQ3YJl1eAd"
    },
    {
        "artist": "Babe Ruth",
        "album": "First Base",
        "year": "1972",
        "cover": "./assets/albumart/babe ruth - first base.jpg",
        "description": "Part Progressive Rock, part Hard Rock, all awesome. This is an unconventional but extraordinarily groovy album from UK band Babe Ruth. Jennie Haan's powerful vocals layered on all sorts of keyboards, guitars and other instruments give this release a very diverse sound across just six tracks. I think this is probably what you'd call an 'acquired taste', so I can't recommend the whole thing to everybody. Maybe give 'Wells Fargo' and 'The Mexican' a try? Those two are easy to get into, but then you'll find yourself really liking 'Black Dog', and then you're humming 'Joker' one odd afternoon. <br><br>Alan Shacklock started this outfit after playing with The Gods with Greg Lake (King Crimson), John Glascoock (Jethro Tull) and Mick Taylor (Rolling Stones) amongst others. This album did really well in Canada for some reason, and they played a couple reunion shows at the Ottawa Bluesfest in the early 2010's. Pretty cool stuff!<br><br>I came across this at random while browsing Discogs. I instantly recognized the album cover as a <i>Roger Dean</i> painting, and I took a chance on it after seeing it classified as Progressive Rock. I wasn't disappointed; if you're looking for something new and interesting that's classified under this umbrella, you probably won't be either. My favourite tracks are the aforementioned 'Wells Fargo' and 'The Mexican'.",
        "genre": "Progressive Rock",
        "rating" : "85",
        "duration": "42:02",
        "tracks": [
            "Wells Fargo",
            "The Runaways",
            "King Kong",
            "Black Dog",
            "The Mexican",
            "Joker"
        ],
        "applemusic":"https://music.apple.com/us/album/blind-melon/725821342",
        "spotify":"https://open.spotify.com/artist/5sD1ZLf2dGQ9gQ3YJl1eAd"
    },
    {
        "artist": "Gruntruck",
        "album": "Push",
        "year": "1992",
        "cover": "./assets/albumart/gruntruck - push.jpg",
        "description": "Push is heavy, fast and made to be played on MTV. These riffs will hook you in and get you excited. Although he doesn't play on this record, you can feel that Jack Endino added his special touch on the production side. Ben McMillan (previously fronting Skin Yard) brings his signature writing and singing style, and along with the heavier, more metal-like riffs, this album amounts to a big bundle of fun. If you liked Skin Yard, you'll like Gruntruck. If you like Grunge, you'll like Gruntruck. The cards were shuffled again, and the inbreeding Seattle music scene of the 1990s produced another good band that put out solid music. <br><br>Unfortunately, this was the last album released during Ben McMillan's lifetime—after some legal issues, the band took a hiatus in the early 2000s before he passed away in 2008. Thankfully, Jack Endino dug through the archives and made sure it saw the light of day in 2016. I like Gruntruck and all these Seattle bands; these guys are all a part of the scene that made some of my favourite music.<br><br>My favourite tracks off this one are 'Tribe' and 'Break'.",
        "genre": "Grunge",
        "rating" : "85",
        "duration": "53:47",
        "tracks": [
            "Tribe",
            "Machine Action",
            "Racked",
            "Crazy Love",
            "Above Me",
            "Gotta Believe",
            "Break",
            "Slow Scorch",
            "Follow",
            "Body Farm",
            "Lose",
            "Push"
        ],
        "applemusic":"https://music.apple.com/us/album/blind-melon/725821342",
        "spotify":"https://open.spotify.com/artist/5sD1ZLf2dGQ9gQ3YJl1eAd"
    },
    {
        "artist": "Alice In Chains",
        "album": "Black Gives Way To Blue",
        "year": "2009",
        "cover": "./assets/albumart/alice in chains - black gives way to blue.jpg",
        "description": "Will I be whipped in the town square if I say a post-Staley AIC album is my favourite from the group? Probably. Before I get dragged off in a burlap sack, let me tell you about this awesome album.<br><br>Alice In Chains were thought to be long gone after the death of one of their lead singers—the aforementioned late great Layne Staley. The surviving lineup stayed together, and with the addition of William DuVall, Jerry Cantrell and the gang pulled together and continued producing great music. With this album, you can really feel Cantrell's influence, and you realize that a lot of their greatness in the 1990s is because of his musical genius. They grew as a band, expanded their sound, and they're better than ever.<br><br>It's controversial, for some reason. There's just so many 'fans' out there who hate good music, beat puppies and reject this because it's not the original lineup. Well, 75% of them are still there, and 100% of it is really good music. How many of the Grunge titans of the 90s are still active these days? Some people just can't accept that bands change over the years. Change is good, most of the time—if you're not Billy Corgan.<br><br>My favourite tracks off this one are 'Private Hell' and 'Lesson Learned'. This is my favourite Alice In Chains album. There, I said it. If I don't update this website in the next six months, the angry Staley-loyalist Redditors got me.",
        "genre": "Grunge",
        "rating" : "97",
        "duration": "54:12",
        "tracks": [
            "All Secrets Known",
            "Check My Brain",
            "Last of My Kind",
            "Your Decision",
            "A Looking In View",
            "When The Sun Rose Again",
            "Acid Bubble",
            "Lesson Learned",
            "Take Her Out",
            "Private Hell",
            "Black Gives Way To Blue"
        ],
        "applemusic":"https://music.apple.com/us/album/blind-melon/725821342",
        "spotify":"https://open.spotify.com/artist/5sD1ZLf2dGQ9gQ3YJl1eAd"
    },
    {
        "artist": "Green Day",
        "album": "Revolution Radio",
        "year": "2016",
        "cover": "./assets/albumart/green day - revolution radio.jpg",
        "description": "I was surprised when other people weren't as excited about this Green Day album as I was when it came out; I think it's just as good as any of their best albums. Late into their career, I think this album is somehow faster and more energetic than their older stuff. Some of the songs revolve around Billie Joe Armstrong's journey to sobriety after iHeart Radio 2012, while others are more politically charged. 'Youngblood' apparently hails from the <i>Cigarettes and Valentines</i> era, with some other tracks coming from the vault to make an appearence as well. Green Day prove once again that nobody makes music like they do, and they're still at the top of their game.<br><br>I can't believe it's been almost ten years since this album came out at the time of writing. I remember where I was the day all the singles came out! I loved it back then, and I love it more now. Life's changed a lot since the first time I heard it, and I'm in a much better place to enjoy it. Everything's changed, but in some ways, things have stayed the same. Whether you like him or not, Trump is back in office and causing boatloads of uncertainty. If only Green Day—our Saviors—would come back and release another album...<br><br>My favourite tracks off this one are 'Revolution Radio', 'Bang Bang', 'Forever Now' and 'Still Breathing'. This is seriously one of their best albums.",
        "genre": "Punk Rock",
        "rating" : "95",
        "duration": "44:40",
        "tracks": [
            "Somewhere Now",
            "Bang Bang",
            "Revolution Radio",
            "Say Goodbye",
            "Outlaws",
            "Bouncing Off The Wall",
            "Still Breathing",
            "Youngblood",
            "Too Dumb To Die",
            "Troubled Times",
            "Forever Now",
            "Ordinary World"
        ],
        "applemusic":"https://music.apple.com/us/album/blind-melon/725821342",
        "spotify":"https://open.spotify.com/artist/5sD1ZLf2dGQ9gQ3YJl1eAd"
    },
    {
        "artist": "Green Day",
        "album": "Saviors",
        "year": "2024",
        "cover": "./assets/albumart/green day - saviors.jpg",
        "description": "They teased their so-called upcoming album <i>1972</i> for so many years, but oh boy, it was worth the wait! With Saviors, I think Green Day has cemented their legacy as one of the best bands to ever do it. I'm a huge Green Day fan, but I'm also very critical when I don't like something. There's just nothing to complain about here! This is everything I wanted from a new Green Day album.<br><br> It's amazing that a band can put out such a great album so late in their careers. It shows a band that hasn't gotten stuck doing the same old thing, and a band that's not growing in the wrong direction. They're adding to their musical repertoire and making their sound better than ever. Nothing can ever stay the same, and it shouldn't be.<br><br>My favourite tracks off this one are '1981', 'Dilemma', 'Strange Days Are Here To Stay' and 'Suzie Chapstick'.",
        "genre": "Punk Rock",
        "rating" : "97",
        "duration": "46:02",
        "tracks": [
            "The American Dream Is Killing Me",
            "Look Ma, No Brains!",
            "Bobby Sox",
            "One Eyed Bastard",
            "Dilemma",
            "1981",
            "Goodnight Adeline",
            "Coma City",
            "Corvette Summer",
            "Suzie Chapstick",
            "Strange Days Are Here To Stay",
            "Living in the 20s",
            "Father to a Son",
            "Saviors",
            "Fancy Sauce"
        ],
        "applemusic":"https://music.apple.com/us/album/blind-melon/725821342",
        "spotify":"https://open.spotify.com/artist/5sD1ZLf2dGQ9gQ3YJl1eAd"
    },
    {
        "artist": "Hammerbox",
        "album": "Numb",
        "year": "1993",
        "cover": "./assets/albumart/hammerbox - numb.jpg",
        "description": "This is a heavy, hard hitting album from Seattle group Hammerbox. It sounds like a mish-mash of all the other bands in the scene, but it stands alone from all the rest thanks to Carrie Akre's extraordinary vocals. If you like Grunge or Alternative Rock, listen to this awesome album. Avril Lavigne wishes she was this cool, but knows she could never. <br><br>My favourite songs off this one are 'God', 'Outside' 'Trip' and 'When 3 is 2'.",
        "genre": "Grunge",
        "rating" : "85",
        "duration": "41:59",
        "tracks": [
            "Hole",
            "Hed",
            "No",
            "Blur",
            "Outside",
            "When 3 is 2",
            "Trip",
            "Attack of The Slime Creatures",
            "God",
            "Simple Passing",
            "Sleep",
            "Anywhere But Here"
        ],
        "applemusic":"https://music.apple.com/us/album/blind-melon/725821342",
        "spotify":"https://open.spotify.com/artist/5sD1ZLf2dGQ9gQ3YJl1eAd"
    },
    {
        "artist": "Alice In Chains",
        "album": "The Devil Put Dinosaurs Here",
        "year": "2013",
        "cover": "./assets/albumart/alice in chains - the devil put dinosaurs here.jpg",
        "description": "In 2013, Alice In Chains returned to tell world <i>The Devil Put Dinosaurs Here</i>. It's a longer, slower, lumbering album, much like their self-titled album. That said, it's undoubtedly an Alice In Chains album, and I love it. Despite it being longer and slower, it's paced well and doesn't feel like it overstays it's welcome. I was actually surprised to see that it's almost seventy minutes when I wrote this. <i>Dinosaurs</i> feels cold, harsh, and somehow 'bigger' than the previous in the sound of the guitars. Will DuVall features on more songs than he did on the previous album, and it becomes clear that he's an asset to the band.<br><br>I already said that <i>Black Gives Way To Blue</i> is probably my favourite AIC album—I can confirm that I was stuffed in a burlap sack and whipped in the town square for saying so. I really like this album, too. I don't know where it ranks, but it's in the top five, possibly top four for this band. My favourite tracks are 'Hollow', 'Hung on a Hook', 'Choke', and 'Stone'.",
        "genre": "Grunge",
        "rating" : "90",
        "duration": "67:17",
        "tracks": [
            "Hollow",
            "Prettty Done",
            "Stone",
            "Voices",
            "The Devil Put Dinosaurs Here",
            "Lab Monkey",
            "Low Ceiling",
            "Breath on a Window",
            "Scalpel",
            "Phantom Limb",
            "Hung on a Hook",
            "Choke"
        ],
        "applemusic":"https://music.apple.com/us/album/blind-melon/725821342",
        "spotify":"https://open.spotify.com/artist/5sD1ZLf2dGQ9gQ3YJl1eAd"
    },
    {
        "artist": "The Smashing Pumpkins",
        "album": "Thirty-Three [Single]",
        "year": "1996",
        "cover": "./assets/albumart/the smashing pumpkins - thirty-three [single].jpg",
        "description": "This single is a mish-mash of songs that presumably didn't make it onto <i>Mellon-Collie And The Infinite Sadness</i>. I quite like it; it's labelled a single, but it's more like an EP, just like the rest of their Mellon Collie singles.<br><br>The title track is pretty interesting, and this Single made me appreciate it more after listening to it so many times. I really like The Smashing Pumpkins, and I'm glad they've released a crapload of music—especially from this era. My favourite tracks off this one are colossally brooding 'The Aeroplane Flies High' and 'Transformer', both of which I think are highlights of their discography.",
        "genre": "Alternative Rock",
        "rating" : "70",
        "duration": "25:46",
        "tracks": [
            "Thirty-Three",
            "The Last Song",
            "The Aeroplane Flies High",
            "Transformer",
            "The Bells",
            "My Blue Heaven"
        ],
        "applemusic":"https://music.apple.com/us/album/blind-melon/725821342",
        "spotify":"https://open.spotify.com/artist/5sD1ZLf2dGQ9gQ3YJl1eAd"
    }
]