[
    {
        "artist": "Rush",
        "album": "2112",
        "year": "1976",
        "cover": "./assets/albumart/rush - 2112.jpg",
        "description": "This album is so good, they named the time (21:12) after it.<br><br>Rush is a band of best friends who loved music—you can feel it in the spirit of all their albums. <i>2112</i> is an album of two halves: the former tells a 20-minute, seven part story of a dystopian future where the high priests of the Temples of Syrinx control the media humanity consumes. The music is larger than life and the vocals are epic. The second side is more conventional Rush, and it's awesome too. '2112' and 'Lessons' are my favourite tracks. ",
        "genre": "Progressive Rock",
        "rating" : "90",
        "duration": "38:42",
        "tracks": [
            "2112",
            "A Passage To Bangkok",
            "The Twilight Zone",
            "Lessons",
            "Tears",
            "Something For Nothing"
        ],
        "applemusic":"https://music.apple.com/us/album/2112-remastered-2012/1445876680",
        "spotify":""
    },
    {
        "artist": "Nine Inch Nails",
        "album": "Add Violence [EP]",
        "year": "2017",
        "cover": "./assets/albumart/nine inch nails - add violence.jpg",
        "description": "Some people complain that Trent Reznor got soft in the early 2010's with the synth-driven <i>Hesitation Marks</i>. They're the same kinds of people who crap on Green Day's <i>Warning</i>, argue that The Clash isn't punk, Alice In Chains shouldn't have continued and Prog bands all committed treason in the 1980s: they're missing out on the good things in life. <br><br>The aforementioned Nine Inch Nails releases are undoubtedly Nine Inch Nails—they ooze the craftsmanship and quality of Trent Reznor's work, and they're a lot of fun to listen to. Add Violence has a bit of an angrier, harder edge than the former, and I quite like it. This certainly feels like an artist growing and evolving.<br><br>The long, repetitive breakdown of 'The Background World' bothered me at first, but I don't mind it anymore. 'Less Than' and 'Not Anymore' are my favourite tracks off this one; the former is up there with NIN's best.",
        "genre": "Industrial Rock",
        "rating" : "75",
        "duration": "27:14",
        "tracks": [
            "Less Than",
            "The Lovers",
            "This Isn't The Place",
            "Not Anymore",
            "The Background World"
        ],
        "applemusic":"https://music.apple.com/us/album/add-violence/1260014946",
        "spotify":"https://open.spotify.com/album/28DJ00Yr5oOhH0uOUgTQwc"
    },
    {
        "artist": "Pink Floyd",
        "album": "The Dark Side of The Moon",
        "year": "1973",
        "cover": "./assets/albumart/pink floyd - the dark side of the moon.jpg",
        "description": "The greatest album of all time. The forth best-selling album of all time. Two sides of the record, two continuous pieces of music. How do you put the power and might of this album into words? You don't—just listen to it! If you don't like it, listen to it again. Listen to it while walking, while thinking, in a house, with a mouse; this album works anywhere, any time. It's your new best friend. 'Time' contains one of the most legendary guitar solos, too. I could go on and on about this album forever. There's nothing else like it.",
        "genre": "Progressive Rock",
        "rating" : "100",
        "duration": "42:57",
        "tracks": [
            "Speak To Me",
            "Breathe (In The Air)",
            "On The Run",
            "Time",
            "The Great Gig In The Sky",
            "Money",
            "Us And Them",
            "Any Colour You Like",
            "Brain Damage",
            "Eclipse"
        ],
        "applemusic":"https://music.apple.com/us/album/the-dark-side-of-the-moon/1065973699",
        "spotify":"https://open.spotify.com/album/4LH4d3cOWNNsVw41Gqt2kv"

    },
    {
        "artist": "Skin Yard",
        "album": "1000 Smiling Knuckles",
        "year": "1991",
        "cover": "./assets/albumart/skin yard - 1000 smiling knuckles.jpg",
        "description": "Described as their most complete work, <i>1000 Smiling Knuckles</i> is the forth album from Seattle Grunge pioneers Skin Yard. I don't see enough people talking about this one, and I can't recommend it enough; this EP-sized album is a pleasure to listen to over and over again.<br><br> Ben McMillan's signature disjointed, surrealist lyrics sounds so good over these energetic and sometimes ominous riffs. You can find meaning in these songs, or you don't have to. They're just words that sound good over music that sounds good. Good stuff! <br><br>I think it's one of the best Grunge albums any Seattle group put out. 'Burn A Hole', 'River Throat' and the titular track are my favourites off this one. I <i>highly</i> recommend this one.",
        "genre": "Grunge",
        "rating" : "95",
        "duration": "34:42",
        "tracks": [
            "1000 Smiling Knuckles",
            "River Throat",
            "Words on Bone",
            "Living Pool",
            "Headswill",
            "Psychoriflehypnotized",
            "Material Freak",
            "Jezechrist",
            "Nietzche with a Pizza",
            "Burn a Hole"
        ],
        "applemusic":"https://music.apple.com/us/album/1000-smiling-knuckles/520711376",
        "spotify":"https://open.spotify.com/album/6eEONt3JiPOcm8IoYRCtH0"
    },
    {
        "artist": "Nine Inch Nails",
        "album": "Broken [EP]",
        "year": "1992",
        "cover": "./assets/albumart/nine inch nails - broken.jpg",
        "description": "Pure, raw, relentless energy. This album spurs you up and sends you on a non-stop half-hour journey of colossal, aggressive guitars and distorted vocals. This EP unleashes the bitterness, hate and anger you can tangibly feel in the passionate—albeit subdued—singing on Pretty Hate Machine. It's an outburst of so many emotions, and I love it.<br><br>This EP was experimental for NIN; it served as a sandbox to test and refine sounds that would be used on <i>The Downward Spiral</i>. In fact, if you listen to this between the albums which come before and after it, it feels like a bridge between the two. This is my favourite NIN release. It's very heavy, and I think this isn't something you can recommend to just about anybody, but I think it's great. <br><br>My favourite tracks off this one are 'Last' and 'Happiness In Slavery', the latter of which is in my top three NIN songs overall.",
        "genre": "Industrial Metal",
        "rating" : "100",
        "duration": "33:09",
        "tracks": [
            "Pinion",
            "Wish",
            "Last",
            "Help Me I Am In Hell",
            "Happiness In Slavery",
            "Gave Up",
            "Physical [Bonus Track]",
            "Suck [Bonus Track]"
        ],
        "applemusic":"https://music.apple.com/us/album/broken-ep/1440743805",
        "spotify":"https://open.spotify.com/album/4jyWDa1yM9ul7zgUdR80hw"
    },
    {
        "artist": "Hater",
        "album": "Hater",
        "year": "1993",
        "cover": "./assets/albumart/hater - hater.jpg",
        "description": "Why didn't anyone tell me about Hater? How did I not find out about this sooner? There are many questions which will go unanswered in life.<br><br>If you like Grunge, or you're not allergic to fun, give this album a chance. It's the first effort of the eponymous supergrop featuring Matt Cameron (Skin Yard, Soundgarden, Temple of The Dog, Pearl Jam), John McBain (Monster Magnet), Brian Shepherd (Soundgarden) and Brian Wood (brother of Andy Wood). <br><br>This is <i>good</i>. It doesn't take itself too seriously, nor does it overstay its welcome. In fact, I would've liked it to take off it's jacket and stay awhile, but it had somewhere else to be. The eclectic mix of musicians blend their grunge, psychedelic rock and garage rock influences into a weird and enjoyable ride. My favourite track off this one is probably 'Tot Finder' or 'Sad McBain'. 'Lion and Lamb' reminds me of the beginning of Led Zeppelin's 'The Rain Song'.<br><br>Be a hater lover. ",
        "genre": "Grunge",
        "rating" : "80",
        "duration": "31:03",
        "tracks": [
            "Mona Bone Jakon",
            "Who Do I Kill?",
            "Tot Finder",
            "Lion and Lamb",
            "Roadside",
            "Down Undershoe",
            "Circles",
            "Putrid",
            "Blistered",
            "Sad McBain"
        ],
        "applemusic":"https://music.apple.com/us/album/hater/1443276130",
        "spotify":"https://open.spotify.com/artist/0cDULsp0aF8xxHVF7a7GwM"
    },
    {
        "artist": "The Tuesdays",
        "album": "The Tuesdays",
        "year": "1998",
        "cover": "./assets/albumart/the tuesdays - the tuesdays.jpg",
        "description": "Do you like The Bangles? If so, here's the <i>Norwegian Bangles</i>—The Tuesdays—with what seems to be their first album in this incarnation of the band. I found this one at a thrift store and bought it thinking 'I bet they sound like The Bangles, but with the 90s alternative edge'. Somehow, I got that right, and I enjoy this half-decent album from time to time.<br><br>It's certainly not going to blow your brains out or send you to <i>The Dark Side of The Moon</i>, but it's energetic, catchy and enjoyable. The music is awesome, but it's more often than not let down by the songwriting. I'm realizing this album doesn't really exist online, so I don't know where you'll listen to it if you want to. But hey, a wise man once said, 'life, uh, finds a way'. My favourite track off this one is 'It's up to you'.",
        "genre": "Power Pop",
        "rating" : "65",
        "duration": "44:33",
        "tracks": [
            "Too Late to Be Good",
            "It's Up to You",
            "I'll Be Here",
            "Changing The Moods",
            "Take Me Home",
            "What Is Love",
            "I Was Thinking of You",
            "I Wish It Was Yesterday",
            "Wheels",
            "Gone With The Wind",
            "When You're a Tuesday Girl"
        ],
        "applemusic": "https://music.apple.com/us/album/the-tuesdays/304805587",
        "spotify": ""
    },
    {
        "artist": "Blind Melon",
        "album": "Blind Melon",
        "year": "1992",
        "cover": "./assets/albumart/blind melon - blind melon.jpg",
        "description": "Some people call this a Grunge album, but that classification might just be due to the album having been recorded in Seattle. Whatever you may call it, <i>Blind Melon</i> is a masterpiece. <br><br>It's got a clean, comfortable kind of sound to it—'intimate', as the band called it. The album flows really well, examining the ups and downs of life through thirteen well rounded tracks. It's a real, down to Earth album which has held up to the test of time. <br><br>My favourite track off this one is 'Change' without a doubt. 'Drive' is another good one. They're all good, just listen to this one—I highly recommend it.",
        "genre": "Alternative Rock",
        "rating" : "95",
        "duration": "55:18",
        "tracks": [
            "Soak The Sin",
            "Tones of Home",
            "I Wonder",
            "Paper Scratcher",
            "Dear Ol' Dad",
            "Change",
            "No Rain",
            "Deserted",
            "Sleepyhouse",
            "Holyman",
            "Seed To A Tree",
            "Drive",
            "Time"
        ],
        "applemusic":"https://music.apple.com/us/album/blind-melon/725821342",
        "spotify":"https://open.spotify.com/artist/5sD1ZLf2dGQ9gQ3YJl1eAd"
    },
    {
        "artist": "The Sex Pistols",
        "album": "Never Mind The Bollocks",
        "year": "1976",
        "cover": "./assets/albumart/the sex pistols - never mind the bollocks.jpg",
        "description": "You know that part in <i>Pride and Prejudice</i> when Elizabeth says 'Yes! A thousand times yes!'? Due to a lost manuscript, Jane Austen's most famous story has been misprinted for hundreds of years: Elizabeth was not accepting a proposal of marriage, but emphatically agreeing to listen to <i>Never Mind The Bollocks</i> for the tenth time that day.<br><br>This album is just awesome all the way through. It led a massive wave of Punk Rock in the 1970s and despite massive controversy, quickly established itself as one of the greatest albums of all time. Just listen to it! I can't recommend it enough.<br><br>My favourite tracks off this one are 'Holidays in The Sun', 'Problems' and 'God Save The Queen'. Now you got a reason now you got a reason now you got a reason to listen to this album! Now you got a reason now you got a reason now you got a reason and you're waitiiiiiing?",
        "genre": "Punk Rock",
        "rating" : "98",
        "duration": "38:48",
        "tracks": [
            "Holidays In The Sun",
            "Bodies",
            "No Feelings",
            "Liar",
            "Problems",
            "God Save The Queen",
            "Seventeen",
            "Anarchy In The UK",
            "Submission",
            "Pretty Vacant",
            "New York",
            "EMI"
        ],
        "applemusic":"https://music.apple.com/us/album/never-mind-the-bollocks-heres-the-sex-pistols/266317242",
        "spotify":"https://open.spotify.com/album/5fxYu3rqjCNTSPKN8mtEl2"
    },
    {
        "artist": "The Killers",
        "album": "Pressure Machine",
        "year": "2021",
        "cover": "./assets/albumart/the killers - pressure machine.jpg",
        "description": "I liked The Killers before <i>Pressure Machine</i>, I'll openly admit it. <i>Hot Fuss</i> is a good album, no matter what people might say about 'Mr. Brightside' being overplayed. That said, I didn't really take them seriously until I heard Pressure Machine.<br><br>This album is unbelievably good. Brandon Flowers woke up one day and said, 'today, I'm going to be Bruce Springsteen'. And so he did. <i>Pressure Machine</i> is a lot like <i>Nebraska</i>: a stark, semi-autobiographical album about life in small town america. It's really, really good. I know they changed a lot with their second effort, <i>Sam's Town</i>, but I think the execution is just masterful here on this album. They're in their prime, and I can't wait to see what they put out next. It's also helped me look at the rest of their discography differently and re-evaluate my opinion of <i>The Killers</i> as a whole.<br><br>My favourite tracks off this one are the titular track 'Pressure Machine', 'In Another Life' and 'In The Car Outside'.",
        "genre": "Heartland Rock",
        "rating" : "90",
        "duration": "51:22",
        "tracks": [
            "West Hills",
            "Quiet Town",
            "Terrible Thing",
            "Cody",
            "Sleepwalker",
            "Runaway Horses",
            "In The Car Outside",
            "In Another Life",
            "Desperate Things",
            "Pressure Machine",
            "The Getting By"
        ],
        "applemusic":"https://music.apple.com/us/album/pressure-machine/1576945214",
        "spotify":"https://open.spotify.com/album/1qMFjBarjO2xD15BwXZguD"
    },
    {
        "artist": "Bruce Springsteen",
        "album": "Born In The U.S.A.",
        "year": "1984",
        "cover": "./assets/albumart/bruce springsteen - born in the usa.jpg",
        "description": "This is an absolute classic and you've got to listen to it at least once from front to back. <i>Born In The U.S.A.</i> shows Bruce Springsteen at his poppiest, most accessible songwriting game. He's neatly packaged twelve lively and largely inoffensive tunes that get you grooving and make you feel just enough, not too much. This was the best selling album of 1985 and of his career overall, also making it's mark on the list of best-selling albums of all time. <br><br>This album had the honours of being the first compact disc manufactured in the United States for commercial release. Could you find a more patriotic, American fit? This guy <i>is</i> the American Dream. He's hardworking red-blooded American who made it, and sings about all the other hardworking red-blooded Americans who want to make it, too. Sarcasm aside, I love this album, an I love that original master from 1984; it's one of the crispiest, cleanest, most dynamic pop mixes I've got in my collection. <br><br>My favourite tracks off this one are 'I'm Goin' Down', 'Bobby Jean' and the titular track 'Born in the U.S.A.'",
        "genre": "Heartland Rock",
        "rating" : "95",
        "duration": "46:41",
        "tracks": [
            "Born In The U.S.A.",
            "Cover Me",
            "Darlington County",
            "Working on the Highway",
            "Downbound Train",
            "I'm On Fire",
            "No Surrender",
            "Bobby Jean",
            "I'm Goin' Down",
            "Glory Days",
            "Dancing In The Dark"
        ],
        "applemusic":"https://music.apple.com/us/album/born-in-the-u-s-a/203708420",
        "spotify":"https://open.spotify.com/album/0PMasrHdpaoIRuHuhHp72O"
    },
    {
        "artist": "Babe Ruth",
        "album": "First Base",
        "year": "1972",
        "cover": "./assets/albumart/babe ruth - first base.jpg",
        "description": "Part Progressive Rock, part Hard Rock, all awesome. This is an unconventional but extraordinarily groovy album from UK band Babe Ruth. Jennie Haan's powerful vocals layered on all sorts of keyboards, guitars and other instruments give this release a very diverse sound across just six tracks. I think this is probably what you'd call an 'acquired taste', so I can't recommend the whole thing to everybody. Maybe give 'Wells Fargo' and 'The Mexican' a try? Those two are easy to get into, but then you'll find yourself really liking 'Black Dog', and then you're humming 'Joker' one odd afternoon. <br><br>Alan Shacklock started this outfit after playing with The Gods with Greg Lake (King Crimson), John Glascoock (Jethro Tull) and Mick Taylor (Rolling Stones) amongst others. This album did really well in Canada for some reason, and they played a couple reunion shows at the Ottawa Bluesfest in the early 2010's. Pretty cool stuff!<br><br>I came across this at random while browsing Discogs. I instantly recognized the album cover as a <i>Roger Dean</i> painting, and I took a chance on it after seeing it classified as Progressive Rock. I wasn't disappointed; if you're looking for something new and interesting that's classified under this umbrella, you probably won't be either. My favourite tracks are the aforementioned 'Wells Fargo' and 'The Mexican'.",
        "genre": "Progressive Rock",
        "rating" : "85",
        "duration": "42:02",
        "tracks": [
            "Wells Fargo",
            "The Runaways",
            "King Kong",
            "Black Dog",
            "The Mexican",
            "Joker"
        ],
        "applemusic":"https://music.apple.com/us/album/first-base-remastered/691335247",
        "spotify":"https://open.spotify.com/album/3sW6cFk8bYvfMIt1DxhWor"
    },
    {
        "artist": "Gruntruck",
        "album": "Push",
        "year": "1992",
        "cover": "./assets/albumart/gruntruck - push.jpg",
        "description": "Push is heavy, fast and made to be played on MTV. These riffs will hook you in and get you excited. Although he doesn't play on this record, you can feel that Jack Endino added his special touch on the production side. Ben McMillan (previously fronting Skin Yard) brings his signature writing and singing style, and along with the heavier, more metal-like riffs, this album amounts to a big bundle of fun. If you liked Skin Yard, you'll like Gruntruck. If you like Grunge, you'll like Gruntruck. The cards were shuffled again, and the inbreeding Seattle music scene of the 1990s produced another good band that put out solid music. <br><br>Unfortunately, this was the last album released during Ben McMillan's lifetime—after some legal issues, the band took a hiatus in the early 2000s before he passed away in 2008. Thankfully, Jack Endino dug through the archives and made sure it saw the light of day in 2016. I like Gruntruck and all these Seattle bands; these guys are all a part of the scene that made some of my favourite music.<br><br>My favourite tracks off this one are 'Tribe' and 'Break'.",
        "genre": "Grunge",
        "rating" : "85",
        "duration": "53:47",
        "tracks": [
            "Tribe",
            "Machine Action",
            "Racked",
            "Crazy Love",
            "Above Me",
            "Gotta Believe",
            "Break",
            "Slow Scorch",
            "Follow",
            "Body Farm",
            "Lose",
            "Push"
        ],
        "applemusic":"https://music.apple.com/us/album/push/299831621",
        "spotify":"https://open.spotify.com/album/3gddM4c24OsUsD35q9qdFT"
    },
    {
        "artist": "Alice In Chains",
        "album": "Black Gives Way To Blue",
        "year": "2009",
        "cover": "./assets/albumart/alice in chains - black gives way to blue.jpg",
        "description": "Will I be whipped in the town square if I say a post-Staley AIC album is my favourite from the group? Probably. Before I get dragged off in a burlap sack, let me tell you about this awesome album.<br><br>Alice In Chains were thought to be long gone after the death of one of their lead singers—the aforementioned late great Layne Staley. The surviving lineup stayed together, and with the addition of William DuVall, Jerry Cantrell and the gang pulled together and continued producing great music. With this album, you can really feel Cantrell's influence, and you realize that a lot of their greatness in the 1990s is because of his musical genius. They grew as a band, expanded their sound, and they're better than ever.<br><br>It's controversial, for some reason. There's just so many 'fans' out there who hate good music, beat puppies and reject this because it's not the original lineup. Well, 75% of them are still there, and 100% of it is really good music. How many of the Grunge titans of the 90s are still active these days? Some people just can't accept that bands change over the years. Change is good, most of the time—if you're not Billy Corgan.<br><br>My favourite tracks off this one are 'Private Hell' and 'Lesson Learned'. This is my favourite Alice In Chains album. There, I said it. If I don't update this website in the next six months, the angry Staley-loyalist Redditors got me.",
        "genre": "Grunge",
        "rating" : "97",
        "duration": "54:12",
        "tracks": [
            "All Secrets Known",
            "Check My Brain",
            "Last of My Kind",
            "Your Decision",
            "A Looking In View",
            "When The Sun Rose Again",
            "Acid Bubble",
            "Lesson Learned",
            "Take Her Out",
            "Private Hell",
            "Black Gives Way To Blue"
        ],
        "applemusic":"https://music.apple.com/us/album/black-gives-way-to-blue/1751195189",
        "spotify":"https://open.spotify.com/album/4puIIbtVV70tew9msnAEUY"
    },
    {
        "artist": "Green Day",
        "album": "Revolution Radio",
        "year": "2016",
        "cover": "./assets/albumart/green day - revolution radio.jpg",
        "description": "I was surprised when other people weren't as excited about this Green Day album as I was when it came out; I think it's just as good as any of their best albums. Late into their career, I think this album is somehow faster and more energetic than their older stuff. Some of the songs revolve around Billie Joe Armstrong's journey to sobriety after iHeart Radio 2012, while others are more politically charged. 'Youngblood' apparently hails from the <i>Cigarettes and Valentines</i> era, with some other tracks coming from the vault to make an appearence as well. Green Day prove once again that nobody makes music like they do, and they're still at the top of their game.<br><br>I can't believe it's been almost ten years since this album came out at the time of writing. I remember where I was the day all the singles came out! I loved it back then, and I love it more now. Life's changed a lot since the first time I heard it, and I'm in a much better place to enjoy it. Everything's changed, but in some ways, things have stayed the same. Whether you like him or not, Trump is back in office and causing boatloads of uncertainty. If only Green Day—our Saviors—would come back and release another album...<br><br>My favourite tracks off this one are 'Revolution Radio', 'Bang Bang', 'Forever Now' and 'Still Breathing'. This is seriously one of their best albums.",
        "genre": "Punk Rock",
        "rating" : "97",
        "duration": "44:40",
        "tracks": [
            "Somewhere Now",
            "Bang Bang",
            "Revolution Radio",
            "Say Goodbye",
            "Outlaws",
            "Bouncing Off The Wall",
            "Still Breathing",
            "Youngblood",
            "Too Dumb To Die",
            "Troubled Times",
            "Forever Now",
            "Ordinary World"
        ],
        "applemusic":"https://music.apple.com/us/album/revolution-radio/1140560324",
        "spotify":"https://open.spotify.com/album/5a3LqvNt2nv1B4aRKXmgOV"
    },
    {
        "artist": "Green Day",
        "album": "Saviors",
        "year": "2024",
        "cover": "./assets/albumart/green day - saviors.jpg",
        "description": "They teased their so-called upcoming album <i>1972</i> for so many years, but oh boy, it was worth the wait! With Saviors, I think Green Day has cemented their legacy as one of the best bands to ever do it. I'm a huge Green Day fan, but I'm also very critical when I don't like something. There's just nothing to complain about here! This is everything I wanted from a new Green Day album.<br><br> It's amazing that a band can put out such a great album so late in their careers. It shows a band that hasn't gotten stuck doing the same old thing, and a band that's not growing in the wrong direction. They're adding to their musical repertoire and making their sound better than ever. Nothing can ever stay the same, and it shouldn't be.<br><br>My favourite tracks off this one are '1981', 'Dilemma', 'Strange Days Are Here To Stay' and 'Suzie Chapstick'.",
        "genre": "Punk Rock",
        "rating" : "96",
        "duration": "46:02",
        "tracks": [
            "The American Dream Is Killing Me",
            "Look Ma, No Brains!",
            "Bobby Sox",
            "One Eyed Bastard",
            "Dilemma",
            "1981",
            "Goodnight Adeline",
            "Coma City",
            "Corvette Summer",
            "Suzie Chapstick",
            "Strange Days Are Here To Stay",
            "Living in the 20s",
            "Father to a Son",
            "Saviors",
            "Fancy Sauce"
        ],
        "applemusic":"https://music.apple.com/us/album/saviors/1711049681",
        "spotify":"https://open.spotify.com/album/4AIeqAMDyIT884A9uA2A0i"
    },
    {
        "artist": "Hammerbox",
        "album": "Numb",
        "year": "1993",
        "cover": "./assets/albumart/hammerbox - numb.jpg",
        "description": "This is a heavy, hard hitting album from Seattle group Hammerbox. It sounds like a mish-mash of all the other bands in the scene, but it stands alone from all the rest thanks to Carrie Akre's extraordinary vocals. If you like Grunge or Alternative Rock, listen to this awesome album. Avril Lavigne wishes she was this cool, but knows she could never. <br><br>My favourite songs off this one are 'God', 'Outside' 'Trip' and 'When 3 is 2'.",
        "genre": "Grunge",
        "rating" : "85",
        "duration": "41:59",
        "tracks": [
            "Hole",
            "Hed",
            "No",
            "Blur",
            "Outside",
            "When 3 is 2",
            "Trip",
            "Attack of The Slime Creatures",
            "God",
            "Simple Passing",
            "Sleep",
            "Anywhere But Here"
        ],
        "applemusic":"https://music.apple.com/us/album/numb/1444028033",
        "spotify":"hhttps://open.spotify.com/album/6swT0mVKg2HdM9R8w0889H"
    },
    {
        "artist": "Alice In Chains",
        "album": "The Devil Put Dinosaurs Here",
        "year": "2013",
        "cover": "./assets/albumart/alice in chains - the devil put dinosaurs here.jpg",
        "description": "In 2013, Alice In Chains returned to tell world <i>The Devil Put Dinosaurs Here</i>. It's a longer, slower, lumbering album, much like their self-titled album. That said, it's undoubtedly an Alice In Chains album, and I love it. Despite it being longer and slower, it's paced well and doesn't feel like it overstays it's welcome. I was actually surprised to see that it's almost seventy minutes when I wrote this. <i>Dinosaurs</i> feels cold, harsh, and somehow 'bigger' than the previous in the sound of the guitars. Will DuVall features on more songs than he did on the previous album, and it becomes clear that he's an asset to the band.<br><br>I already said that <i>Black Gives Way To Blue</i> is probably my favourite AIC album—I can confirm that I was stuffed in a burlap sack and whipped in the town square for saying so. I really like this album, too. I don't know where it ranks, but it's in the top five, possibly top four for this band. My favourite tracks are 'Hollow', 'Hung on a Hook', 'Choke', and 'Stone'.",
        "genre": "Grunge",
        "rating" : "90",
        "duration": "67:17",
        "tracks": [
            "Hollow",
            "Prettty Done",
            "Stone",
            "Voices",
            "The Devil Put Dinosaurs Here",
            "Lab Monkey",
            "Low Ceiling",
            "Breath on a Window",
            "Scalpel",
            "Phantom Limb",
            "Hung on a Hook",
            "Choke"
        ],
        "applemusic":"https://music.apple.com/us/album/blind-melon/725821342",
        "spotify":"https://open.spotify.com/artist/5sD1ZLf2dGQ9gQ3YJl1eAd"
    },
    {
        "artist": "The Smashing Pumpkins",
        "album": "Thirty-Three [Single]",
        "year": "1996",
        "cover": "./assets/albumart/the smashing pumpkins - thirty-three [single].jpg",
        "description": "This single is a mish-mash of songs that presumably didn't make it onto <i>Mellon-Collie And The Infinite Sadness</i>. I quite like it; it's labelled a single, but it's more like an EP, just like the rest of their Mellon Collie singles.<br><br>The title track is pretty interesting, and this Single made me appreciate it more after listening to it so many times. I really like The Smashing Pumpkins, and I'm glad they've released a crapload of music—especially from this era. My favourite tracks off this one are colossally brooding 'The Aeroplane Flies High' and 'Transformer', both of which I think are highlights of their discography.",
        "genre": "Alternative Rock",
        "rating" : "70",
        "duration": "25:46",
        "tracks": [
            "Thirty-Three",
            "The Last Song",
            "The Aeroplane Flies High",
            "Transformer",
            "The Bells",
            "My Blue Heaven"
        ],
        "applemusic":"",
        "spotify":""
    },
    {
        "artist": "Johann Strauss II",
        "album": "An Der Schönen, Blauen Donau",
        "year": "1983",
        "cover": "./assets/albumart/johann strauss ii - an der schonen blauen donau.jpg",
        "description": "This is a compilation of waltzes, polkas and marches composed by Johann Strauss II in around the 1860's. They're exciting and they get you going, as a waltzes and excitable classical music should. Need some motivation? Throw on this compilation. Going on a long walk? Listen to this. Performing open heart surgery? Maybe not: this album makes you want to move, and I'd hope a surgeon isn't grooving along to waltzes while they're poking around inside of me.<br><br>My favourite tracks off this one is the titular 'An Der Schönen, Blauen Donau' and 'Künstlerleben', though 'Accelerationen' might take second place depending on the day.",
        "genre": "Viennese Waltz",
        "rating" : "98",
        "duration": "49:53",
        "tracks": [
            "An Der Schönen, Blauen Donau",
            "Eljen A Magyar!",
            "Accelerationen",
            "»Die Fledermaus« Overtüre",
            "Leichtes Blut",
            "Künsterleben",
            "Unter Donner Und Blitz"
        ],
        "applemusic":"https://music.apple.com/us/search?term=an%20der%20schonen%20blauen%20donau",
        "spotify":"https://open.spotify.com/album/4Hq6U8NMSqCCXKIxTtO2uX"
    },
    {
        "artist": "Led Zeppelin",
        "album": "Houses of The Holy",
        "year": "1973",
        "cover": "./assets/albumart/led zeppelin - houses of the holy.jpg",
        "description": "Although <i>Led Zeppelin IV</i> is an awesome, legendary album, <i>Houses of The Holy</i> will always be my favourite of theirs. It takes a more experimental direction, diving into much more spacious, textual compositions rather than pure hard rocking hard rock. They blended different elements into their music such as dance, reggae and funk. Led Zeppelin's earlier albums were pioneering and awesome and so was their later stuff; like a good band should, they never stood still and they were always innovating. This is a sonically diverse album that's a joy to listen to, so listen to it!<br><br>My favourite songs on this one are 'Over The Hills and Far Away', 'Dancing Days' and 'The Song Remains The Same'.",
        "genre": "Hard Rock",
        "rating" : "98",
        "duration": "40:57",
        "tracks": [
            "The Song Remains The Same",
            "The Rain Song",
            "Over The Hills and far Away",
            "The Rain Song",
            "The Crunge",
            "Dancing Days",
            "D'yer Mak'er",
            "No Quarter",
            "The Ocean"
        ],
        "applemusic":"https://music.apple.com/us/album/houses-of-the-holy-remastered/580707916",
        "spotify":"https://open.spotify.com/album/0GqpoHJREPp0iuXK3HzrHk"
    },
    {
        "artist": "Yes",
        "album": "90125",
        "year": "1982",
        "cover": "./assets/albumart/yes - 90125.jpg",
        "description": "A lot of people say that Yes went downhill in the 80s with this album. Due to the perceived decline of traditional rock and the rise of synthesizers, record labels forced Progressive Rock bands to distill their long and rambling compositions into short, radio-friendly tracks. Many fans of these bands swore they'd lever listen to this, and say that all these bands committed treason and crimes against humanity in this switch.<br><br>Progressive Rock became Progressive Pop, and yeah, it's very different, but there's still so much to enjoy. It has awesome guitar work and super catchy hooks; symphonic passages were replaced with solos layered atop bouncing synths to create a spectacular blend of then-contemporary pop and their out-of-this-world progressive origins. Some of these songs were written in conjunction with former Led Zeppelin members Jimmy Page and Robert Plant for a supergroup called 'XYZ' which never came to light. You've got <i>80s Pop</i> music, then you've got <i>Progressive Pop</i>—the latter wins every time.<br><br>Random fun fact: the title of the album is the catalogue ID of the album. My copy is '7 90125-2'<br><br>This is an album I would recommend to anyone. Whether you like Progressive Rock or not, you can really enjoy this one; these guys took their experience in being a pioneering band in one scene, and blazed their own trail in another. My favourite tracks are 'Leave it', 'Owner of a Lonely Heart' and 'It Can Happen'; the whole album is just a back-to-back riot of great music, really.",
        "genre": "Progressive Pop",
        "rating" : "87",
        "duration": "44:34",
        "tracks": [
            "Owner of a Lonely Heart",
            "Hold On",
            "It Can Happen",
            "Changes",
            "Cinema",
            "Leave it",
            "Our Song",
            "City of Love",
            "Hearts"
        ],
        "applemusic":"https://music.apple.com/us/album/90125/1049010572",
        "spotify":""
    },
    {
        "artist": "Billy Joel",
        "album": "52nd Street",
        "year": "1978",
        "cover": "./assets/albumart/billy joel - 52nd street.jpg",
        "description": "This album is a riot! I just don't get how some people don't like Billy Joel; are you people allergic to fun? Do you beat puppies in your free-time? I don't have much to say about this album other than <i>listen to it!</i> Even Trent Reznor of Nine Inch Nails likes this album.<br><br>My favourite tracks off it are 'My Life', 'Half a Mile Away', 'Zanzibar' and 'Big Shot'.",
        "genre": "Pop Rock",
        "rating" : "95",
        "duration": "40:26",
        "tracks": [
            "Big Shot",
            "Honesty",
            "My Life",
            "Zanzibar",
            "Stiletto",
            "Rosalinda's Eyes",
            "Half a Mile Away",
            "Until The Night",
            "52nd Street"
        ],
        "applemusic":"https://music.apple.com/us/album/52nd-street/259573387",
        "spotify":"https://open.spotify.com/album/1HmCO8VK98AU6EXPOjGYyI"
    },
    {
        "artist": "The Clash",
        "album": "The Clash",
        "year": "1977",
        "cover": "./assets/albumart/the clash - the clash.jpg",
        "description": "The first album from UK-based punk rock group The Clash is an absolute riot. I think they're one of the coolest bands to have ever existed, and I have a huge amount of respect for them as musicians. They're passionate about the things they sing about, and they're passionate about music. One of the most punk-rock things you could do is play things other than punk-rock, becuase that's exactly what people <i>don't</i> want you to do.<br><br>This album has back-to-back-to-back hits and bangers, and I'm sure that many people who listen to all sorts of music can appreciate these songs. Not for everyone, but for a wider audience than <i>The Sex Pistols</i>. I was introduced to The Clash through a huge compilation of songs my mother got off iTunes when I was a kid, and as I listened to their albums one by one, I was shocked at how many of those huge hits were not only on this album but playing back-to-back. It's just loaded great music! They were a huge inspiration for Green Day!<br><br>My favourite songs off this one are 'Hammersmith in Palais', 'White Riot', 'Career Opportunities' and 'Remote Control'—but how can you pick favourites on this one? Just listen to all of them!",
        "genre": "Punk Rock",
        "rating" : "95",
        "duration": "43:31",
        "tracks": [
            "Clash City Rockers",
            "I'm So Bored With The U.S.A.",
            "Remote Control",
            "Complete Control",
            "White Riot",
            "Hammersmith In Palais",
            "London's Burning",
            "I Fought The Law",
            "Janie Jones",
            "Career Opportunities",
            "What's My Name",
            "Hate And War",
            "Police And Thieves",
            "Jail Guitar Doors",
            "Garageland"
        ],
        "applemusic":"https://music.apple.com/us/album/the-clash-2013-remastered/684737755",
        "spotify":"https://open.spotify.com/album/49kzgMsxHU5CTeb2XmFHjo"
    },
    {
        "artist": "Wolfmother",
        "album": "Wolfmother",
        "year": "2005",
        "cover": "./assets/albumart/wolfmother - wolfmother.jpg",
        "description": "2005 was a good year: It gave us the greatest baseball videogame of all time, Fernando Alonso won his first world championship, I discovered Zoo Tycoon 2, and Wolfmother released their debut album.<br><br>Wolfmother made a big impact with their eponymous first album. This Australian hard rock group fronted by Andrew Stockdale takes heavy inspiration from bands like Led Zeppelin and Black Sabbath; this album feels old, but in a good way. It's loud, it's exciting, and the music is fun to listen to while not being too heavy. This is a collection of songs that's easy to listen to and fun for anyone who likes fun (and rock n' roll).<br><br>I listened to this one a lot in the summer of 2016, and becuase of that, I think of it as a 'summer' album. After that, I didn't think about it again until 2024 when I picked up a copy, and I was shocked at how good it was as a whole. My favourite tracks off this one are 'Tales', 'Joker & The Thief' and 'White Unicorn'. I think 'Tales' is the best one off the album; it's a really good song.<br>Just listen to the first track and you'll feel it. If you don't listen to 'Tales', and you'll feel it. If not, at least you tried!",
        "genre": "Hard Rock",
        "rating" : "70",
        "duration": "54:33",
        "tracks": [
            "Dimension",
            "White Unicorn",
            "Woman",
            "Where Eagles Have Been",
            "Apple Tree",
            "Joker & the Thief",
            "Colossal",
            "Mind's Eye",
            "Pyramid",
            "Witchcraft",
            "Tales",
            "Love Train",
            "Vagabond"
        ],
        "applemusic":"https://music.apple.com/us/album/joker-and-the-thief/1440749482?i=1440749497",
        "spotify":""
    },
    {
        "artist": "Whitesnake",
        "album": "Whitesnake",
        "year": "1987",
        "cover": "./assets/albumart/whitesnake - whitesnake.jpg",
        "description": "Almost ten years after David Coverdale left Deep Purple IV and formed Whitesnake, he was going to hang up the towel and move on to another project. Instead, he revamped the band and released the eponymous <i>Whitesnake</i>, and I'm glad he did. So is my Dad; he really liked this album and \"played it until the tape wore out\".<br><br>This is an electrifying record. When I think of heavy metal in the 1980's, I think of albums like this one. It's loud, dramatic, jam-packed with anthems, and so much fun to listen to; it starts up and sends you on your way, yet it's paced well (as many mainstream 80s albums were) and its easy to listen to. The sound gives off the air of being more mysterious and sophisticated than a band like Mötley Crüe, but you still want to rock out to it just as hard. <br><br>My favourite tracks on this one are 'Crying In The Rain', 'Here I Go Again' and 'Is This Love'.",
        "genre": "Glam Metal",
        "rating" : "75",
        "duration": "42:33",
        "tracks": [
            "Crying in the Rain",
            "Bad Boys",
            "Still of the Night",
            "Here I Go Again",
            "Give Me All Your Love",
            "Is This Love",
            "Children of the Night",
            "Straight for the Heart",
            "Don't Turn Away"
        ],
        "applemusic":"https://music.apple.com/us/album/whitesnake-bonus-track-version/1440611245",
        "spotify":"https://open.spotify.com/album/5drgoLSnXSDIhNK4ms3P7I"
    },
    {
        "artist": "The Clash",
        "album": "London Calling",
        "year": "1979",
        "cover": "./assets/albumart/the clash - london calling.jpg",
        "description": "This album has a colossal shadow; no longer the new angsty young men on the block, The Clash absorbed influences left and right, refined their sound, and released one of the great double-albums of history. While their previous album <i>Give 'Em Enough Rope</i> marked a subtle shift from their original sound, this one was a huge departure. This is the album that really made me respect The Clash and its members for their songwriting ability, their ability to grow as artists, and their ability as music listeners to appreciate so many different kinds of music.<br><br>When I was a young lad, I was a <i>Warning</i> hater—\"how could Green Day do this!?\"; \"It's just not Green Day!\". I was equally confused when I first heard some of the songs on <i>London Calling</i>, but after a couple of tracks, I started to understand that this was still The Clash that I knew and loved, but different. Their signature style and charm was stil there packed in with influences different to the ones which made me love them originally. This album is what cured me of being a <i>Warning</i> hater and opened my mind to many more kinds of music—especially music from bands that changed over time. Green Day was just following in the footsteps of one of the greatest, most diverse bands in history when they began to grow from their 924 Gilman St origins.<br><br>Whether you like punk rock or not, you'll like this album: it's got something for everybody. My favourite songs off it are 'The Card Cheat', 'The Guns of Brixton', 'Spanish Bombs', 'Rudie Can't Fail' and the titular 'London Calling'.",
        "genre": "Punk Rock",
        "rating" : "97",
        "duration": "65:07",
        "tracks": [
            "London Calling",
            "Brand New Cadillac",
            "Jimmy Jazz",
            "Hateful",
            "Rudie Can't Fail",
            "Spanish Bombs",
            "The Right Profile",
            "Lost In The Supermarket",
            "Clampdown",
            "The Guns Of Brixton",
            "Wrong 'Em Boyo",
            "Death Or Glory",
            "Koka Kola",
            "The Card Cheat",
            "Lover's Rock",
            "Four Horsemen",
            "I'm Not Down",
            "Revolution Rock",
            "Train In Vain (Stand By Me)"
        ],
        "applemusic":"https://music.apple.com/us/album/london-calling/684811762",
        "spotify":"https://open.spotify.com/album/6FCzvataOZh68j8OKzOt9a"
    },
    {
        "artist": "Supertramp",
        "album": "Breakfast In America",
        "year": "1979",
        "cover": "./assets/albumart/supertramp - breakfast in america.jpg",
        "description": "A couple of years ago, I was sifting through vinyl records in my ex-girlfriend's mother's basement when I came across this one. I'd seen it around and I wanted to listen to it. This was finally my chance to give it a listen...except it was just an empty record sleeve. I kept looking out for it at thrift stores, and when I finally found a copy of it on CD, I bought it, listened to it, and enjoyed the crap out of it.<br><br>After their previous album, <i>Even in the Quietest Moments</i>, Supertramp has completed their transition from Art/Progressive Rock to streamlined, neatly packaged and brutally efficient sound that is <i>Breakfast In America</i>. From the album cover to the final track, this album is made to suck you in and have you enjoy it; these songs are catchy, bouncy and generally upbeat tunes. Heck, even the ones with sadder lyrics sound happy! It's just a great album that I'd recommend to anyone: if you like Progressive Rock's grand compositions, attention to detail and sonic diversity, you'll enjoy this; if you enjoy pop music, you'll enjoy this—it was once part of the unintelligible blob that was contemporary pop. Give this one a chance!<br><br>My favourite tracks on this album are 'Gone Hollywood', 'Gone Hollywood' and 'Casual Conversations'. The instrumental intro to 'Child of Vision' oftentimes plays idly in my head. They're all great songs, really.",
        "genre": "Progressive Pop",
        "rating" : "97",
        "duration": "46:01",
        "tracks": [
            "Gone Hollywood",
            "The Logical Song",
            "Goodbye Stranger",
            "Breakfast in America",
            "Oh Darling",
            "Take the Long Way Home",
            "Lord Is It Mine",
            "Just Another Nervous Wreck",
            "Casual Conversations",
            "Child of Vision"
        ],
        "applemusic":"https://music.apple.com/us/album/breakfast-in-america-remastered/1440512054",
        "spotify":"https://open.spotify.com/album/7i75GRwJbhDDiLi2uQHTtZ"
    },
    {
        "artist": "Sergei Rachmaninoff",
        "album": "Rhapsody on a Theme of Paganini",
        "year": "1933",
        "cover": "./assets/albumart/rachmaninoff - rhapsody on a theme of paganini.jpg",
        "description": "There are two kinds of beauty in the world: that which can and cannot be quantified and understood. In our every day lives, we experience and see things that are beautiful. It's human nature to try and quantify everything we see because we're so obsessed with statistics—we've always been like that, and we always will be.<br><br>If you look at a sweet rose, you can understand it's beautiful inside and out. It's nice to be around and brings pleasure to the eye; it can be quantified, understood and described, though it shouldn't have to be. In classical music, I would equate this to the second movement of Richard Strauss' <i>Also Sprach Zarathustra</i>, 'Von den Hinterweltlern'.<br><br>Then, you have the beauty which cannot be understood. I try to watch the sunset every day, and I don't try to understand why it's beautiful or put it into words. What's the point of trying to understand something so powerful when you could just take it in and enjoy it instead? I feel the same way about the eighteenth variation of <i>Rhapsody on a Theme of Paganini</i>. In this composition, Rachmaninoff makes me feel things that no other piece of music or thing makes me feel—nothing but the sight of a sunset. I don't understand how a mortal man created this beauty, but he did. It's powerful and I won't bother trying to put it into words or trying to understand it. I first heard it in 2013 when Lang Lang's recording of it was used as the intro to <i>Gran Turismo 6</i>, and I've loved it since.<br><br>As a whole, <i>Rhapsody on a Theme of Paganini</i> is a rollercoaster ride, and I love it. It's very short and a joy to listen to, but it's something I don't listen to often becuase of the power that eighteenth variation holds. When it comes on, it's like being hit really hard by something invisible: I stop what I'm doing and just take it in. Oftentimes, my eyes get sweaty. I can't explain it: it just is, and it is truly wonderful.",
        "genre": "Concertante ",
        "rating" : "99",
        "duration": "23:31",
        "tracks": [
            "Introduction: Allegro Vivace",
            "Var 1: (Precedente)",
            "Theme: L'istesso tempo",
            "Var 2: L'istesso tempo",
            "Var 3: L'istesso tempo",
            "Var 4: Più vivo",
            "Var 5: Tempo Precedente",
            "Var 6: L'istesso tempo",
            "Var 7: Meno mosso, a tempo moderato",
            "Var 8: Tempo I",
            "Var 9: L'istesso tempo",
            "Var 10: L'istesso tempo",
            "Var 11: Moderato",
            "Var 12: Tempo di minuetto",
            "Var 13: Allegro",
            "Var 14: L'istesso tempo",
            "Var 15: Più vivo scherzando",
            "Var 16: Allegretto",
            "Var 17: Allegretto",
            "Var 18: Andante cantabile",
            "Var 19: A tempo vivace",
            "Var 20: Un poco più vivo",
            "Var 21: Un poco più vivo",
            "Var 22: Marziale. Un poco più vivo",
            "Var 23: Listesso tempo"
        ],
        "applemusic":"",
        "spotify":""
    },
    {
        "artist": "Richard Strauss",
        "album": "Also Sprach Zarathustra",
        "year": "1974",
        "cover": "./assets/albumart/richard strauss - also sprach zarathustra.jpg",
        "description": "The first track on this tone poem based off chapters of Nietzsche's book of the same name is probably best known for being the introduction to Stanley Kubrick's legendary film, <i>2001: A Space Odyssey</i>. One day, while paying particular attention to the credits at the end of that movie, I realized 'Einleitung' was composed by Richard Strauss, so I decided to give the whole work a go. What an epic thing this is! You come for the <i>Space Odyssey</i> and stay for the Strauss. This is one I just love to listen to while I'm walking around or getting work done; like all classical music, it moves you, makes you feel things, and serves as a soundtrack of wonder and awe to life and thought.<br><br>If you sit for these thirty-five minutes and just feel it, though, it'll be something really special. That's what classical music is meant to be. If you ever get a chance to see it live, take it! I saw it two nights in a row when my local orchestra was playing it, and it changed something in me.<br><br>This is my favourite recording of one of my all-time favourite classical compositions. Deutsche Grammophon is to classical music what Penguin Classics are to literature: they're high quality and they never disappoint.<br><br>My favourite track off this one is the second: 'Von den Hinterweltlern'; I think it's got a special kind of beauty to it.",
        "genre": "Classical Romanticism",
        "rating" : "100",
        "duration": "35:09",
        "tracks": [
            "Einleitung",
            "Von den Hinterweltlern",
            "Von der großen Sehnsucht",
            "Von den Freuden und Leidenschaften",
            "Das Grablied",
            "Von der Wissenschaft",
            "Der Genesende",
            "Das Tanzlied",
            "Nachtwandlerlied"
        ],
        "applemusic":"https://music.apple.com/us/album/also-sprach-zarathustra-op-30-prelude-sonnenaufgang/1452164755?i=1452165089",
        "spotify":"https://open.spotify.com/album/1kHbPoLRmiAHIDgYRraYU9"
    },
    {
        "artist": "Antonín Dvorak",
        "album": "Symphony No 9: »Aus der Neuen Welt«",
        "year": "1985",
        "cover": "./assets/albumart/antonin dvorak - symphonie no 9.jpg",
        "description": "This is a proper symphony: everything you could want when searching for excitable music that will transport you to a world far away full of peril and wonder. It's great music for reading, or walking if you want your walk to feel dramatic and extra special. It's just good music. There's no point in trying to understand it or put it into words; the best you can do is to just listen to it and understand.<br><br>This is my favourite recording of it. I was introduced to this symphony through The Royal Philharmonic Orchestra's recording from 1994, but there's something special about Herbert von Karajan which me like this one better. It sounds fuller and has more life to it somehow. I can't say that it's becuase the former was digitally recorded, becuase this one was too—there's something intangible about it.",
        "genre": "Classical Romanticism",
        "rating" : "95",
        "duration": "42:33",
        "tracks": [
            "Adagio, Allegro Molto",
            "Largo",
            "Molto Vivace",
            "Allegro Con Fuoco"
        ],
        "applemusic":"https://music.apple.com/us/album/dvo%C5%99%C3%A1k-symphony-no-9-from-the-new-world-smetana-the-moldau/1440758789",
        "spotify":"https://open.spotify.com/album/6FMu88LoghMcmme2aDkK3S"
    },
    {
        "artist": "Panic At The Disco",
        "album": "Pray For The Wicked",
        "year": "2018",
        "cover": "https://upload.wikimedia.org/wikipedia/en/4/4c/Pray_for_the_Wicked.png",
        "description": "One of the worst albums I've ever had the displeasure of not only listening to, but also owning a physical copy of. Some of the songs are mildly catchy at first—they're written to be so—but they just get irritating. I don't feel this way about a lot of music; usually, I can find something to enjoy and appreciate in everything. There's just something about this album that cannot be enjoyed.<br><br>At first, this magic box was going to be album recommendations, but with the addition of this album, it's just commentary on all the albums I've ever owned.<br><br>If you like this album, good on you. I just can't get through the whole thing. People rag on Jared Leto, but the guy is actually half talented; he can write enjoyable songs and good music. Brendon Urie? He's always been insufferable, and the less of the band is in the band (this was a solo album, essentially), the more insufferable he becomes. It's one of the few albums I've purged from my collection; thankfully, I sold it!<br><br>I'm glad Brendon Urie said 'Amen' and disbanded this putrid act; dancing's not a crime, but this album should be one: it's got me standing on the overpass, dying in LA becuase my ears were assulted by it. ",
        "genre": "Poop",
        "rating" : "5",
        "duration": "34:17",
        "tracks": [
            "(Fuck A) Silver Lining",
            "Say Amen (Saturday Night)",
            "Hey Look Ma, I Made It",
            "High Hopes",
            "Roaring 20s",
            "Dancing's Not a Crime",
            "One of the Drunks",
            "The Overpass",
            "King of the Clouds",
            "Old Fashioned",
            "Dying in LA"
        ],
        "applemusic":"",
        "spotify":""
    },
    {
        "artist": "The Rembrandts",
        "album": "L.P.",
        "year": "1995",
        "cover": "./assets/albumart/the rembrandts - lp.jpg",
        "description": "I picked this album off the shelf at the thrift store becuase of the font on the spine, and I bought it because it had the theme from <i>Friends</i>. I wasn't a huge fan at first, but I warmed up to it after the second listen and found there's a lot to enjoy.<br><br>Overall, the pacing is a bit wonky and the album feels lopsided, but it's a relatively harmless and inoffensive collection of music. It's the kind of stuff I'd imagine you'd find playing at a coffee shop, in some 2000's young-adult sitcom or in a 90s movie. Came for the Friends theme, stayed for The Rembrandts.<br><br>Honestly, if you like <i>Crowded House/Crowded House</i>, I don't see why you wouldn't like this album! I bet they influenced The Rembrandts.<br><br>My favourite tracks off this one are 'Don't Hide Your Love', 'Easy to Forget' and 'There Goes Lucy'. I think this album version of the Friends theme is <i>way</i> better than the one they used in the TV show, and way better than the one on the <i>Friends</i> soundtrack.",
        "genre": "Soft Rock",
        "rating" : "70",
        "duration": "62:15",
        "tracks": [
            "End of the Beginning",
            "Easy to Forget",
            "My Own Way",
            "Don't Hide Your Love",
            "Drowning In Your Tears",
            "This House Is Not A Home",
            "April 29",
            "Lovin' Me Insane",
            "There Goes Lucy",
            "As Long as I Am Breathing",
            "Call Me",
            "Comin' Home",
            "What Will It Take",
            "The Other Side of The Night",
            "I'll Be There For You"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Creed",
        "album": "Human Clay",
        "year": "1999",
        "cover": "./assets/albumart/creed - human clay.jpg",
        "description": "This was one of the first albums I got in the early days of CD collecting; I was out at a thrift store with my Dad and he recommended it to me. Now, here I am recommending it to you, mysterious reader.<br><br>Human Clay is Creed's second effort, and what a great album it is! They came off the blocks firing, but on this album they really stepped up the production and the songwriting to make it feel very well rounded and complete. If you're looking for some late 1990's or early 2000s sounding Post-Grunge, this is it. I know Creed is divisive on the internet, but come on, they stand on their own as an awesome band and they deserve all the success they had. Scott Stapp has proven himself time and time again as more than just an 'Eddie Vedder ripoff' or whatever the internet people have been calling him for the past twenty or so years.<br><br>In the summer of 2022, I had a dream that I found a cassette single of 'Say I' and after listening to it, I was super into the album again all summer. I listened to it every day in the waking world after hearing it in that dream for around two months.<br><br>My favourite tracks off this one are 'Say I', 'Faceless Man' and 'Are You Ready?'",
        "genre": "Post-Grunge",
        "rating" : "83",
        "duration": "56:28",
        "tracks": [
            "Are You Ready?",
            "What If",
            "Beautiful",
            "Say I",
            "Wrong Way",
            "Faceless Man",
            "Never Die",
            "With Arms Wide Open",
            "Higher",
            "Wash Away These Years",
            "Inside Us All"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Creed",
        "album": "My Own Prison",
        "year": "1997",
        "cover": "./assets/albumart/creed - my own prison.jpg",
        "description": "Critics and internet people have been crapping on poor old Creed since they were fresh off the assembly line. Why are the internet people suddenly worshipping it as one of the greatest, most iconic bands of their era? I don't know man, these internet people work in weird and mysterious ways—I guess I'm one of them, aren't I? Well, this internet person has always liked Creed. I stood by them when it was very, very uncool, and so did my Dad.<br><br>This is a really solid Post-Grunge record—what else is there to say? It's grand, uses lots of cool symbolism and rocks hard. These guys worked really hard to make a good product and get their first album out, and they made it big. They deserve all the success and none of the hate. <br><br>My favourite tracks off this one are 'Torn', 'Whats This Life For', 'My Own Prison' and 'Unforgiven'.",
        "genre": "Post-Grunge",
        "rating" : "79",
        "duration": "49:07",
        "tracks": [
            "Are You Ready?",
            "What If",
            "Beautiful",
            "Say I",
            "Wrong Way",
            "Faceless Man",
            "Never Die",
            "With Arms Wide Open",
            "Higher",
            "Wash Away These Years",
            "Inside Us All"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Mötley Crüe",
        "album": "Dr. Feelgood",
        "year": "1989",
        "cover": "./assets/albumart/motley crue - dr feelgood.jpg",
        "description": "The 1980s were full of high highs (literally) and extreme lows for Mötley Crüe, and the barely made it out of the decade together—<i>Dr. Feelgood</i> almost didn't happen.<br><br>This is Mötley Crüe at their finest. They had their meteoric rise, became the most controversial band in the history of rock n' roll, and they survived everything that was thrown at them (and everything they got into). <i>Dr. Feelgood</i> is not the output of the raw, fast and loud Mötley Crüe which entered the music scene at the beginning of the 1980's, it's got polish. This album is still brutal, loud and fast—it's undeniably Motley—but it flows in a way none of their other albums do. It sounds like an experienced band at the top of their game. It's an album that just makes you feel good when you listen to it. I've got nothing bad to say about this album, and I'm glad it happened. <br><br>Mötley Crüe after <i>Dr. Feelgood</i> is different. It's not bad, just different—and that's okay: nothing stays the same, and it was time for change. <br><br>My favourite songs off this one are ‘Same ‘Ol Situation', ‘Kickstart My Heart' and the titular ‘Dr. Feelgood'.",
        "genre": "Glam Metal",
        "rating" : "88",
        "duration": "45:07",
        "tracks": [
            "T.n.T. (Terror 'n Tinseltown)",
            "Dr. Feelgood",
            "Slice of Your Pie",
            "Rattlesnake Shake",
            "Kickstart My Heart",
            "Without You",
            "Samel Ol' Situation (S.O.S.)",
            "Sticky Sweet",
            "She Goes Down",
            "Don't Go Away Mad (Just Go Away)",
            "Time For Change"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Poison",
        "album": "Flesh And Blood",
        "year": "1990",
        "cover": "./assets/albumart/poison - flesh & blood.jpg",
        "description": "You could say that this album was part of the beginning of the end for my time on streaming services. Out of all the records put out by the Pennsylvania Glam Metal group, this one is my favourite, and it's not on any streaming service in Canada. It was the last straw in the hay bale of odd and frustrating omission from the Spotify and Apple Music catalogue which pushed me more towards proper ownership.<br><br>That was all the way back in 2020; I'd only been collecting CD's for around two years at that point, and my collection was still very small; I didn't get a copy of this one till 2022, but the wait was worth it. Until then, I enjoyed ‘Valley of Lost Souls' as a cassingle.<br><br>This album is hard-rocking, but it's made for radio play: it's the promiscuous, edgy heavy metal of the 1980s with the right hooks needed to get you on MTV. I suppose that if you look at it that way, it's a bit more watered down than something like Mötley Crüe—Glam Metal straight from the tap—but it's still awesome. It's good music for the sake of good music: Bret Michaels doesn't even know what the hell an ‘Unskinny Bop' is, and he wrote the song!<br><br>My favourite tracks off this one are the aforementioned ‘Valley Of Lost Souls', ‘Flesh And Blood' and ‘Life Goes On'.",
        "genre": "Glam Metal",
        "rating" : "70",
        "duration": "57:38",
        "tracks": [
            "Strange Days of Uncle Jack",
            "Valley of Lost Souls",
            "(Flesh & Blood) Sacrifice",
            "Swampjuice (Soul-O)",
            "Unskinny Bop",
            "Let It Play",
            "Life Goes On",
            "Come Hell or High Water",
            "Ride the Wind",
            "Don't Give Up an Inch",
            "Something to Believe In",
            "Ball and Chain",
            "Life Loves a Tragedy",
            "Poor Boy Blues"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Green River",
        "album": "Dry As A Bone/Rehab Doll",
        "year": "1990",
        "cover": "./assets/albumart/green river - dry as a bone.jpg",
        "description": "Much like Green Day's <i>1039/Smoothed Out Slappy Hours</i>, this is a compilation of Green River's EP, Singles, Album and unreleased music. These guys are pioneers of the Grunge genre: when Green River split up, they went off to starts bands like Mother Love Bone and Mudhoney. It was produced by none other than Jack Endino, and was released on the Sub Pop label.<br><br>It's fast, messy, raunchy, and great fun to listen to; Green River is a mix of hard rock and hardcore punk, leading to a raw sound a lot like that of singer Mark Arm's next band, Mudhoney.<br><br>My favourite tracks off this one are 'Unwind', 'Queen Bitch', 'Swallow My Pride' and ''.",
        "genre": "Grunge",
        "rating" : "75",
        "duration": "57:38",
        "tracks": [
            "This Town",
            "P.C.C.",
            "Ozzie",
            "Unwind",
            "Baby Takes",
            "Searchin'",
            "Ain't Nothing to Do",
            "Queen Bitch",
            "Forever Means",
            "Rehab Doll",
            "Swallow My Pride",
            "Together We'll Never",
            "Smilin' and Dyin'",
            "Porkfist",
            "Take a Dive",
            "One More Stitch"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Audioslave",
        "album": "Audioslave",
        "year": "2002",
        "cover": "./assets/albumart/audioslave - audioslave.jpg",
        "description": "The supergroup featuring Rage Against The Machine's remaining members and Soundgarden singer Chris Cornell was received with mixed reviews from critics; this once again proved people who write music reviews are miserable, fun-hating puppy-kickers. With the introduction out of the way, I would like to write a mini music review of this album for my website (I don't kick puppies, and I like this album!).<br><br>The blend of Tom Morello's unique riffs and Chris Cornells spectacular voice led to something truly spectacular. I can see why some people might have said that it wasn't as good as it could've been—the group needed a little of time to refine their product. This album still shouldn't be dismissed, though. It's good music. It's Chris Cornell, for god's sake! Do most Soundgarden songs sound like they're about anything, or is he just singing weird words <i>really</i> well?<br><br>The album cover struck me when I first saw it; did you know it was designed by Storm Thorgerson, the Hipgnosis guy who designed all those prog rock album covers?<br><br>My favourite tracks off this album are 'Cochise', 'Show Me How To Live', 'I Am The Highway', 'What You Are' and 'Getaway Car'.",
        "genre": "Hard Rock",
        "rating" : "80",
        "duration": "65:26",
        "tracks": [
            "Cochise",
            "Show Me How to Live",
            "Gasoline",
            "What You Are",
            "Like a Stone",
            "Set It Off",
            "Shadow on the Sun",
            "I Am The Highway",
            "Exploder",
            "Hypnotize",
            "Bring Em Back Alive",
            "Light My Way",
            "Getaway Car",
            "Last Remaining Light"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Gustav Holst",
        "album": "The Planets",
        "year": "1981",
        "cover": "./assets/albumart/gustav holst - the planets.jpg",
        "description": "Just as each piece on Richard Strauss' <i>Also Sprach Zarathustra</i> is based on a chapter of Nietzsche's book of the same name, each piece on this masterpiece by Gustav Holst is named after a planet of our solar system. Each piece heavily contrasts the other and evokes drastically different emotions; the personality of each roman god has been embodied in these songs. Jupiter or Mars is my favourite, though Saturn is great too. Holst began to work on the planets in 1914 and finished it in 1917, making it a relatively recent composition.<br><br>I was introduced to this work from my dad's set of recordings from The Royal Philharmonic, but I prefer this one here conducted by Herbert Von Karajan and performed by Berliner Philharmoniker",
        "genre": "Orchestral Suite",
        "rating" : "93",
        "duration": "51:56",
        "tracks": [
            "Mars, The Bringer Of War",
            "Venus, The Bringer Of Peace",
            "Mercury, The Winged Messenger",
            "Jupiter, The Bringer Of Jollity",
            "Saturn, The Bringer Of Old Age",
            "Uranus, The Magician",
            "Neptune, The Mystic"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Richard Strauss",
        "album": "Eine Alpensinfonie",
        "year": "1981",
        "cover": "./assets/albumart/richard strauss - eine alpensinfonie.jpg",
        "description": "Another spectacular tone poem from Richard Strauss. Eine Alpensinfonie consists of twenty-two musical sections, elaborated thematically as a single sonata-movement. Its an observation of the Bavarian Alps; their beauty, and their peril. If you close your eyes, you can imagine what Strauss saw when he lived there in the early 1900s.<br><br>Despite this being such an exciting composition, it was composed in three months between projects while Strauss was waiting on a collaborator to compose an opera. He said 'it gives me less pleasure than shaking maybugs off trees'.<br><br>Fun fact about this release right here: it was the very first test-pressing used during the development of the compact disc at Polydor. Deutsche Grammophon was instrumental (ha!) in the development of this wonderful technology and assisted the teams at both Phillips and Sony wherever they could.",
        "genre": "Tone Poem",
        "rating" : "88",
        "duration": "50:49",
        "tracks": [
            "Nacht",
            "Der Anstieg",
            "Eintritt in den Wald",
            "Wanderung neben dem Bache",
            "Auf blumige Wiesen",
            "Gefahrvolle Augenblicke",
            "Nebel steigen auf",
            "Stille vor dem Sturm",
            "Gewitter und Sturm",
            "Sonnenuntergang",
            "Ausklang"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Pink Floyd",
        "album": "The Division Bell",
        "year": "1994",
        "cover": "./assets/albumart/pink floyd - the division bell.jpg",
        "description": "The final Pink Floyd album. I wish it could've continued after this, but all good things must come to an end, as they said on <i>Star Trek: The Next Generation</i><br><br>Pink Floyd is a really special thing, and its a terrible thing they were torn apart by greed and petty arguments. Most of their music before the split revolved around dealing with the loss of Syd Barrett. You can feel that on this album, but there's also the conflict between Gilmour and Waters. It was the dawn of the internet age and Gilmour could feel the tides changing, though nobody could've predicted how bad it would get.<br><br>This album, like all material when a band loses a member, will feel different. That's not a reason to hate it; it's undeniably Pink Floyd, and there's so much to enjoy here. I've only just begun to understand how good an album this is. I'm glad that Pink Floyd continued for as long as they did and they put out as many albums as they did. It's rare that you get a band like <i>Green Day</i> who seems like they'll never stop.<br><br>My favourite tracks off this one are 'What Do You Want From Me', 'Poles Apart', 'Marooned' and 'High Hopes'.",
        "genre": "Progressive Rock",
        "rating" : "90",
        "duration": "66:31",
        "tracks": [
            "Cluster One",
            "What Do You Want From Me",
            "Poles Apart",
            "Marooned",
            "A Great Day for Freedom",
            "Wearing the Inside Out",
            "Take It Back",
            "Coming Back to Life",
            "Keep Talking",
            "Lost for Words",
            "High Hopes"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Led Zeppelin",
        "album": "In Through The Out Door",
        "year": "1979",
        "cover": "./assets/albumart/led zeppelin - in through the out door.jpg",
        "description": "When I first heard this album, I was very confused: it's the kind of album which has to be revisited after a break if you didn't like it the first time around. The second or third time you listen to it, you'll realize that this is indeed a Led Zeppelin album, and it's really good.<br><br>One of the most important things the latter Led Zeppelin albums taught me is that they were a band who never stood still. There was a great evolution from <i>Led Zeppelin</i> to <i>Led Zeppelin III</i>, and this wasn't them 'finding thier sound', they were just growing and evolving. They didn't stop after they found something which really resonated with people—there's a reason why <i>Houses of The Holy</i> sounds so different from <i>Led Zeppelin IV</i>. These guys were diverse musicians who could appreciate all forms of music and grow their own sound through it. It's a shame that this was the last Led Zeppelin album, though the group was already internally fractured at the time due to addiction. Page and Plant went on to have a huge influence on other artists throughout the 1980s and 1990s on the production side.<br><br>I don't kick puppies and I don't hate fun, so I gave this album another chance. If you didn't like it, you should too. My favourite tracks off this one are 'In The Evening', 'South Bound Saurez', 'Carouselambra' and 'All My Love'.",
        "genre": "Hard Rock",
        "rating" : "83",
        "duration": "42:35",
        "tracks": [
            "In the Evening",
            "South Bound Saurez",
            "Fool in the Rain",
            "Hot Dog",
            "Carouselambra",
            "All My Love",
            "I'm Gonna Crawl"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "R.E.M.",
        "album": "Automatic For The People",
        "year": "1992",
        "cover": "./assets/albumart/rem - automatic for the people.jpg",
        "description": "I just love the sound of this album, and you probably will too; I'd say it's R.E.M.'s most accessible sound out of all their albums. <i>Automatic For The People</i> is smack dab in their poppiest, most popular phase, and that's not a bad thing at all. This album is a masterwork that you might not expect from the same band that put out an album like <i>Life's Rich Pageant</i> or that song about Orange Crush (eugh!)<br><br>This was the first R.E.M. album I listened to, and I loved it from the get-go despite me being pretty early on in my journey of musical discovery. Back then, I was focused on loud and fast things. My Dad bought me this album, and it just clicked the first time I listened to it. It shows that this group are a bunch of real musicians who can put out a wide variety of music and do an extraordinary job of it.<br><br>This album is a bit slow, and it's sombre and sometimes eerie (for the lack of a better word) in the way that R.E.M. is sometimes. It's got a wide open sound, focusing on stripped down instrumentals compared to it's jangly pop predecessors with an emphasis on vocals. Imagine yourself beside a body of undisturbed, glass-like water on a grey-skied melancholy day the most serene and beautiful drip of water you've ever seen falls into the water and ripples outward: that's the first few notes on this album. I don't know where that imagery came from; it was just in my head one day while listening to this with headphones.<br><br>It's said that Kurt Cobain liked this album so much, he wanted Nirvana to go in its direction. Wouldn't that have been a wonderful thing? I think Kurt had a lot of room and potential to grow as a musician; he had an interest in folk music and an impressive vocal range. It's just another crazy <i>what if?</i><br><br>It's a beautiful album and you've just got to listen to it. If you're got Apple Music, listen to the Dolby Atmos mix and let yourself soak into it. My favourite tracks off this one are ‘Drive', ‘Star Me Kitten', ‘Man on the Moon', ‘Nightswimming' and ‘Ignoreland', but I could list off the whole album.",
        "genre": "Alternative Rock",
        "rating" : "95",
        "duration": "48:25",
        "tracks": [
            "Drive",
            "Try Not To Breathe,",
            "The Sidewinder Sleeps Tonite",
            "Everybody Hurts",
            "New Orleans Instrumental No. 1",
            "Sweetness Follows",
            "Monty Got a Raw Deal",
            "Ignoreland",
            "Star Me Kitten",
            "Man on the Moon",
            "Nightswimming",
            "Find the River"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Counting Crows",
        "album": "August And Everything After",
        "year": "1993",
        "cover": "./assets/albumart/counting crows - august and everything after.jpg",
        "description": "There are very few albums I would put in the same category as R.E.M.'s <i>Automatic For The People</i>, and this is one of them. It's got a very open, airy feeling to it and its lyrics are steeped in a kind of dull sadness; the lyrics speak of life not being quite what you expected, life growing stale, and just generally being disappointed. Still, it's somehow got a hopeful and upbeat ending to it; I'm not quite sure how to describe the way this feels, but I like it. It's a sombre but artful album.<br><br>Can you believe Counting Crows came onto the scene fully grown like this? They just showed up with this extraordinarily polished and exceptional sounding album. I'll admit, I've got a degree of fondness for the album: it's another one that my Dad introduced to me a long time ago. Still, I didn't really appreciate this album until around seven years ago despite it being with me for much longer. It just sounds better and better the older I get.<br><br>If you like clean guitars and a sad sack artfully singing semi-sad songs, you might like this album. It's got some really catchy, upbeat tunes on it too. My favourite tracks off this one are ‘Time And Time Again', ‘Raining In Baltimore', ‘A Murder Of One' and ‘Perfect Blue Buildings'.",
        "genre": "Folk Rock",
        "rating" : "80",
        "duration": "51:37",
        "tracks": [
            "Round Here",
            "Omaha",
            "Mr. Jones",
            "Perfect Blue Buildings",
            "Anna Begins",
            "Time and Time Again",
            "Rain King",
            "Sullivan Street",
            "Ghost Train",
            "Raining in Baltimore",
            "A Murder of One"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Pink Floyd",
        "album": "Atom Heart Mother",
        "year": "1970",
        "cover": "./assets/albumart/pink floyd - atom heart mother.jpg",
        "description": "Look, a cow! <i>Moo!</i><br><br>After coming off the back of two movie soundtracks and a lineup change after the departure of Syd Barrett, Pink Floyd came out with <i>Atom Heart Mother</i>, part of what many might consider a transition era for the band. They were going from their rather inaccessible but very psychedelic roots to the sound which gave us 'The Dark Side of The Moon', 'Wish You Were Here', 'Animals' and 'The Wall'. The titular track of this album is a twenty-three minute long instrumental epic broken down into six sections. It's followed be three more convention five minute tracks, then another thirteen minute song with music between recordings of a guy getting his breakfast.<br><br>It sounds weird because it is, but it's a really good album. I think it's one of Pink Floyd's best, and certainly the best from this era of the band. The title track is <i>a lot</i> of fun, and it reminds me of some of classical works such as 'An American In Paris' or 'Eine Alpensinfonie' which invoke cinematic mental imagery. <br><br>Random thoguht: do you think the opening shots of <i>Kingdom of The Spiders (1977)</i> is inspired by this album cover? I like to think it is. <br><br>My favourite track on this one is undoubtedly 'Fat Old Sun', which is one of my favourite Pink Floyd songs overall. Get a <i>moo</i>ve on and listen to this album!",
        "genre": "Progressive Rock",
        "rating" : "80",
        "duration": "52:06",
        "tracks": [
            "Atom Heart Mother",
            "If",
            "Summer '68",
            "Fat Old Sun",
            "Alan's Psychedelic Breakfast"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Nine Inch Nails",
        "album": "With Teeth",
        "year": "2005",
        "cover": "./assets/albumart/nine inch nails - with teeth.jpg",
        "description": "While <i>Broken</i> is my favourite Nine Inch Nails release, <i>With Teeth</i> is my favourite album from the group. It reflects a new chapter of Trent Reznor's life: the album has a cleaner, more sober sound; while still angry and disillusioned, its not as despairing as previous albums and ends with a tone of absolution. This album is structured marvelously in a way the other albums weren't, and overall, I think it reflects Reznor's enormous growth both personally and as a musician.<br><br>Barring the first track, the album is neatly packaged into triplets which all share a common theme, and progressively become less angry. It starts with charging tracks riling against authority and the outside world, transitions to a more introspective and resigned tone, then to faster paced and slightly upbeat but sarcastic and cynical songs, finally ending with an existential soup of contemplation and absolution. If you play Nine Inch Nails' first five releases back-to-back, they tell the story of Trent Reznor's life up to that point. <i>With Teeth</i> tells the story of how he broke out of the cycle and how he picked himself up from rock bottom after <i>The Fragile</i>. It tells the story of someone blaming the outside world, losing their grip on reality as they sink into their own mind, and then realizing that they were their own worst enemy.<br><br>'Right Where It Belongs' is probably my favourite song ever becuase it reminds me of that feeling of absolution. It neatly ties up the theme of the whole album—finally being able to see things from the outside and breaking free from your own prison. I've rushed thorugh this whole explanation, and it probably makes no sense, but I'll explain it in full someday.<br><br>I really like this album. Hot take, maybe, but I think this is Nine Inch Nails' best album. I think it's extraordinarily well crafted and it's overlooked in their discography compared to things like 'The Downward Spiral'. This album is a marriage of pop and that brutal Nine Inch Nails sound; Atticus Ross' arrival is immediately felt. Listen to this album! My favourite songs off it are the aforementioned 'Right Where It Belongs', 'Sunspots', and 'The Hand That Feeds'.",
        "genre": "Industrial Rock",
        "rating" : "98",
        "duration": "56:05",
        "tracks": [
            "All the Love in the World",
            "You Know What You Are? ",
            "The Collector",
            "The Hand That Feeds",
            "Love Is Not Enough",
            "Every Day Is Exactly The Same",
            "With Teeth",
            "Only",
            "Getting Smaller",
            "Sunspots",
            "The Line Begins to Blur",
            "Beside You In Time",
            "Right Where It Belongs"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "ABBA",
        "album": "Gold",
        "year": "1992",
        "cover": "./assets/albumart/abba - gold.jpg",
        "description": "I don't usually listen to compilations, nor would I usually recommend them, but how about one of the best-selling compilation albums of all time? The first volume of ABBA's Greatest Hits is eighty minutes packed with lots of fun. On a good pair of headphones, a lot of these songs have surprisingly good stereo mixing, too! I suppose ABBA isn't for everyone, but no matter who you are, I'm sure you can find something you not only know, but secretly enjoy off this album. I think the only thing I don't enjoy about this release is its length—if you listen to it from start to finish like any other album, it feels like it overstays its welcome a bit. They probably could've split these GOLD albums into three or four volumes and sold even more copies! Regardless, <i>thank you for the music!</i><br><br>My favourite tracks off this one are 'Take A Chance On Me', 'Mamma Mia', 'Lay All Your Love on Me', 'Waterloo', 'One of Us', 'Does Your Mother Know', and 'The Winner Takes It All'. ",
        "genre": "Europop",
        "rating" : "80",
        "duration": "1:17:08",
        "tracks": [
            "Dancing Queen",
            "Knowing Me, Knowing You",
            "Take a Chance on Me",
            "Mamma Mia",
            "Lay All Your Love On Me",
            "Super Trouper",
            "I Have a Dream",
            "The Winner Takes It All",
            "Money, Money, Money",
            "SOS",
            "Chiquitita",
            "Fernando",
            "Voulez-Vous (edit)",
            "Gimme! Gimme! Gimme! (A Man After Midnight)",
            "Does Your Mother Know",
            "One of Us",
            "The Name of the Game (edit)",
            "Thank You For The Music",
            "Waterloo"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "The Bangles",
        "album": "Greatest Hits",
        "year": "1990",
        "cover": "./assets/albumart/the bangles - greatest hits.jpg",
        "description": "Bangles? <i>The</i> Bangles? I don't know what this band is actually called, but I do know that this compilation absolutely rocks! A lot of people don't seem to take this band seriously becuase of big hits such as 'Manic Monday' and 'Walk Like An Egyptian', but I've come to really appreciate their music in the last year. I always liked what I heard from them on the radio, but when I heard 'Hero Takes The Fall', I knew I needed to dive into their discography. This compilation will give you a great sample of their Pop Rock/Power Pop/Jangle Pop sound.<br><br>I really like this album. It's just filled with songs I wish I'd heard earlier, and now I can say that I like The Bangles. Why didn't anyone tell me they're awesome?<br><br>My favourite tracks off this one are 'I'll Set You Free', 'Going Down To Liverpool', 'Walking Down Your Street' and 'Hero Takes The Fall'. Although the packaging and insert doesn't seem to denote anything about edits, a couple songs are slightly different than their original releases. The most notable of these alterations is on 'I'll Set You Free', which has been tightenend up and really polished; I like it a lot better than the original version off <i>Everything</i>.",
        "genre": "Power Pop",
        "rating" : "87",
        "duration": "48:24",
        "tracks": [
            "Hero Takes The Fall",
            "Going Down To Liverpool",
            "Manic Monday",
            "If She Knew What She Wants",
            "Walk Like an Egyptian",
            "Walking Down Your Street",
            "Following",
            "Hazy Shade of Winter",
            "In Your Room",
            "Be With You",
            "I'll Set You Free",
            "Everything I Wanted",
            "Where Were You When I Needed You"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Prince & The Revolution",
        "album": "Purple Rain",
        "year": "1984",
        "cover": "./assets/albumart/prince and the revolution - purple rain.jpg",
        "description": "This is one of my mother's favourite albums; she was a huge fan of this when it came out, and she recommended this one to me a long time ago when I was too young to differentiate the abstract concept of <i>a</i> prince from <i>the</i> Prince. This forty minute epic serves as the soundtrack to Prince's own film of the same name. This album is absolutely spectacular; it demonstrates Prince's exceptional ability as a songwriter and musician. This is regarded by critics as one of the greatest of all time, and it fully deserves that. You could very easily say that this is the best soundtrack of all time; it just blows everything else out of the water. I was blown away when I saw the music video excerpt of Prince himself performing 'Purple Rain': he's like Jimi Hendrix on guitar mixed with a completely unique presence and flair.<br><br>I didn't expect to like this album as much as I do. I bought it becuase of that far off recommendation from my mother when I saw a copy of it at a thrift store, and boy am I glad I took that chance. There's not much more to be said about this album; just listen to the opening track, 'Lets Go Crazy', and you won't stop it prematurely.<br><br>My favourite songs off the album are 'Baby I'm A Star', 'Purple Rain' and 'Let's Go Crazy'. I like the flowers on a white background: it reminds me of bedsheets long gone. ",
        "genre": "Pop",
        "rating" : "93",
        "duration": "43:52",
        "tracks": [
            "Let's Go Crazy",
            "Take Me With U",
            "The Beautiful Ones",
            "Computer Blue",
            "Darling Nikki",
            "When Doves Cry",
            "I Would Die 4 U",
            "Baby I'm a Star",
            "Purple Rain"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Meat Loaf",
        "album": "Bat Out of Hell",
        "year": "1976",
        "cover": "./assets/albumart/meat loaf - bat out of hell.jpg",
        "description": "This one is an all-time classic! <i>Bat Out of Hell</i> is the first offering by Meat Loaf, with all songs written by composer Jim Steinman. It's partly based on a musical written by the latter called <i>Neverland</i>, giving the album the feel of a concept album: each song, passionately belted out by the singer (who became a vegetarian later in life for a time), tells it's own grandiose story. Maybe you can't <i>really</i> fall in love with this slightly angsty album if you're not in high school, but I'm glad I did. I think this might be for more of a niche audience that's open to this kind of operatic thing. Either way, you should at least know the lyrics to 'Paradise by The Dashboard Light' so you can sing along when someone else abruptly starts singing it. It's happened to me twice, somehow.",
        "genre": "Rock",
        "rating" : "87",
        "duration": "46:35",
        "tracks": [
            "Bat Out of Hell",
            "You Took The Word Right Out of My Mouth",
            "Heaven Can Wait",
            "All Revved Up With No Place To Go",
            "Two Out of Three Ain't Bad",
            "Paradise By The Dashboard Light",
            "For Crying Out Loud"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Wolfgang Amadeus Mozart",
        "album": "Eine Kleine Nachtmusik",
        "year": "1787",
        "cover": "./assets/albumart/wolfgang amadeus mozart - eine kleine nachtmusik.webp",
        "description": "The name of this composition translates to 'A Little Night Music', but that's never made sense to me—this is a supercharged, fast-paced, electric, Punk Rock EP that gets you up and out, hits you in the head with a brick, and leaves as quickly as it came.<br><br>Needless to say, I <i>love</i> this work. It's a rowdy injection of pure music pleasure straight into the vein; it was 'Short n Sweet' before Sabrina Carpenter made it cool. If this doesn't make you feel, I don't know what will: it's got raucous Green Day, Sex Pistols, Clash, Bee-Gees written all over it.<br><br>My favourite version is the 1982 Berliner Philharmoniker recording conducted by Herbert Von Karajan.",
        "genre": "Chamber Ensemble",
        "rating" : "100",
        "duration": "17:06",
        "tracks": [
            "I. Allegro",
            "II. Romance: Andante",
            "III. Menuetto: Allegretto",
            "IV: Finale: Rondo Allegro"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Genesis",
        "album": "Selling England By The Pound",
        "year": "1973",
        "cover": "./assets/albumart/genesis - selling england by the pound.jpg",
        "description": "The fifth album from Genesis is a lot of fun. I like the Peter Gabriel era, I like the Phil Collins era—Genesis is just a great band. This album is still very much Progressive Rock: it's got stretching compositions, esoteric and whimsical lyrics and it makes you feel...I don't know, the way Progressive Rock makes you feel! It's something you'd want to listen to while reading <i>Ringworld</i> or doing literally anything else. It's a great album.<br><br>My favourite tracks off this one are 'Dancing with the Moonlit Knight', 'I Know What I Like' and 'The Battle of Epping Forest'",
        "genre": "Progressive Rock",
        "rating" : "85",
        "duration": "53:48",
        "tracks": [
            "Dancing With The Moonlit Knight",
            "I Know What I Like (In Your Wardrobe)",
            "Firth Of Fifth",
            "More Fool Me",
            "The Battle Of Epping Forest",
            "After The Ordeal",
            "The Cinema Show",
            "Aisle Of Plenty"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Crowded House",
        "album": "Crowded House",
        "year": "1986",
        "cover": "./assets/albumart/crowded house - crowded house.jpg",
        "description": "I didn't like this at all the first time I stuck it in my CD player. I found it at the thrift store, recognized the album cover from the hit single \"Don't Dream It's Over\" and bought it. This album sat around for nine months, and between then and the time I listened to it again, I learned to apprecaite <i>The Rembrandts/L.P.</i>. I think that if you like this album, you'll probably like The Rembrandts as well—Crowded House almost certainly influenced them.<br><br>Acoustic guitars, tastefully layered electric leads, close vocal harmonies—their balanced, warm and intentionally not flashy sound leads to a clean, uncluttered production. It's good stuff, and this sound is most certainly growing on me. This album in particular speaks it's point and lets itself out: it doesn't overstay its welcome and lets you enjoy it for what it is.<br><br>My favourite tracks off this one are \"Mean To Me\", \"Can't Carry On\" and \"Don't Dream It's Over\"",
        "genre": "Jangle Pop",
        "rating" : "79",
        "duration": "38:40",
        "tracks": [
            "Mean To Me",
            "World Where You Live",
            "Now We're Getting Somewhere",
            "Don't Dream It's Over",
            "Love You 'Til The Day I Die",
            "Something So Strong",
            "Hole In The River",
            "Can't Carry On",
            "I Walk Away",
            "Tombstone",
            "That's What I Call Love"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Genesis",
        "album": "Invisible Touch",
        "year": "1986",
        "cover": "./assets/albumart/genesis - invisible touch.jpg",
        "description": "I love everything about this album. It's the absolute peak of Genesis' popularity in popular culture:<i>Invisible Touch</i> comes from a time when Phil Collins ruled the world—releasing solo music, producing for countless artists, and still recording with Genesis.<br><br>The album art, like the opening drum fill, will capture you instantly: bright contrasting colours, simple yet striking imagery, Franklin Gothic Heavy and Gill Sans—it's everything you could want from something designed in the mid-80's. The title track is an absolute earworm, and I listened to it an uncouth amount of times in the spring and summer of 2025. This album was not just one I enjoyed, but one I was addicted to.<br><br>The production is slicker than an otter's pocket, and it's what you'd expect from 80's Phil Collins. It's stuffed with synths, packed with clever lyrics, loaded with Phil Collins' charm, and it's gated reverb out the wazoo. I can't even explain how much I love this album—much less why—in a blurb this short. If you want to know what 1986 sounded like at its most polished, most infectious, and most Phil, just press play.<br><br>My favourite tracks off this one are \"Tonight, Tonight, Tonight\", \"Throwing It All Away\", \"Anything She Does\" and—of course—\"Invisible Touch\". It's Phil Collins' favourite Genesis song. It's my favourite Genesis song.",
        "genre": "Progressive Pop",
        "rating" : "97",
        "duration": "45:42",
        "tracks": [
            "Invisible Touch",
            "Tonight, Tonight, Tonight",
            "Land of Confusion",
            "In Too Deep",
            "Anything She Does",
            "Domino",
            "Throwing It All Away",
            "The Brazilian"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Jethro Tull",
        "album": "Thick As a Brick",
        "year": "1972",
        "cover": "./assets/albumart/jethro tull - thick as a brick.jpg",
        "description": "This album is a grand achievement in songwriting and absurdist sarcasm—for these two things alone, I love it. It's certainly not for everyone—43 minutes of uninterrupted, melodramatic flutes isn't for everyone. <br><br>The album is said to be a performance of a poem written by eight-year-old genius Gerald Bostock, who was disqualified from his local poetry competition in St. Cleve after it was deemed too controversial. The lyrics themselves were actually written by vocalist and flutist Ian Anderson, and are a parody of British society and religion. <br><br>I think the whole thing is ridiculous, catchy and a lot of fun to listen to. I would recommend this album to anyone who is open to such an experience. If you learn the lyrics, <i>Thick As a Brick</i>  is the undisputed ultimate sing-along song. <br><br>My favourite track off this one song album is the title track, \"Thick As a Brick\".",
        "genre": "Progressive Rock",
        "rating" : "93",
        "duration": "43:36",
        "tracks": [
            "Thick As a Brick"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Various Artists",
        "album": "La Bamba: The Original Motion Picture Soundtrack",
        "year": "1987",
        "cover": "./assets/albumart/various artists - la bamba original motion picture soundtrack.webp",
        "description": "Oddly enough, at the time of writing, I've never actually seen <i>La Bamba (1987)</i>. I've been familiar with it's soundtrack for most of my life after being introduced to it at a young age, so I'm quite fond of some of these songs.<br><br>It's infectious, classic 1950's rock n' roll, featuring re-recordings of Ritchie Valens' original songs by Los Angeles' Los Lobos.<br><br>I think anyone can enjoy this album and I'd highly recommend it. These tunes from the very forefront of rock itself still hold up extraordinarily well to this day. Music is music, and when it's good, it lasts forever.<br><br>My favourite track on this one is undoubtedly \"Come On, Let's Go\", followed by the titular \"La Bamba\", \"Charlena\" and \"Ooh! My Head\".",
        "genre": "Rock",
        "rating" : "90",
        "duration": "31:25",
        "tracks": [
            "La Bamba",
            "Come On, Let's Go",
            "Ooh! My Head",
            "We Belong Together",
            "Framed",
            "Donna",
            "Lonely Teardrops",
            "Crying, Waiting, Hoping",
            "Summertime Blues",
            "Who Do You Love",
            "Charlena",
            "Goodnight My Love"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Phil Collins",
        "album": "No Jacket Required",
        "year": "1985",
        "cover": "./assets/albumart/phil collins - no jacket required.webp",
        "description": "Legend has it that Phil Collins and Robert Plant were walking into a bar, but Phil was denied entry because he was wearing a jacket—that's why, for his third solo album, he declared \"<i>No Jacket Required</i>\".<br><br>What can you even say about this album? It's Phill freaking Collins! It's catchy as hell, the production is slicker than an otter's pocket and the drums sound amazing. You can sing it, you can dance to it—it's groovy and fun all the way through on the surface, and Collins' odd but excellent song writing shines underneath.<br><br>Did you know that Phil himself doesn't even know what a Sussudio is? That was just a filler word when he was writing the song, but couldn't figure out anything to replace it with.<br><br>My favourite tracks are \"Don't Lose My Number\", \"Sussudio\", \"Who Said I Would\" and \"Long Long Way To Go\".",
        "genre": "Pop Rock",
        "rating" : "85",
        "duration": "50:45",
        "tracks": [
            "Sussudio",
            "Only You Know And I Know",
            "Long Long Way To Go",
            "I Don't Wanna Know",
            "One More Night",
            "Don't Lose My Number",
            "Who Said I Would",
            "Doesn't Anybody Stay Together Anymore",
            "Inside Out",
            "Take Me Home",
            "We Said Hello, Goodbye (Don't Look Back)"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Rush",
        "album": "Hold Your Fire",
        "year": "1987",
        "cover": "./assets/albumart/rush - hold your fire.webp",
        "description": "I was blown away the first time I listened to <i>Hold Your Fire</i>—this album is pure Rush awesomeness! The choral intro to \"Force Ten\" brings this album slowly and dramatically into existence before a colossal Neil Peart's drum fill announces its arrival. There's so much energy here, and it's so much fun to listen to!<br><br>This is an album that gets you moving; it makes you feel good. This is Rush at their slickest and most polished as the 1980's comes to it's peak; Geddy Lee's soaring vocals and melodic bass are wrapped around lush keyboards, Alex Lifeson's shimmering guitar textures and Neil Peart's razor-sharp drumming. This album is complex enough for prog diehards, but it also got significant radio play in Canada upon its release.<br><br>During the summer of 2025, I listened to this album during the latter part of a 2,200ft ascent up a mountain. As I looked over the final hill and saw the top, Lee sung the final verses of Tai Shan—it felt almost too cinematic to be real. Cycling up a mountain while listening to Hold Your Fire made me feel like the coolest person on Earth for forty minutes. It'll be a story I tell my kids when I show them this album.<br><br>My favourite tracks off here are \"Force Ten\", \"Time Stands Still\", \"Mission\" and \"Turn The Page\".",
        "genre": "Hard Rock",
        "rating" : "92",
        "duration": "50:31",
        "tracks": [
            "Force Ten",
            "Time Stand Still",
            "Open Secrets",
            "Second Nature",
            "Prime Mover",
            "Lock And Key",
            "Mission",
            "Turn The Page",
            "Tai Shan",
            "High Water"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Creed",
        "album": "Weathered",
        "year": "2001",
        "cover": "./assets/albumart/creed - weathered.jpg",
        "description": "Although <i>Weathered</i> is probably my least favourite of the original Creed trilogy, it's still a great album. It's definitely their most polished of the three, and it really shows the band in a completely different place than they were just a few years ago with the release of <i>My Own Prison</i>: this is a slick, polished outfit selling stadiums and playing on the biggest stages of the world. <br><br>What else is there to say about this, really? It's Creed, but more refined! I like the album, and there's plenty of great hits off it. As I've mentioned before in other album reviews, I find it really weird that the internet suddenly loves Creed, but I'm all for it—I'm glad these guys have gone from one of the most hated bands to one that's actually appreciated for some really solid music.<br><br>My favourite tracks off this record are \"Weathered\", \"Freedom Fighter\", \"Who's Got My Back\" and \"One Last Breath\".",
        "genre": "Post-Grunge",
        "rating" : "75",
        "duration": "50:05",
        "tracks": [
            "Bullets",
            "Freedom Fighter",
            "Who's Got My Back",
            "Signs",
            "One Last Breath",
            "My Sacrifice",
            "Stand Here With Me",
            "Weathered",
            "Hide",
            "Don't Stop Dancing",
            "Lullaby"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Violent Femmes",
        "album": "Violent Femmes",
        "year": "1983",
        "cover": "./assets/albumart/violent femmes - violent femmes.jpg",
        "description": "This is quite a peculiar album! I'll be honest, I wasn't super duper into it the first time I heard it, but it's really grown on me. I think it's one of the better albums to come out of the 1980's. It's very folk-y, but it's got the urgency and riffs of punk rock. Instead of punk rockers under Thatcher's rule, think equally angry dudes around a campfire with acoustic guitars and banjos. <br><br>Each song is very distinct and well-written; there really is no filler (unless you're listening to a release with the two bonus tracks at the end) and every song contributes to the experience. These ten fast-paced tracks lasts only thirty-six minutes, making it a minute longer than The Clash's debut album.<br><br>I would seriously recommend this album. I think it might not be something you'll get into right away, but you should give it a chance. I would recommend skipping Tracks 11 and 12 on the US CD release if you've got them—the album flows extraordinarily well with just ten tracks, and the latter two really take away from the experience. All in all, I would say that this is the kind of album I forget to listen to more often than I want to, but when I do, it feels like a real treat. <br><br>My favourite tracks off this one are \"Add It Up\", \"To The Kill\" and \"Good Feeling\"",
        "genre": "Folk Punk",
        "rating" : "87",
        "duration": "36:15",
        "tracks": [
            "Blister In The Sun",
            "Kiss Off",
            "Please Do Not Go",
            "Add It Up",
            "Confessions",
            "Prove My Love",
            "Promise",
            "To The Kill",
            "Gone Daddy Gone",
            "Good Feeling"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Veruca Salt",
        "album": "Eight Arms To Hold You",
        "year": "1997",
        "cover": "./assets/albumart/veruca salt - eight arms to hold you.webp",
        "description": "This album is hard hitting, exciting and fast-paced mix of heavy metal, hard rock and grunge. Veruca Salt is an absolutely awesome band—think of <i>Eight Arms To Hold You</i> like the more refined, polished big sister of Hammerbox's <i>Numb</i>. The melodies are catchy and sometimes lean into pop-hooks, but the riffs are heavy. There's just so much to enjoy here! This album was produced by Bob Rock, who did Metallica's <i>Black Album</i> and worked on Motley Crue's discography.<br><br>My favourite tracks off this one are \"One Last Time\", \"Volcano Girls\", \"Benjamin\" and \"Don't Make Me Prove It\".",
        "genre": "Grunge",
        "rating" : "83",
        "duration": "51:10",
        "tracks": [
            "Straight",
            "Volcano Girls",
            "Don't Make Me Prove It",
            "Awesome",
            "One Last Time",
            "With David Bowie",
            "Benjamin",
            "Shutterbug",
            "The Morning Sad",
            "Sound of the Bell",
            "Loneliness is Worse",
            "Stoneface",
            "Venus Man Trap",
            "Earthcrosser"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Supertramp",
        "album": "Crime of The Century",
        "year": "1974",
        "cover": "./assets/albumart/supertramp - crime of the century.jpg",
        "description": "I think that <i>Crime of The Century</i> (CD-3647 from A&M's \"Audio Master Plus Series\") is one of the best CD masters in existence. Certainly for me, I think it's the best one in my collection and right up there with the best I've ever heard. <br><br> This album has such a colossal soundstage. Every single instrument, note, sound—each texture on this album comes across in the highest fidelity. It sounds rich, colourful and crisp all in a way that can't be put into words: you've just got to hear it.<br><br>This brilliant collection of long, theatrical, larger-than-life tunes is just brilliant for the group's third effort: songs each blend into the next; the mixing and mastering is top-tier—and aside completely from anything technical, it's just a great, fun album to listen to.<br><br>Did you know that Rick Davies seamlessly linked the first two tracks—\"School\" and \"Bloody Well Right\"—so that listeners would think it's a concept album? I got tricked by this one; it's hilarious to that little act of mischief is still catching out listeners today.<br><br>My favourite tracks off this one are \"School\", \"Bloody Well Right\", \"Asylum\", \"Rudy\", \"Dreamer\" and \"If Everyone Was Listening\".",
        "genre": "Progressive Pop",
        "rating" : "90",
        "duration": "44:10",
        "tracks": [
            "School", 
            "Blodoy Well Right", 
            "Hide In Your Shell",
            "Asylum", 
            "Dreamer", 
            "Rudy", 
            "If Everyone Was Listening", 
            "Crime of The Century"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "Pink Floyd",
        "album": "Wish You Were Here",
        "year": "1975",
        "cover": "./assets/albumart/pink floyd - wish you were here.jpg",
        "description": "How do you follow up the greatest album of all time? Pink Floyd was at the top of their game in the 1970's, and they pulled it off with <i>Wish You Were Here</i>.<br><br>I've always said that <i>The Dark Side of The Moon</i> is my favourite album of all time, but in terms of the <i>absolute</i> greatest album of all time, it could be a multitude of releases—Pink Floyd has at least three, and this is one of them.<br><br>This album (as with a lot of their music, I suppose) is written about former bandmate and creative visionary Syd Barrett. It's a concept album just like it's predecessor, and it's just brilliant. It's gut wrenching it's sunny—it's all shades of all colours. I wish you'd listen to it!<br><br>My favourite tracks off this one are the titular \"Wish You Were Here\" and all the parts of \"Shine On You Crazy Diamond\".",
        "genre": "Progressive Rock",
        "rating" : "99",
        "duration": "44:05",
        "tracks": [
            "Shine On You Crazy Diamond (Parts I—V)",
            "Welcome To The Machine",
            "Have A Cigar",
            "Wish You Were Here",
            "Shine On You Crazy Diamond (Parts VI—IX)"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    },
    {
        "artist": "King Crimson",
        "album": "In The Court of The Crimson King",
        "year": "1969",
        "cover": "./assets/albumart/king crimson - in the court of the crimson king.jpg",
        "description": "The music world changed forever in 1969 when Robert Fripp unleashed King Crimson's debut album unto the world. <i>In The Court of The Crimson King: Observations by King Crimson</i> is widely regarded as the first true Progressive Rock album, and one of the greatest Prog albums of all time. <br><br>This record combines rock music with grand, symphonic compositions, jazz and all sorts of other stuff to create a distinctive and unique sound. The Mellotrons are strong with this one—I think that's reason alone to listen to it!<br><br> Some say it's difficult to get into, but I enjoyed it right from the get-go. It's pretty wacky and out there—like, don't put this on at a dinner party unless your friends are very cool. A former coworker described it as \"proggalicious\", and based on my interpretation of that word, I wholeheartedly agree. <BR><BR>My favourite tracks off this one are \"I Talk To The Wind\", \"The Court of The Crimson King\" and \"20th Century Schizoid Man\".",
        "genre": "Progressive Rock",
        "rating" : "95",
        "duration": "43:54",
        "tracks": [
            "20th Century Schizoid Man",
            "I Talk To The Wind",
            "Epitaph",
            "Moonchild",
            "The Court of The Crimson King"
        ],
        "applemusic":"https://music.apple.com/us/album/the-rembrandts-l-p/373220996",
        "spotify":"https://open.spotify.com/album/6koDBGMqurYl3EZnaxCF7N"
    }
]