[    
    {
        "headline" : "Cadillac Shakes Down Car, Red Bull Launches Liveries",
        "date" : "01/16/2026",
        "body" : "Cadillac took their first step out on track today as F1's newest team as Sergio Perez took their 2026 challenger out for a spin at Silverstone<br><br>With it, we actually got some pretty clear shots of a car under the new regulations released officially by the Cadillac race team. I'm excited to see how they do. My Dad has become a big fan of them in recent years because of their V.Series-R program in IMSA.<br><br>Red Bull and their sister team launched their liveries on showcars as well, and I have to say, they're looking good. Not much changed other than a return to glossy paint finish, which I think is brilliant. In fact, I was just complaining about matte finishes last season!",
        "image" : "/assets/images/newspaper/cadillacshakedown.webp",
        "imagestyle": ""
    }, 
    {
        "headline" : "Mets Fans Rejoice, Jays Fans Despair: Bo Bichette On The Move",
        "date" : "01/16/2026",
        "body" : "Bo Bichette has signed with the New York Mets.<br><br>It's disappointing, considering we lost out on Tucker, and now we've lost our homegrown star. I do understand that he's getting older and he's become injury prone, but it sucks.<br><br>The Blue Jays have generally had a really good offseason, and we've got plenty of strong bats. I'm glad the Mets fans will at least get <i>somebody</i>—something, <i>anything</i> to be mildly happy about.<br><br>Oh, man—of all places, the Mets?!",
        "image" : "/assets/images/newspaper/byebyebichette.webp",
        "imagestyle": ""
    }, 
    {
        "headline" : "Kyle Tucker Signs With Dodgers, Jays Miss Out",
        "date" : "01/15/2026",
        "body" : "Somehow, as we thought the L.A. Dodgers couldn't be even more stacked than they already are, news broke today that the four time all-star has entered a four year deal. At a rumoured $60-million per year, Tucker could be raking in the second highest salary in baseball history, behind Ohtani's ongoing $70-million/yr deal.<br><br>It's a bit disappointing considering the Jays seemed to be finalists to him, but at least we've still got a chance at renewing Bichette and getting Bellinger.",
        "image" : "/assets/images/newspaper/tucker.webp",
        "imagestyle": ""
    }, 
    {
        "headline" : "Bob Weir of The Grateful Dead Has Died",
        "date" : "01/10/2026",
        "body" : "Sad news in the music world today: founding member and longtime guitarist of The Grateful Dead, Bob Weir, has passed away at age 78.<br><br>Weir stuck with the band throughout The Endless Tour and continued to play with various incarnations of the group after their dissolution in 1995. He was a fantastic songwriter and guitarist.<br><br>Some of my favourite Grateful Dead/Weir songs include 'Hell In A Bucket', 'Sugar Magnolia' and 'Truckin''",
        "image" : "/assets/images/newspaper/bobweir.webp",
        "imagestyle": ""
    }, 
    {
        "headline" : "Audi Tests New F1 Car",
        "date" : "01/09/2026",
        "body" : "An all-black prototype of Audi's first Formula 1 car was tested today in secret at Circuit de Barcelona-Catalunya. The inaptly named R26—sharing the name of Alonso's title-winning 2006 Renault—is the first F1 car from this regulation set to run on track.<br><br>Although footage of the test was grainy, it was visible how different the car's geometry is to last year. F1 launch season is just around the corner, though it doesn't really mean much since they're just liveries.",
        "image" : "/assets/images/newspaper/audifone.webp",
        "imagestyle": ""
    }, 
    {
        "headline" : "New Year, Same Crap—Imagine Dragons Still Sucks",
        "date" : "01/01/2026",
        "body" : "With the coming of the new year, I wanted to just remind everyone that Imagine Dragons is not, never has been and never should be considered music.<br><br>I don't like to dunk on bands that I don't like, and there's not a lot of music that I don't like. I don't jump on hate trains like a bandwagoner for no reason; I was a Creed fan when nobody else was—but I just can't stand Imagine Dragons.<br><br>If you like Imagine Dragons, there is help.",
        "image" : "/assets/images/newspaper/imaginedragons.webp",
        "imagestyle": ""
    }, 
    {
        "headline" : "\"Wish You Were Here\" UK's 2025 #1 Christmas Album",
        "date" : "12/19/2025",
        "body" : "This week, Pink Floyd's masterpiece <i>Wish You Were Here</i> has landed the number one spot on the official UK albums chart thanks to its conveniently-timed 50th anniversary re-release. Because it's the month of December, that now makes this legendary album a Christmas album. If <i>The Empire Strikes Back</i> is a Christmas movie, then <i>Wish You Were Here</i> is a Christmas album.",
        "image" : "/assets/images/newspaper/happygilmour.webp",
        "imagestyle": ""
    }, 
    {
        "headline" : "24 Hours of Daytona Entry List Revealed, Grid Packed",
        "date" : "12/13/2025",
        "body" : "The 61-car entry list for the 24 Hours of Daytona was released today, and it's great to see sportscar racing the healthiest it's ever been. We've got around a month to go until we see the flag fly in Florida this January for the 64th running of the Rolex 24, and it's going to be an awesome race!<br><br>I'll be rooting once again for the Porsche Penske #7 car piloted by Felipe Nasr, Julien Andlauer and former AO Racing \"Rexy\" driver Laurin Heinrich, and I'm looking forward to more great battles with the WTR Cadillac V.Series-R's!<br><br>In addition to last year's continuing grid, the Aston Martin Valkyrie makes it's Rolex 24 debut with the #23 entry.<br><br>Iron Dames is notably—and most unfortunately—absent. I hope they get their funding situation sorted out so they can get back on track soon. ",
        "image" : "/assets/images/newspaper/24hdaytona.webp",
        "imagestyle": ""
    }, 
    {
        "headline" : "Verstappen 2 Points Shy of Title, Piastri Finishes 3rd",
        "date" : "12/07/2025",
        "body" : "Well, it happened today—Lando Norris is the 2025 World Champion. I've never liked the guy and I'm not happy with it, but it is what it is. I can't help but think about Monza, when Piastri pulled over and let Norris through—those points could've given Max his fifth title. I think of Max's over-agression on George which cost him a handful of points; Piastri's safety-car braking incident at Silverstone. That's just the way it goes, right?<br><br>Hamilton is so washed.",
        "image" : "/assets/images/newspaper/piastriloss.webp",
        "imagestyle": ""
    },
    {
        "headline" : "Toyota Unveils GR GT3, GR010 EVO, HAAS Title Sponsorship",
        "date" : "12/05/2025",
        "body" : "Toyota has made a massive statement reiterating their commitment to all kinds of racing. Today, they revealed the successor to their recently retired Lexus GT3—the purpose-built GT GT3. It's an awesome looking car built with the track in mind to compete in the GT3 class. While it might not hit the track right away, it's expected to compete full-time in all series next year in 2027. This comes at the same time more details about Toyota's new hypercar challenger—the GR010 EVO—have come out, with a complete aero and internal rework to compete for overall victory in WEC. <br><br>Toyota also announced a title sponsorship for HAAS F1, marking a more complete return to F1 since the 2008 financial crisis. It seems like Toyota has slowly re-entered back into the single-seater landscape, having sponsored a driver and car in F2 this year as well. I'm hoping they'll take over HAAS in a more complete capacity in the years to come.",
        "image" : "/assets/images/newspaper/grgt3gr010evo.webp",
        "imagestyle": ""
    },
    {
        "headline" : "The Dream Has Died",
        "date" : "11/09/2025",
        "body" : "The collapse of Oscar Piastri's form in the latter half of the 2025 season will be studied and contested for years to come. Lando Norris has a commanding lead on the title with just three races to go, and with the pace he's shown, I doubt whatever Piastri will be able to muster will be enough.<br><br>Hamilton is washed. I never wanted him in a Ferrari, and here we are at the end of the season without even a podium to show.<br><br>Lando Norris, World Drivers Champion—a disgusting thoguht!",
        "image" : "/assets/images/newspaper/averagehamilton.webp",
        "imagestyle": ""
    }, 
    {
        "headline" : "...And What a Season it Was",
        "date" : "11/02/2025",
        "body" : "With the crack of Alejandro Kirk's broken bat, the L.A. Dodgers made the final out they needed to win the 2025 World Series. I knew the Jays weren't playing well enough to win it when we were up a run in the 8th and couldn't cache in with the bases loaded. Some might say IKF's slide was the definitive moment—there will always be if's, but's and what if's, but if my grandmother had wheels, she'd be a bicycle.<br><br>This was a wonderful, special season to watch and I'm happy that the Jays are back at the top of baseball after so long. We'll see what happens this offseason and if the team can stay together to rally another year.<br><br>Thank you, Blue Jays. I've been waiting for this my whole life and the deep playoff run was everything I'd hoped it would be.",
        "image" : "/assets/images/newspaper/alchamps.webp",
        "imagestyle": ""
    }, 
    {
        "headline" : "Blue Jays Win World Series Game 1",
        "date" : "10/24/2025",
        "body" : "The Toronto Blue Jays absolutely creamed the Los Angeles Dodgers today in Game 1 of the World Series tonight at the Rogers Centre. The first couple of innings were tense, but Varsho tied the game with a two-run homer before everything exploded in the sixth.<br><br>Bottom of the 6th, 2025 World Series Game 1—one of the greatest innings of post-season baseball ever played, and most certainly one of the Blue Jays' finest innings. I personally made sure the whole neighbourhood knew when we scored; I was absolutely beside myself! I've never felt so excited about any live sports ever!<br><br>Addison Barger was just amazing: the first ever pinch hit grand slam in postseason history! He'll go down in history for that—all these guys are Blue Jays legends. I never thought the Blue Jays could make it this far after watching them amount to mediocrity so many times throughout my life. This is so, so special.<br><br>I think that having Geddy Lee do the intro to the World Series is the coolest thing I've ever witnessed. I can't believe one of the most epic, legendary bands in history just opened up the World Series for my favourite team!",
        "image" : "/assets/images/newspaper/wsgameone.webp",
        "imagestyle": ""
    },    
    {
        "headline" : "Blue Jays World Series Bound",
        "date" : "10/21/2025",
        "body" : "After defeating the Seattle Mariners, the Toronto Blue Jays will face the Los Angeles Dodgers this friday. Words cannot describe how special this is. It all comes down to this!",
        "image" : "/assets/images/newspaper/jayslegends.jpg",
        "imagestyle": ""
    },
    {
        "headline" : "Blue Jays Advance to ALCS, Send Yankees to Cancun",
        "date" : "10/08/2025",
        "body" : "After a nail-biting bullpen game, the Jays defeated the Yankees 5–2 tonight in the Bronx. The Jays played well throughout the series, massively outscoring the Yanks and embarassing them—it was so much fun seeing all the despondent Yankees fans!<br><br>Vladimir Gurrero came alive with tons of hits and gold-glove plays, and Ernie Clement in particular really stood out to me. He hit .643 this series—that's 9–14! The whole lineup just played like they have all season and it felt so good to watch. <br><br>Now, the Jays get to rest as the other division series advance to additional games to determine who they'll face next. ",
        "image" : "/assets/images/newspaper/sadyanks.webp",
        "imagestyle": ""
    },
    {
        "headline" : "Shame on Volkswagen! Porsche Withdraws 963 from WEC",
        "date" : "10/07/2025",
        "body" : "After this past weekend's 6h of Fuji came to a close, Porsche released a press release to announce their intent to discontinue the 963 hypercar program and leave the World Endurance Championship.<br><br>There's not much to say about this—it's just a real shame and another black scar on the name of Volkswagen, the parent company of Porsche. The same day, it was announced they'd \"continue\" their \"racing\" efforts in Formula E.<br><br>This comes almost exactly ten years after Audi, another Volkswagen brand, announced their departure from WEC. For the first time in a long time, there very well might be no Porsche fighting for the top class win at Le Mans—we're truly going into a new era. I hope they'll come back soon and stop wasting their time in FE—it's just a shame. It's all a shame. Nobody wants to see this.",
        "image" : "/assets/images/newspaper/noPorsche.jpg",
        "imagestyle": ""
    },
    {
        "headline" : "Rush Announce Reunion Tour",
        "date" : "10/06/2025",
        "body" : "Just days after Geddy Lee was sighted at the Toronto Blue Jays game and Alex Lifeson teased at the possibility of Rush coming together again to play, the two surviving members have announced the \"Fifty Something Tour\" to celebrate half a century of hard-rocking awesome music.<br><br>Anika Nilles will take the place of Neil Peart on tour. It's big shoes to fill, but if Lifeson and Lee think she's good enough, then she's good enough—no questions asked. I hope people don't try to compare her or give her crap about not being the person she's replacing, cause it's going to be awesome either way. This band is one of the greatest to ever do it, and are most certainly one of if not the best Canadian band. <br><br>All I can say is HELL YEAH!",
        "image" : "/assets/images/newspaper/rushthird.webp",
        "imagestyle": ""
    },
    {
        "headline" : "Jays Blitz Yankees; Yesavage Makes History",
        "date" : "10/05/2025",
        "body" : "In my lifetime, October baseball in Canada has never felt quite like this. The Jays are 2–0 against the Yankess in the ALDS, outscoring them 23–8. Vladimir Gurrero Jr hit Toronto's first postseason grand slam, recreating Bautista's iconic bat flip moment from 2015. These two games are ones I'll never, ever forget—it was just so special. The Jays' bats are alive, and seemingly everybody is hitting well right now.<br><br>I was happy to see Gausman pitch the first game and equally happy to see Yesavage making his postseason debut in the second game. What an outing! His third major league start happens to be in game two of the ALDS, and he throws almost six innings of no-hit ball!<br><br>How wonderful it was to hear the crowd chanting \"YANKEES SUCK!\" over the TV broadcast.",
        "image" : "/assets/images/newspaper/yesavage.webp",
        "imagestyle": ""
    },
    {
        "headline" : "McLaren Betray Oscar Piastri",
        "date" : "10/05/2025",
        "body" : "McLaren won the Constructor's Championship for the second year in a row today, but it didn't feel like something worth celebrating.<br><br>After a year fraught with silly team orders and meddling with race results, McLaren showed their true colours today after a Turn 1 collision between Oscar Piastri and Lando Norris. Norris barged past Piastri to eventually take third place, hitting Max Verstappen and sustaining front wing damage along the way. They made a huge deal about Piastri making a clean move on Norris in Monza, but this was \"just hard racing!\" according to Zak Brown.<br><br>It's been hard to root for a team like McLaren which rallies around a driver like Lando Norris and consistently screws over their second driver, who has been a team player all season and is getting nothing in return.<br><br>I suppose you can just call that naivete on Piastri's part—I certainly hope he'll take the championship into his own hands and stop playing the \"team game\" with silly Norris-biased Papaya Rules.",
        "image" : "/assets/images/newspaper/unhappiastri.webp",
        "imagestyle": ""
    },
    {
        "headline" : "Toronto Blue Jays: 2025 AL East Champions",
        "date" : "09/28/2025",
        "body" : "With a decisive 13–4 victory against the Tampa Bay Rays, the Toronto Blue Jays won their division for the first time in ten years. The game got off to an explosive start with hits from Springer, Gurrero and eventually a grand salami by Kirk. Gausman wasn't the best today, but he gave it his best through three innings before handing it over to the bullpen. By the time the 7th inning came around, it was clear that the Jays had won—it just looked like the Rays were six feet underground.<br><br>I'm very excited for the post season. This week, it'll be the iconic Red Sox vs Yankees matchup to determine who will play the Jays this saturday. <br><br>It feels better than it did in 2015!",
        "image" : "/assets/images/newspaper/vladyii.jpg",
        "imagestyle": ""
    },
    {
        "headline" : "Max Verstappen Wins on Nordschleife Debut",
        "date" : "09/27/2025",
        "body" : "After getting his NLS license the weekend before the Azerbaijan Grand Prix, Max Verstappen found himself back at the Nürburgring Nordschleife this weekend to compete in his first NLS cup race. At the wheel of his Verstappen.com Ferrari 296 GT3, he took the lead into turn 1 and drove a brilliant two hour stint before handing it over to his teammate with a one minute lead. Verstappen's car stayed in the lead and took the victory, proving that he truly is one of the best to ever turn a wheel in anger. I'm happy to see him in a GT car!<br><br>That's not the only headline from the weekend though—Jann Mardenborough of the #9 Ford Mustang finished second on the podium. It's great to see him racing again! It's hard to believe that over ten years have passed since that fatal accident at the ring. I was sat on my PS3 playing Gran Turismo 6 and wondering if I could be a real racing driver just like Jann...<br><br>A final thought: Sainz scored a podium in a Williams, Antonelli scored a podium in a Mercedes and Verstappen has won in a Ferrari before Lewis Hamilton has done literally anything this season.",
        "image" : "/assets/images/newspaper/verstappen296.webp",
        "imagestyle": ""
    },
    {
        "headline" : "Toronto Blue Jays Clinch Playoff Spot, Set Sights on Division Title",
        "date" : "09/22/2025",
        "body" : "At last night's game against the Kansas City Royals, the Toronto Blue Jays punched their ticket to the postseason. Canada's team remembered they're supposed to hit the ball and did so, putting them up 8–5 against the Royals.<br><br>The Blue Jays are the first American League team to hit 90 wins, and are hoping to win the division in the next couple of games as the regular season draws to a close.<br><br>Tonight at home in the Rogers Centre, fans will be seeking to break the franchise Loonie Dogs record, as it is the final night of the season they'll be able to buy hot dogs for a dollar.",
        "image" : "/assets/images/newspaper/vlady.jpg",
        "imagestyle": ""
    },
    {
        "headline" : "Sheer Horror: Jays Obliterated 1–20, Piastri In The Wall",
        "date" : "09/21/2025",
        "body" : "This weekend's Azerbaijan Grand Prix was certainly one to remember: Oscar Piastri found himself in the wall both in qualifying and in the race, making it the worst grand prix weekend of his career. His teammate and title rival had a golden opportunity to claw back some ground in the world championship, but as usual, bottled the opportunity—Norris finished seventh, scoring only six points.<br><br>Carlos Sainz put in a stunning drive to finish third and get Williams' first podium since 2017—he has now scored a podium at his new team before Lewis Hamilton, who replaced him at Ferrari.<br><br>In baseball, the Jays' bats have gone cold in the latter half of their series against the Rays and now two games into their series against the Royals. It's ugly to watch.",
        "image" : "/assets/images/newspaper/sheerhorror.webp",
        "imagestyle": ""
    },
    {
        "headline" : "Half A Century Wishing You Were Here",
        "date" : "09/12/2025",
        "body" : "Fifty years ago this week, Pink Floyd released <i>Wish You Were Here</i>—a brilliant collection of seamlessly blended songs dedicated to founding member Syd Barrett and criticizing the music industry. Pink Floyd is the only band in history that could have recorded the best album of all time, followed it up with one of the best albums of all time, but neither are their best album. <br><br>Sony announced that a remaster of the album will be released sometime in December of 2025, including a Dolby Atmos mix. The <i>DSOTM</i> Atmos mix was awesome, so I'm really looking forward to this one and I plan to get a copy of it on blu-ray.",
        "image" : "/assets/albumart/pink floyd - wish you were here.jpg",
        "imagestyle": ""
    },
    {
        "headline" : "Gausman Shuts Out Astros in 100 Pitches",
        "date" : "09/11/2025",
        "body" : "The title of this one really says it all: this afternoon, Kevin Gausman executed an almost flawless game on the mound for the Toronto Blue Jays facing off against the Houston Astros. He put up a brilliant defense, allowing no runs and just two hits over a full game. He looked invincible out there on the mmound, and the home crowd just ate it up. I wish I was at that game!<br><br>Offensively, the AL-East-leading Jays were brilliant as well. Every single player, regular or not, contributes to this team and it's spectacular to see. Even without Bo Bichette, the lineup is one of the best in the league, putting up six runs.<br><br>If the Yankees lose a third straight game to the Tigers, the Jays will lead the AL-East by 3.5 games.",
        "image" : "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1704050871/96514212-60d0-45c7-8c7e-ffec7a6010fb/d5bd695b-3f8d-4cee-836c-40c80a89f30a/1280x720/match/image.jpg",
        "imagestyle": ""
    },
    {
        "headline" : "One Year On The Web",
        "date" : "09/09/2025",
        "body" : "As of today, it's been one year since this website launched. On September 9th, 2024, I created the GitHub Pages repository and uploaded the first version of this site. It was built in a crappy GUI website builder I abandoned a month later in favour of learning CSS, HTML and JavaScript. <br><br>That fresh start launched on October 2nd, 2024, and it evolved into the site I've got today. <br><br>It's been a blast, and I'm looking forward to many more years on the net!",
        "image" : "/assets/images/newspaper/cybersiteone.png",
        "imagestyle": ""
    },
    {
        "headline" : "Max Verstappen Wins Farcical 2025 Italian Grand Prix",
        "date" : "09/07/2025",
        "body" : "It felt like the days of old (early 2024) watching Verstappen storm form pole to victory this weekend in Monza. It was quite an unexpected result on Saturday, but I had a feeling nobody would be getting by him during the race. Despite all the dominance these past few years, it's still wonderful to see one of the greatest to ever do it on the top step of the podium.<br><br>The big story was McLaren, who went a little too far with their \"Papaya Rules\": after suffering a slow pitstop, they had him switch positions with Oscar Piastri. This is the most weirdly docile championship ever! I don't like the precedent this sets.",
        "image" : "https://d2n9h2wits23hf.cloudfront.net/image/v1/static/6057949432001/789b1a5e-11ff-4e5e-9e23-323da380f1cc/d4eaa5f7-e458-45ca-b5e1-82599eb1f4ea/864x486/match/image.jpg",
        "imagestyle": ""
    },
    {
        "headline" : "Supertramp Co-Founder Rick Davies Dies Aged 81",
        "date" : "09/06/2025",
        "body" : "I was sad to read today that Rick Davies of Supertramp has passed away today. Supertramp was a funky progressive pop band who found success in the 1970's and 1980's, particularly in Canada—many will know their albums <i>Breakfast In America</i> and <i>Crime of The Century</i>, which sold here in droves. Davies was one of the key creative forces behind the band's sound and the stories they told through song.<br><br>It's sad that these brilliant musicians are passing and will soon pass. One day, it'll be David Gilmour, Roger Waters, Phil Collins, Geddy Lee and all the rest of them. I'm glad I was born in an era when I can say I walked the Earth at the same time as them.<br><br>I'm posting this here on my site because this guy's music means something to me.",
        "image" : "https://upload.wikimedia.org/wikipedia/commons/f/f6/Supertramp_-_Rick_Davies_%281979%29.png",
        "imagestyle": ""
    },
    {
        "headline" : "Shock, Horror, Euphoria & Triumph: Piastric Wins 2025 Zandvoort GP",
        "date" : "08/31/2025",
        "body" : "Today, Formula 1 fans were treated to what I believe will be remembered as a modern classic—the 2025 Dutch Grand Prix had absolutely everything, and Oscar Piastri weathered it all to come out on top in another statement victory over teammate and title rival Lando Norris. <br><br>I laughed as Hamilton slid into the barriers and screeched with guttural terror as Antonelli took out LeClerc. Piastri had the race in the bag, but it still felt like Christmas, Easter and Birthday all rolled into one when Lando Norris ground to a halt with an engine issue. Outstanding drive from Isaac Hadjar, too—he really earned that podium this weekend!<br><br>Going into next week's race in Monza, Piastri holds a commanding 34-point lead in the championship.",
        "image" : "/assets/images/newspaper/zandvoort2025.webp",
        "imagestyle": ""
    },
    {
        "headline" : "Oscar Piastri Returns From Summer Break With Pole Position, Stroll Crashes Twice",
        "date" : "08/30/2025",
        "body" : "In a spectacular effort, Oscar Piastri has squeaked past Lando Norris to take pole position at this weekend's Dutch Grand Prix by a margin of just twelve thousandths. With that lap, Piastri also breaks the all-time lap record set by Max Verstappen in 2021 with a 1:08.662.<br><br>Although Alonso looked very promising throughout free practice, he qualified tenth while teammate Lance Stroll went for two excursions into the barriers, ultimately ending his weekend before it even began.",
        "image" : "/assets/images/newspaper/strollthings.webp",
        "imagestyle": ""
    },  
    {
        "headline" : "\"I'm a real site now!\": michaelscybersite.net Moves to Dedicated Web Host",
        "date" : "08/29/2025",
        "body" : "Over the past couple of days, I've been in the process of migrating this website from GitHub Pages to a new host, DigitalOcean. I've had a blast working on this site for almost a year now, and I'm looking forward to expanding and experimenting with it more now that I've got more capability in the backend.<br><br>It's a world of endless possibilities! Who knows what's in store—an internet radio station? A themed weather-widget? Web-GL games? A visitor counter? All sorts of shenanigans will be unleashed!",
        "image" : "/assets/pictures/DSC_192099.webp",
        "imagestyle": ""
    },  
    {
        "headline" : "Blue Jays Return to Top AL-East, Face Off Against Best Team in Baseball Next",
        "date" : "08/27/2025",
        "body" : "After an amazing run this 2025 season, the Toronto Blue Jays have returned to the top of the AL-East after a stressful 9–8 win over the Twins. The Jays have been in fine form offensively as of late, but have reminded me why they're so often called \"The Blow Jays\"—once the starter steps off the mound, their defense falls apart.",
        "image" : "/assets/images/newspaper/jays.webp",
        "imagestyle": ""
    },  
    {
        "headline" : "Lamborghini Pulls Plug on SC63",
        "date" : "08/04/2025",
        "body" : "In a press release, Lamborghini announced they'll be putting the SC63 Hypercar project \"on hold\" for a \"strategic realignment\" in 2026—after pulling out of WEC for the 2025 season, this stinks like a hypercar being murdered in cold blood. Sure, the car wasn't the fastest in it's debut season last year, but there have been flashes of potential as recently as Watkins Glen 2025 this past June.<br><br>It's a disappointing outcome and a short, troubled run for such a beautiful car.<br><br>Photo taken by me, Watkins Glen 2024.",
        "image" : "/assets/pictures/DSC_163495.webp",
        "imagestyle": ""
    },  
    {
        "headline" : "Oscar Piastri Wins In Belgium As Lando Falters",
        "date" : "07/26/2025",
        "body" : "After a lengthy rain delay, Oscar Piastri wasted no time in getting by Lando Norris to take the lead of this year's Belgian Grand Prix. The mistake at turn one which allowed Oscar to get by before the end of the Kemmel Straight was just one of many slip-ups which prevented Norris from taking the win today.<br><br>Lewis Hamilton drove a brilliant race, starting from the pit lane and finishing behind Alex Albon in 7th—I do hope we see this version of him out on track more often. For Alonso, it's a week to forget.<br><br>Going into the last race before the summer break, Piastri has a 16-point lead over Norris, and I reckon it'll only grow.",
        "image" : "https://media.formula1.com/image/upload/c_lfill,w_3392/q_auto/v1740000000/fom-website/2025/Belgium/GENERAL%20CROP%20-%202025-07-27T165430.787.webp",
        "imagestyle": ""
    },   
    {
        "headline" : "07/25/2025: The Most Beautiful Day In All of Existence",
        "date" : "07/25/2025",
        "body" : "We have just lived through (numerically) the most beautiful day in all of existence.<br><br>Two zeroes, a seven, three twos and two fives—just marvelous! And in this order, too! We'll never have another day like this for the rest of history. Two twenty-fives—two quarters! It just looks so good no matter what font you put it in: it feels good to write; it feels good to see; it <i>is</i> good.<br><br>A bit of a silly thing, but I think it's the most beautiful day in all of existence—but what can I say? I'm just a guy who likes 2's, 5's and 7's.",
        "image" : "/assets/images/newspaper/07252025.webp",
        "imagestyle": ""
    },   
    {
        "headline" : "Roger Waters: This Is Not A Drill Hits Theatres",
        "date" : "07/23/2025",
        "body" : "Featuring a full concert from his recent 2023 performance in Prague, this film really makes you feel like you're a part of the concert. Roger Waters hasn't lost any edge in his advanced age, and I'm glad to see he's still playing passionately. It was very cool to hear his little excerpts here and there, selections from <i>The Wall</i> in full costume along with the latter half of <i>The Dark Side of The Moon</i>.<br><br>This concert film is screening globally today in theatres—July 23rd—with an encore on July 27th. ",
        "image" : "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Rogers_Waters_This_Is_Not_a_Drill_laser_prism_o2_London.jpg/1920px-Rogers_Waters_This_Is_Not_a_Drill_laser_prism_o2_London.jpg",
        "imagestyle": ""
    },
    {
        "headline" : "Christian Horner fired by Red Bull after 20 years",
        "date" : "07/09/2025",
        "body" : "This morning, I woke up to news that Christian Horner, the longtime team principal of Red Bull Racing, has been fired by the higher-ups at Red Bull.<br><br>I'm very sad about this. I think Horner is one of the greatest team principals of all time, and I've enjoyed having him as a constant in the sport over the past fiteen or so years I've been actively keeping tabs and watching. I don't have much faith that Red Bull will recover from their slump going forward without him at the helm—it's going to be a completely different team. I think they're going to drift lost for a decade like McLaren did after they fired Ron Dennis.<br><br>I believe he was ultimately sacked because there was a shift of allegiance in the higher-ups at Red Bull. Maybe this is in reaction to Max having signed a contract with Mercedes, or maybe this is a last-ditch effort to prevent Max from leaving. Either way, it's a huge loss and the end of an era for one of Formula 1's greatest teams.",
        "image" : "https://ichef.bbci.co.uk/ace/standard/2560/cpsprodpb/e96a/live/1026c1a0-5ca5-11f0-b8c6-458cd8075fd5.jpg",
        "imagestyle": ""
    },   
    {
        "headline" : "Matt Cameron Announces Departure From Pearl Jam",
        "date" : "07/08/2025",
        "body" : "After a twenty-seven year run, Matt Cameron has announced he will no longer drum for Pearl Jam.<br><br>After the original dissolution of Soundgarden in 1997, Cameron joined the band and played on every album and tour up to their most recent effort, <i>Dark Matter (2024)</i>. Previously, he also played for Grunge pioneers Skin Yard and was involved in supergroups such as Hater and Wellwater Conspiracy. Matt Cameron is one of my favourite drummers, and I hope there is more music from him to come.<br><br>Regardless, it's a good time to take a moment and appreciate all the music he's been a part of over the past forty years.",
        "image" : "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Matt_Cameron_SG_2013.jpg/1280px-Matt_Cameron_SG_2013.jpg",
        "imagestyle": ""
    },    
    {
        "headline" : "Oscar Piastri Extends Title Lead as Norris Falters in Canada",
        "date" : "06/15/2025",
        "body" : "Although the race was painfully boring to watch—especially after watching almost eighteen hours of top-flight sportscar racing—the sixty-seventh lap of the 2025 Canadian Grand Prix delivered.<br><br>Norris, in a desperate move to overtake Piastri, decided he was going to be a lawn mower and went for a gap that didn't exist in the first place. He crashed into the back of Piastri, shredding his front wing and sending himself into the pit wall down the main straight. To me, it was like birthday, easter and christmas all rolled into one!<br><br>Oscar Piastri now has a twenty-two point lead over Lando Norris in the driver's championship",
        "image" : "https://images.ps-aws.com/c?url=https%3A%2F%2Fd3cm515ijfiu6w.cloudfront.net%2Fwp-content%2Fuploads%2F2025%2F06%2F15223158%2Fmclaren-lando-norris-2025-canadian-grand-prix1-1320x742.jpg",
        "imagestyle": ""
    },    
    {
        "headline" : "FERRARI WINS THIRD CONSECUTIVE 24 HOURS OF LE MANS",
        "date" : "06/15/2025",
        "body" : "Oh, glorious day! The 83 Ferrari driven by none other than Robert Kubica has won the 2025 24h of Le Mans. I'm just overjoyed! Ferrari has won Le Mans for three consecutive years, and each of their hypercars have now finished first at the greatest race of the year.<br><br>This is a full-circle moment for Robert Kubica, who drove some spectacular stints over the past day in France. All the drivers of the 83 were absolutely perfect, and they deserved the win. For a decade Kubica was looked at as the tragedy, the never-was—but no longer. Prime Kubica never left, he just went away for a while.",
        "image" : "/assets/images/newspaper/ferrarilemans2025.webp",
        "imagestyle": ""
    },    
    {
        "headline" : "Ferrari Maintains 1-2-3 four hours into LeMans",
        "date" : "06/14/2025",
        "body" : "This year's 24h of Le Mans has been an exciting race as always. The Cadillacs have faltered and lost the lead to the Porsches early on, and the Ferraris pushed through the field to take the top three spots. Through two pit stop cycles, the 1-2-3 has reformed, and I'm rather optimistic at this point. <br><br> Anything can happen in in nineteen hours, but this is looking good.",
        "image" : "https://www.motorsportweek.com/wp-content/uploads/2025/06/DPPIPRODUCTION_00003464_0060-768x512.webp",
        "imagestyle": ""
    },    
    {
        "headline" : "McLaren Unveils 2027 LMDh Challenger",
        "date" : "06/14/2025",
        "body" : "McLaren unveiled their challenger for the 2027 24h of Le Mans this morning. The first thing which struck me was the very flat front, which reminded me of the Tipo 6. Just like the Genesis, there's some Ferrari-like tail action going on. It looks like a Dallara hypercar—nothing super-duper cool, but I'm happy to see it. It'll be great to have another car on track.",
        "image" : "https://cdn-2.motorsport.com/images/amp/2jX4pZE6/s1000/mclaren-hypercar-prototype-2.webp",
        "imagestyle": ""
    },        
    {
        "headline" : "Cadillac Front Row Lock-Out At Le Mans",
        "date" : "06/13/2025",
        "body" : "Cadillac has secured the top two spots today at Le Mans hyperpole. My Dad absolutely lost it and is really hoping this is their year. ",
        "image" : "https://formularapida.net/wp-content/uploads/2025/06/dppiproduction-00003449-0323-684b31a8e4946280955538-scaled.jpg",
        "imagestyle": ""
    },    
    {
        "headline" : "Piastri Strikes Back, Verstappen Strikes Out in Final Race for Catalunya",
        "date" : "06/01/2025",
        "body" : "Oscar Piastri has won his fifth race of the year at Circuit de Barcelona-Catalunya in Spain. After getting pole position by the largest margin of the year thus far, Oscar kept the entire race firmly under control while the rest of the field squabbled behind.<br><br>Max drove a brilliant race with a three-stop strategy, but it all went downhill when he got called in to the pits after Antonelli's Mercedes power unit decided to announce a new Pope. Verstappen had no grip on the Hards, leading to a mistake on the restart and a whole shemozzle thereafter. I believe he was in the right with Russell in the original incident, but the second incident just looked bad from all angles.<br><br>Norris made mistakes, as usual, and that cost him a pole and win. I'm happy to see Oscar's championship lead extended once again. Never in doubt.",
        "image" : "https://cdn-media.theathletic.com/cdn-cgi/image/width=770%2cquality=70%2cformat=auto/https://cdn-media.theathletic.com/PYO8swZ0SGXd_5ZwqunzXgrce_1440x960.jpg",
        "imagestyle": ""
    },
    {
        "headline" : "Porsche Streak Ends In Tragedy in Detroit",
        "date" : "05/31/2025",
        "body" : "Unfortunately, the Penske Porsche and AO Porsche win streaks in the GTP and GTD Pro classes of the IMSA WeatherTech SportsCar Championship came to an end today, with the #93 Meyer Shank Racing Acura taking the win overall. Renger Van Der Zande made it back onto the podium to take second place in the #10 Wayne Taylor Cadillac, and the final step on the podium was taken by the #6 Porsche 963. The #7 Porsche still leads the standings by a huge margin.<br><br>AO Racing had a weekend to forget with a mediocre qualifying and two incidents during the race which saw them getting punted by other cars into the barriers.<br><br>IMSA Resumes after the 24 Hours of LeMans at Watkins Glen, which I'll unfortunately not be able to go to this year due to the tariff situation.",
        "image" : "https://www.imsa.com/wp-content/uploads/sites/32/2025/05/31/IMSA_Detroit25_93QuickWIn_053125.jpg",
        "imagestyle": ""
    },
    {
        "headline" : "Penske/Porsche Sweep Continues in IMSA at Laguna Seca",
        "date" : "05/11/2025",
        "body" : "The #7 Porsche 963's win streak came to an end today, finishing behind its sister car in second place in the Monterey Hills. Still, every IMSA race this season thus far has been won by a team Penske, and the #7's healthy championship lead grows further out of reach of the rest of the field.<br><br>AO Racing's No. 77 Porsche 911 GT3 captured yet another victory in the GTD class, extending a similarly daunting lead. <br><br> Sportscar Endurance Racing is alive and well, and all my favourite teams are winning—the only thing that could make this any better would be for Alonso to get his 33rd...",
        "image" : "https://newsroom.porsche.com/.imaging/mte/porsche-templating-theme/image_1290x726/dam/US-local/2025/5-MAY/Laguna-Photos/20250509_IMSA_Laguna-Seca_Lenssen-Photo_63448_16x9.jpg/jcr:content/20250509_IMSA_Laguna%20Seca_Lenssen%20Photo_63448_16x9.jpg",
        "imagestyle": ""
    },
    {
        "headline" : "Ferrari's WEC Dominance Continues At Spa, Next Stop LeMans",
        "date" : "05/10/2025",
        "body" : "It is with great joy I once again write of Ferrari's dominance in the World Endurance Championship. This weekend at the legendary Spa-Francorchamps circuit in Belgium, the #51 car drove home to victory ahead of its sister car.<br><br>These past three races have been some of Ferrari's most golden moments in racing for a long time. The next stop is LeMans, and while I hope for a third consecutive victory, anything can happen at La Sarthe. Forza Ferrari!!",
        "image" : "https://ferrari-view.thron.com/api/xcontents/resources/delivery/getThumbnail/ferrari/0x0/5c1a7b9b-b00b-4993-aaf7-8a679794dd24.jpg?v=149",
        "imagestyle": ""
    },
    {
        "headline" : "LeMans Legend Jochen Mass Has Passed Away Aged 78",
        "date" : "05/04/2025",
        "body" : "Sadly, Jochen Mass—1989 LeMans winner with Sauber-Mercedes and Formula 1 race winner with McLaren—has passed away today at the age of 78 after suffering complications from a stroke he had earlier this year in February. Mass raced with the great F1 teams of yesteryear such as ATS, Arrows and McLaren-Cosworth back in the 1970s before going on to sportscar racing in the 1980s. I'll always remember him as a factory Porsche driver and one of the great German endurance drivers of the 1980s. <br><br>In endurance racing, he won races with the legendary Porsche 956/962 before moving to Sauber-Mercedes in 1988, winning LeMans overall in 1989 with the C11. He went on to win at Spa with Karl Wendlinger and Mexico with Michael Schumacher before retiring with a whopping 32 world championship victories with Sauber-Mercedes, Porsche and Alfa Romeo—second in wins only to Jacky Icx. ",
        "image" : "https://www.lemans.org/media/cache/api_news_large/assets/fileuploads/57/4f/574f54af6c4fa.jpeg",
        "imagestyle": ""
    },
    {
        "headline" : "Oscar Piastri Extends Title Lead in Miami",
        "date" : "05/04/2025",
        "body" : "My favourite up-and-coming Formula 1 driver has won again this weekend in Miami, making it three straight wins and extending his championship lead over Lando Norris. If it hadn't been for that unfortunately timed safety car during the sprint race, he would've swept the entire weekend. I'm overjoyed to see Piastri back on the top step—it's truly a legend in the making.<br><br>I'm upset with Hamilton becuase of his behaviour this race. I knew this was going to happen—he just can't keep quiet and be a good sport. We all know Ferrari's strategy is bad, but you can't just call them out like that on the radio. He's not a true Ferrari driver who drives for the Scuderia, he only thinks of himself. ",
        "image" : "https://media.formula1.com/image/upload/f_auto,c_limit,w_1440,q_auto/t_16by9North/f_auto/q_auto/fom-website/2025/Miami/GettyImages-2213413247",
        "imagestyle": ""
    },
    {
        "headline" : "My Nikon D40 Has Died",
        "date" : "05/03/2025",
        "body" : "After 18 years of service and 209,365 shutter actuations, my Nikon D40 has taken its last photo. Today, on a rock in the middle of a pond surrounded by dozens of Red-Winged Blackbirds, two European Starlings, five Common Grackles, a happy little duck (Mallard), a Double-Crested Cormorant, two turtles and a beaver, I pressed the shutter button and got 'ERR: Please Press Shutter Again'.<br><br>Over the past seven years since my Dad passed it down to me, I've taken 195,363 photos. While he owned the camera, it saw Kimi Raikonnen win the 2008 Hungarian Grand Prix and travelled all over Europe as he went on business trips.",
        "image" : "/assets/pictures/DSC_0046.webp",
        "imagestyle": ""
    },
    {
        "headline" : "Pink Floyd at Pompeii MCMLXXII Hits Theatres",
        "date" : "04/24/2025",
        "body" : "The 4k IMAX restoration of Pink Floyd's legendary performance in the ruins of Pompeii had the first of its limited screenings in theatres today. It's a spectacular film showing the band at the beginning of their breakthrough era in the early 1970s. Between live performances of tracks off <i>Meddle</i> and <i>A Saucerful of Secrets</i>, there's rather cathartic footage of them in the studio recording <i>The Dark Side of The Moon</i>. Band members reflect on the use of machines and electronics in music and make a great argument against creative AI. In a similarly prophetic clip, they discuss the occasional 'minor' arguments within the band—tensions which almost certainly led to Waters' split towards the end of the eighties. <br><br>This was a most amazing experience and I'm glad I went. The film restoration was just stunning: motion pictures of this quality simply cannot be made anymore.",
        "image" : "/assets/images/newspaper/pompeii.jpg",
        "imagestyle": ""
    },
    {
        "headline" : "Ferrari Take Home Win At Imola",
        "date" : "04/20/2025",
        "body" : "After an enthralling six hours, Alessandro Pier Guidi, James Calado and Antonio Giovinazzi have won from pole position at the 6h of Imola! Spectacular! I've got no words to describe how excited I am about this. <br><br>Everything I love in racing is just coming together right now: the #7 Porsche 963 and #77 AO Racing dominate in IMSA, Oscar Piastri is coming into his own and fighting Max and Lando for the F1 championship, and now Ferrari has won the first two races in WEC! I'm overjoyed! Forza Ferrari!!!",
        "image" : "https://sportscar365.com/wp-content/uploads/2025/04/DPPIPRODUCTION_00003161_0534.jpg",
        "imagestyle": ""
    },  
    {
        "headline" : "Oscar Piastri Leads The Formula 1 Drivers World Championship",
        "date" : "04/20/2025",
        "body" : "After fending off Max Verstappen to win the 2025 Saudi Arabian Grand Prix, Oscar Piastri now leads the driver's world championship. He's the first Australian to do so since his manager Mark Webber led during the 2010 season, which I refuse to believe was now fifteen years ago.<br><br>I've been saying it for years: Piastri is going to be world champion. Could this be his year? It looks like Norris is his own worst enemy: he's struggling under pressure that he's created himself. Piastri is cool as a cucumber",
        "image" : "/assets/images/newspaper/piastripi1.webp",
        "imagestyle": ""
    },    
    {
        "headline" : "Christmas Comes Early: Norris Crashes, Piastri Battles Verstappen For Pole",
        "date" : "04/19/2025",
        "body" : "The neighbourhood knew the exact moment the F1 TV directors cut to Norris after he hit the wall becuase my Dad and I squealed rather loudly at the sight of it. Today's qualifying session saw the McLaren driver continue to struggle while his teammate delivered an astounding performance which rivaled the great Max Verstappen.<br><br>After trading fastest laps separated by the thinnest of margins, Max Verstappen came out on top and will start on pole position for tomorrow's grand prix. ",
        "image" : "/assets/images/newspaper/christmascomesearly.webp",
        "imagestyle": ""
    },
    {
        "headline" : "Ferrari Top Qualifying At 6h of Imola",
        "date" : "04/19/2025",
        "body" : "After an action-packed FP3 and an exciting qualifying, Antonio Giovinazzi has put his #51 Ferrari 499p on pole position at the 6H of Imola, followed closely by AF Corse's private entry driven by Robert Kubica.<br><br>In a six hour race, pole position is nice to have, but ultimately doesn't mean much. I'm glad the Ferrari's are fast this weekend at home in Italy, and it's always wonderful to see Gio putting in a special lap—he's on fire this season!",
        "image" : "https://cdn.crash.net/2025-04/XPB_1339723_HiRes.jpg?width=300",
        "imagestyle": ""
    },    
    {
        "headline" : "Hyundai Unveils Genesis GMR-001 Prototype",
        "date" : "04/16/2025",
        "body" : "Today in New York, Hyundai unveiled their 2027 LMDh challenger which will run under their high-end Genesis brand in WEC and IMSA. The car uses the ORECA chassis and seems to take design cues from both the Genesis brand as well as existing competitors on the field—namely, a Ferrari-style rear wing and Acura/Alpine-style front wing.<br><br>I'm looking forward to seeing this thing on track. The Platinum Era of Sportscar Endurance Racing continues!",
        "image" : "https://www.imsa.com/wp-content/uploads/sites/32/2025/04/16/Genesis-Front-side_04162025-2-2.jpg",
        "imagestyle": ""
    },
    {
        "headline" : "Piastri Wins Again In Bahrain",
        "date" : "04/13/2025",
        "body" : "Oscar Piastri has won the 2025 Bahrain Grand Prix and become the first driver to get multiple pole positions and wins this season so far. With this win, he is currently the only Formula 1 driver to have a 100% pole-to-win conversion rate—a cool stat, but one that can't last forever.<br><br>I've been saying it since he was in Formula 2: this guy is going to be a world champion. It was clear over the past couple seasons that he's been learning a lot every race, and now he's really starting to shine. Piastri WDC 2025!",
        "image" : "/assets/images/newspaper/piastriwin.jpg",
        "imagestyle": ""
    },
    {
        "headline" : "Porsche Continues IMSA Domination At Long Beach",
        "date" : "04/12/2025",
        "body" : "The No. 7 Porsche Penske 963 is three-for-three this weekend after leading a Porsche 1-2 across the line at the Acura Grand Prix of Long Beach. It's quite rare for a team to dominate like this in a sport as competitive and unpredictable as sportscar endurance racing, but Team Penske seems to have it all under control. In the GTD class, AO Racing's No. 77 'Rexy' finished first once again ahead of the No. 12 Vasser Sullivan Lexus. <br><br>I'm overjoyed to see my two favourite cars wining their classes—it looks like this will be not only a championship season, but a record-breaking one. This kind of success is completely unprecedented, especially as the BMW's seem to have gotten their act together. ",
        "image" : "/assets/images/newspaper/porschedomination.webp",
        "imagestyle": ""
    },
    {
        "headline" : "McLaren Announce LMDh Entry",
        "date" : "04/11/2025",
        "body" : "Thirty years after McLaren won LeMans with the F1 GTR, they've announced their intention to return to the World Endurance Championship and IMSA at the top class in 2027. We saw it coming, especially after IMSA president John Doonan said to 'expect announcements from the blue oval and the papaya people' during an interview at the 24h of Daytona.<br><br>The platinum era of sportscar endurance race is just getting better and better, with McLaren joining Ford and Genesis as the next contenders to line up on the grid after Aston Martin and their Valkyrie. The teaser renders for this car look a lot like the Cadillac V-Series R, and that's becuase it'll be using the same Dallara chassis along with Antura's Twin-Turbo V6. I'm extraordinarily excited for what's to come. Sportscar Endurance Racing is the best form of racing, hands down, and it's only getting better.",
        "image" : "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/1998_Goodwood_Festival_of_Speed_%2815781190981%29.jpg/1920px-1998_Goodwood_Festival_of_Speed_%2815781190981%29.jpg",
        "imagestyle": ""
    },
    {
        "headline" : "Max Verstappen Takes Pole & Race Win In Japan, Sets Lap Record",
        "date" : "04/06/2025",
        "body" : "After a magnificent pole lap which saw Max Verstappen take the overall lap record at Suzuka from Sebastian Vettel, he has won Sunday's Japanese Grand Prix. His Q3 lap is being hailed as the best of his career, with Fernando Alonso piling on the praise for Max's performance in an underwhelming car. Max was somehow faster than Lando Norris for the whole race, and after McLaren refused to let Piastri through, he crossed the line in first place. This was Max Verstappen's sixty-forth win and the first this season.<br><br>Personally, I think this was the third consecutive race where Oscar outpaced Lando. They didn't let him past in Australia, and they didn't let him past this year either. It just doesn't make sense! I'm also very happy that its Max who is toppling Vettel's records; I'm sentimental about that era of Red Bull and Formula 1, and I wouldn't want any driver to replace Vettel in the history books. ",
        "image" : "https://media.formula1.com/image/upload/f_auto,c_limit,w_960,q_auto/t_16by9Centre/f_auto/q_auto/fom-website/2025/Japan/GettyImages-2208605783",
        "imagestyle": ""
    },
    {
        "headline" : "Oscar Piastri Wins Chinese Grand Prix",
        "date" : "03/23/2025",
        "body" : "Oscar Piastri crossed the line ahead of McLaren teammate Lando Norris and Mercedes driver George Russell today in a statement drive at the Shanghai International Circuit. After McLaren wouldn't let him pass Lando last week and wet weather sent him spinning into the grass, Oscar has rebounded and led the team this weekend while Lando complained about this and that behind.<br><br>I was overjoyed to see the way he handled the race. George Russell has been very consistent, so that's great for him. LeClerc did an outstanding drive with a broken front wing, though I suspect a broken front wing endplate isn't always a bad thing from the amount of times I've seen this happen. Stroll surprised me more than he ever has—a great drive from him, and a great drive from Bearman as well. ",
        "image" : "https://media.formula1.com/image/upload/f_auto,c_limit,w_960,q_auto/t_16by9North/f_auto/q_auto/trackside-images/2025/F1_Grand_Prix_Of_China/2206477882",
        "imagestyle": ""
    },
    {
        "headline" : "Oscar Piastri Takes Pole In China, Sets Lap Record",
        "date" : "03/22/2025",
        "body" : "Earlier today in China, McLaren driver Oscar Piastri took pole position with a 1:30.641: a new lap record for the storied Shanghai International Circuit. Piastri is my favourite up and coming driver, and when Alonso retires, he's who I'll be rooting for.<br><br>It's great to see Piastri on top. I'm not a fan of Norris—I never have been—but right from the get-go in his F3 days, Piastri seemed like a guy I could get behind. This season, I hope to see Piastri vs Verstappen vs LeClerc for the title, the latter of which unfortunately doesn't seem all that realistic at the moment.",
        "image" : "https://images.ps-aws.com/c?url=https%3A%2F%2Fd3cm515ijfiu6w.cloudfront.net%2Fwp-content%2Fuploads%2F2025%2F03%2F22115914%2Foscar-piastri-sprint-pole-celebration-planetf1-1320x742.jpg",
        "imagestyle": ""
    },
    {
        "headline" : "F1 Legend Eddie Jordan Dies Aged 76",
        "date" : "03/20/2025",
        "body" : "Eddie Jordan, one of the big personalities of Formula 1, has died today. It's very sad to see one of the F1 greats going, especially Eddie Jordan. It feels so weird knowing that he's gone becuase he was so full of life; he's not what you'd picture when you think of a man in the latter half of his seventies. I knew he didn't have long left after announcing he had cancer on his podcast with David Coulthard, <a href=\"https://www.youtube.com/watch?v=kRycYrioAU0\"><i>Formula For Success</i></a>, but I was still surprised nonetheless.<br><br>The Jordan F1 team was awesome. When I think of a Formula 1 car, the Ferrari F2000 pops into my head along with the \"Buzzin' Hornets\" EJ10. It's great that he was so involved in the sport after he retired from racing and later on from team ownership.<br><br>Today, it was Jordan. Tomorrow, it might be Ecclestone, Stewart, Prost or Ickx.",
        "image" : "https://www.turkgun.com/cropImages/1280x/uploads/haberler/2025/3/6659-formula-1in-efsane-isimlerinden-eddie-jordan-hayatini-kaybetti.jpg",
        "imagestyle": ""
    },
    {
        "headline" : "Nasr Leads Porsche 1–2 At 2025 Sebring 12h",
        "date" : "03/15/2025",
        "body" : "The #7 Porsche Penske 963 is two-for two in the 2025 IMSA WeatherTech Sportscar Championship after winning today at the Mobil 1 Twelve Hours of Sebring. I'm overjoyed to see my favourite car win again and for Porsche to be running so strong here in North America.<br><br>My favourite GTD Pro car—the #77 AO Racing Porsche 911 known affectionately as <i>Rexy</i>—crossed the line first in its class. I'm overjoyed to see that team doing well, too. They're so young, yet they've found so much success in their two years; I'm hoping this is the beginning of another championship charge for both teams.",
        "image" : "https://sportscar365.com/wp-content/uploads/2025/03/levitt-SEB-250315-PA-0275.jpg",
        "imagestyle": ""
    },
    {
        "headline" : "michaelscybersite.net is now live!",
        "date" : "03/09/2025",
        "body" : "This website is now live at the new domain, <i>michaelscybersite.net</i>! How cool does that sound? A <i>dot net</i> site...look at me now Mom!<br><br>Although this site has been on the internet in some form or another since September of 2024, it's been hosted at the default GitHub pages URL. It's a minor change, I suppose, but it makes things feel a lot more official. I've changed the site logo to reflect this new domain as well.<br><br>Since a web domain is a nonphysical, abstract concept, here's a photo of my cat.",
        "image" : "/assets/pictures/DSC_192669.webp",
        "imagestyle": ""
    },
    {
        "headline" : "Microsoft Publisher to be Discontined in 2026",
        "date" : "03/01/2025",
        "body" : "Microsoft has announced to Office 365 subscribers yesterday that Publisher will no longer be supported after October of 2026. While not many people (if any) really use Publisher anymore, I'm finding myself a little misty-eyed at the announcement. <br><br>When I was a kid, I played around with Publisher 2003 and made my own websites. You could say that it's only becuase of Publisher that this site exists right now, since that program was (oddly) my entry into web development. <br><br>You never really did live up to your potential, did you Publisher? But hey, fulfillment of potential is just an achievement in societal perception, and it's got nothing to do with personal fulfillment. <i>RIP Publisher (1991-2026)—you'll be remembered, occasionally!</i>",
        "image" : "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Microsoft_Office_Publisher_%282019-present%29.svg/268px-Microsoft_Office_Publisher_%282019-present%29.svg.png",
        "imagestyle": "width: 70%"
    },
    {
        "headline" : "Ferrari Finish 1-2-3 in Qatar",
        "date" : "02/28/2025",
        "body" : "At the 1812km of Qatar, Ferrari made history by sweeping the podium with their 499p hypercars. Antonio Fuoco in the #50 car was followed across the line by Robert Kubica in the privateer #83 and Alessandro Pier Guidi in the #51.<br><br>This was such a special thing to watch, and I'm so excited for the rest of the World Endurance Championship season. This is truly a platinum era for sportscar racing, and sportscar racing is truly the pinnacle of motorsport. Forza Ferrari!",
        "image" : "https://cdn.ferrari.com/cms/network/media/img/resize/67c24833c77e3b005697343f-2025-qatar-lmh-race-news-l",
        "imagestyle": ""
    }
]