[
    {
        "headline" : "Oscar Piastri Takes Pole In China, Sets Lap Record",
        "date" : "03/22/2025",
        "body" : "Earlier today in China, McLaren driver Oscar Piastri took pole position with a 1:30.641: a new lap record for the storied Shanghai International Circuit. Piastri is my favourite up and coming driver, and when Alonso retires, he's who I'll be rooting for.<br><br>It's great to see Piastri on top. I'm not a fan of Norris—I never have been—but right from the get-go in his F3 days, Piastri seemed like a guy I could get behind. This season, I hope to see Piastri vs Verstappen vs LeClerc for the title, the latter of which unfortunately doesn't seem all that realistic at the moment.",
        "image" : "https://images.ps-aws.com/c?url=https%3A%2F%2Fd3cm515ijfiu6w.cloudfront.net%2Fwp-content%2Fuploads%2F2025%2F03%2F22115914%2Foscar-piastri-sprint-pole-celebration-planetf1-1320x742.jpg",
        "imagestyle": ""
    },
    {
        "headline" : "F1 Legend Eddie Jordan Dies Aged 76",
        "date" : "03/20/2025",
        "body" : "Eddie Jordan, one of the big personalities of Formula 1, has died today. It's very sad to see one of the F1 greats going, especially Eddie Jordan. It feels so weird knowing that he's gone becuase he was so full of life; he's not what you'd picture when you think of a man in the latter half of his seventies. I knew he didn't have long left after announcing he had cancer on his podcast with David Coulthard, <a href=\"https://www.youtube.com/watch?v=kRycYrioAU0\"><i>Formula For Success</i></a>, but I was still surprised nonetheless.<br><br>The Jordan F1 team was awesome. When I think of a Formula 1 car, the Ferrari F2000 pops into my head along with the \"Buzzin' Hornets\" EJ10. It's great that he was so involved in the sport after he retired from racing and later on from team ownership.<br><br>Today, it was Jordan. Tomorrow, it might be Ecclestone, Stewart, Prost or Ickx.",
        "image" : "https://www.turkgun.com/cropImages/1280x/uploads/haberler/2025/3/6659-formula-1in-efsane-isimlerinden-eddie-jordan-hayatini-kaybetti.jpg",
        "imagestyle": ""
    },
    {
        "headline" : "Nasr Leads Porsche 1–2 At 2025 Sebring 12h",
        "date" : "03/15/2025",
        "body" : "The #7 Porsche Penske 963 is two-for two in the 2025 IMSA WeatherTech Sportscar Championship after winning today at the Mobil 1 Twelve Hours of Sebring. I'm overjoyed to see my favourite car win again and for Porsche to be running so strong here in North America.<br><br>My favourite GTD Pro car—the #77 AO Racing Porsche 911 known affectionately as <i>Rexy</i>—crossed the line first in it's class. I'm overjoyed to see that team doing well, too. They're so young, yet they've found so much success in their two years; I'm hoping this is the beginning of another championship charge for both teams.",
        "image" : "https://sportscar365.com/wp-content/uploads/2025/03/levitt-SEB-250315-PA-0275.jpg",
        "imagestyle": ""
    },
    {
        "headline" : "michaelscybersite.net is now live!",
        "date" : "03/09/2025",
        "body" : "This website is now live at the new domain, <i>michaelscybersite.net</i>! How cool does that sound? A <i>dot net</i> site...look at me now Mom!<br><br>Although this site has been on the internet in some form or another since September of 2024, it's been hosted at the default GitHub pages URL. It's a minor change, I suppose, but it makes things feel a lot more official. I've changed the site logo to reflect this new domain as well.<br><br>Since a web domain is a nonphysical, abstract concept, here's a photo of my cat.",
        "image" : "/assets/pictures/DSC_192669.webp",
        "imagestyle": ""
    },
    {
        "headline" : "Microsoft Publisher to be Discontined in 2026",
        "date" : "03/01/2025",
        "body" : "Microsoft has announced to Office 365 subscribers yesterday that Publisher will no longer be supported after October of 2026. While not many people (if any) really use Publisher anymore, I'm finding myself a little misty-eyed at the announcement. <br><br>When I was a kid, I played around with Publisher 2003 and made my own websites. You could say that it's only becuase of Publisher that this site exists right now, since that program was (oddly) my entry into web development. <br><br>You never really did live up to your potential, did you Publisher? But hey, fulfillment of potential is just an achievement in societal perception, and it's got nothing to do with personal fulfillment. <i>RIP Publisher (1991-2026)—you'll be remembered, occasionally!",
        "image" : "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Microsoft_Office_Publisher_%282019-present%29.svg/268px-Microsoft_Office_Publisher_%282019-present%29.svg.png",
        "imagestyle": "width: 70%"
    },
    {
        "headline" : "Ferrari Finish 1-2-3 in Qatar",
        "date" : "02/28/2025",
        "body" : "At the 1812km of Qatar, Ferrari made history by sweeping the podium with their 499p hypercars. Antonio Fuoco in the #50 car was followed across the line by Robert Kubica in the privateer #83 and Alessandro Pier Guidi in the #51.<br><br>This was such a special thing to watch, and I'm so excited for the rest of the World Endurance Championship season. This is truly a platinum era for sportscar racing, and sportscar racing is truly the pinnacle of motorsport. Forza Ferrari!",
        "image" : "https://cdn.ferrari.com/cms/network/media/img/resize/67c24833c77e3b005697343f-2025-qatar-lmh-race-news-l",
        "imagestyle": ""
    }
]