{
    "messages": [
      "Does anyone read the fine print?",
      "Jesus Returns; Green Day Named 'God's Favourite Band'",
      "The Mandela Effect Is Real: Nelson Mandela Reported Dead For Third Time",
      "\"I'm funny! I told you so!\": Clown Convicted of Third Degree Murder's Last Words After Sentence",
      "Kitty Kibble shortage in SimCity",
      "Water shortage reported",
      "Pizza In 3 Hours: A sign of bad traffic",
      "Llama Pox breaks out",
      "Boy Saves Cat From Tree, Thousands Cheer",
      "Bus Misses Turn, Dozens Late For Work",
      "Internet Disruption Blamed For Rising Birthrates",
      "Ancient Meteorite Revealed To Be Burnt Burger",
      "Doughnuts: Is There Anything They Can't Do?",
      "Giant Hairball Has Perfect Grammar, Linguists Say",
      "\"Now I got a reason\" Says Man Going On Holiday In The Sun",
      "Man Survives Wintry Night Adhered To Bus Bench By Chewing Gum",
      "Pistol Packing Punks Pilfer Precious Petunias",
      "Pigeon Alert! Extreme Pigeon Danger!",
      "Spotted Owl Spotted",
      "Tainted Broccoli Weapon Of Choice For Global Assassins",
      "Traveling Truck Technician Talks Transmissions Tuesday",
      "Tree Stuck In Cat; Firefighters Baffled",
      "UFO Seen And Disavowed",
      "Weather Likely To Become Different Before Changing",
      "Caesar demands wine!",
      "Birds flock to city parks",
      "Cold snap linked to low temperatures",
      "Shark fisherman and boat eaten: Shark still at large",
      "Local doctor discovers cure for fear of snakes: \"Don’t go near snakes\"",
      "Chess prodigy defeated by kangaroo",
      "Moon rocks shown to originate from lunar regions",
      "Signs of water discovered on distant planets: Beachfront property available soon",
      "Celebrity embarrasses self, nation with overseas antics",
      "Social networking websites blamed for worldwide decrease in social networking",
      "Sunrise expected to bring light, warmth to world",
      "Citizens decry obscene constellation - stars to realign",
      "Police seeking three-armed burglar: No description available",
      "Rumor Of Kitty Kibble Shortage Causes Futures To Drop; Consumers Stockpile",
      "Meddling kids avert villainous plot",
      "Details of conspiracy remain shrouded in mystery",
      "Experts predict future to hold technological breakthroughs",
      "Local Merchants Puzzled By Rumors Of Kitty Kibble Shortage; \"We Have Plenty,\" Say Most",
      "Kitties Concerned By Rumors Of Kitty Kibble Shortage; Owners In Panic",
      "No Kitty Kibble Shortage Says Local Representative Of Kitty Kibble Association",
      "Is Kitty Kibble Shortage Real? Authorities Say Rumors Unfounded",
      "Kitties Want Answers In Possible Kitty Kibble Shortage",
      "No Kitty Kibble Shortage, Officials Insist; Kitties Skeptical",
      "Experts Advise Using Sunblock As Sunny Weather Continue"
    ]
  }