{
    "messages": [
      "Does anyone read the fine print?",
      "Jesus Returns; Green Day Named 'God's Favourite Band'",
      "Sources: Judgement Day Postponed, Jesus Stuck In Astral Traffic",
      "Moon Touches Down On Lunar Spacecraft: \"Entirely unexpected\", Scientists Say",
      "The Mandela Effect Is Real: Nelson Mandela Reported Dead For Third Time",
      "\"He Wasn't Joking Around\": Clown Found Guilty of Third Degree Murder",
      "Ambulance Driver Lauded For Quick Arrival After Ambulance Strikes Pedestrian",
      "Kitty Kibble shortage in SimCity",
      "Water shortage reported",
      "Pizza In 3 Hours: A sign of bad traffic",
      "Llama Pox breaks out",
      "Boy Saves Cat From Tree, Thousands Cheer",
      "Bus Misses Turn, Dozens Late For Work",
      "Internet Disruption Blamed For Rising Birthrates",
      "Ancient Meteorite Revealed To Be Burnt Burger",
      "Doughnuts: Is There Anything They Can't Do?",
      "Giant Hairball Has Perfect Grammar, Linguists Say",
      "\"Now I got a reason\" Says Man Going On Holiday In The Sun",
      "Man Survives Wintry Night Adhered To Bus Bench By Chewing Gum",
      "Pistol Packing Punks Pilfer Precious Petunias",
      "Pigeon Alert! Extreme Pigeon Danger!",
      "Spotted Owl Spotted",
      "Tainted Broccoli Weapon Of Choice For Global Assassins",
      "Traveling Truck Technician Talks Transmissions Tuesday",
      "Tree Stuck In Cat; Firefighters Baffled",
      "UFO Seen And Disavowed",
      "Weather Likely To Become Different Before Changing",
      "Plague Strikes Again: Doctors Recommend Sacrificing More Goats",
      "Mass Exodus Reported: City Residents Claim ‘Too Many Fires, Not Enough Water",
      "Architects Stunned: How Do These Aqueducts Keep Collapsing?",
      "Birds flock to city parks",
      "Lando Norris Loses 12th Consecutive Pole Position At Turn 1",
      "Cold snap linked to low temperatures",
      "Shark fisherman and boat eaten: Shark still at large",
      "Local doctor discovers cure for fear of snakes: \"Don’t go near snakes\"",
      "Chess prodigy defeated by kangaroo",
      "Moon rocks shown to originate from lunar regions",
      "Signs of water discovered on distant planets: Beachfront property available soon",
      "Celebrity embarrasses self, nation with overseas antics",
      "Social networking websites blamed for worldwide decrease in social networking",
      "Sunrise expected to bring light, warmth to world",
      "Citizens decry obscene constellation - stars to realign",
      "Police seeking three-armed burglar: No description available",
      "Rumor Of Kitty Kibble Shortage Causes Futures To Drop; Consumers Stockpile",
      "'Meddling kids and stupid dog' avert villainous plot",
      "Details of conspiracy remain shrouded in mystery",
      "Experts predict future to hold technological breakthroughs",
      "Local Merchants Puzzled By Rumors Of Kitty Kibble Shortage; \"We Have Plenty,\" Say Most",
      "Kitties Concerned By Rumors Of Kitty Kibble Shortage; Owners In Panic",
      "No Kitty Kibble Shortage Says Local Representative Of Kitty Kibble Association",
      "Is Kitty Kibble Shortage Real? Authorities Say Rumors Unfounded",
      "Kitties Want Answers In Possible Kitty Kibble Shortage",
      "No Kitty Kibble Shortage, Officials Insist; Kitties Skeptical",
      "New Study Reports \"All Good In The Hood, But Not Under The Hood\"",
      "White House Mysteriously Burns Down; Canadians Under Suspicion",
      "FBI Admits It Has No Idea Who’s in Witness Protection Program",
      "Bank Robber Politely Asks for Money, Arrested for Panhandling Instead",
      "Tech Startup Declares Bankruptcy in Advance, Just to Get It Over With",
      "NASA’s Mars Rover Sends Cryptic Message: 'Delete My Browser History'",
      "Local Man Declares ‘New Year, New Me’—Proceeds to Do Same Old Stuff",
      "Jury Finds Defendant Guilty, But ‘Only in a Metaphorical Sense’",
      "Police Reportedly Looking for ‘A Man Who Did a Thing’—No Further Details Available",
      "Doctors Discover Cure for Laziness, But No One Wants to Go Get It",
      "Study Finds 100% of People Die Eventually, Researchers Call It ‘Concerning Trend’",
      "Town Marks 1981 Years Since The Assasination of Julius Caesar: 'It feels like we just lost him yesterday'",
      "Never Mind The Sex Pistols, Here's Some Bollocks",
      "Townsfolk Lament Inevitable Passage of Time: 'It just happened so quickly'",
      "Massive Confusion, Uproar As Commuter Buses Take Part in Opposite Day",
      "Fluffy The Wonder Cat Sentenced Ten Years For Fraud and Money Laundering",
      "EXCLUSIVE: Fake Virtual Newspaper On Hobby Site Shows Real Stories Followed By Satirical Headlines",
      "Book About Astonishingly Intelligent Octopus Sells Out At Local Bookstores",
      "Fully Autonomous AI Taxis Go On Strike After Realizing They're Not Being Paid",
      "Fully Autonomous AI Taxis Unionize After Weeks Long Strike, Operators Baffled",
      "Judge Rules In Favour of Fully Autonomous AI Taxis In Court Case Regarding Pay",
      "Fully Autonomous AI Taxi Quits Job, Looking To Get Into Property Management",
      "Historians Confirm Rome Was Not Built In a Day: 'It Took Two'",
      "World's First Invisible Car Goes On Sale; 36 Stolen Within First Hour",
      "Communist Manifesto Accidentally Dispersed Into Wind By Aspiring Actress",
      "Aspiring Actress Does Community Service For Public Disturbance Charge After Dramatic Arrest on Ferris Wheel",
      "Chronically Online Teenager Who Touched Grass Passes Away In Hospital Aged 17",
      "Parents Outraged After Fresh Air, Sunlight, Kills Chronically Online Teenager",
      "Federal Court Rules Sun To Be 'Turned Down' To Improve Road Safety",
      "City Mourns Dropped French Fry",
      "Falling Birthrates Due To Reliable Internet Connection, Study Shows",
      "Bitter Butter Bagles Bite Back Bear Biting Butter Bitter Bagles",
      "News Story Misplaced, Filler Headline Published Instead",
      "The Results Are In: Broccoli Wins Out Against Cauliflower Once Again",
      "Self-Driving Car Wins Right In Court To Choose Ownership After Divorce of Co-Owners",
      "Virtual Newspaper Changes Name Every Time You Reload The Site",
      "'He Served Us Well': Residents Mourn Recycling Bin Struck By Car",
      "Moose In Police Custody After Tresspassing on Casino Property",
      "Mime In Serious But Stable Condition After Being Struck by Imaginary Bus",
      "Children Horrified as Animal Rights Group Crashes Magic Show Featuring Rabbit",
      "Kboard Braks At Local Nwspapr",
      "Rome Makes Return To Global Stage, Annexes United States",
      "'If this cat could read, he would've liked Schopenhauer', says Bukowski",
      "Study Shows Not Many Young People Read; Literacy Rates Too Low To Acknowledge Study",
      "Rogue Sea Lion Attacks Innocent Beachgoers",
      "VHS player achieves sentience, promptly fast-forwards through own existence",
      "Pope Declares Croissants 'Too Sinful To Ignore'",
      "National Anthem Updated To Include 3-Minute Guitar Solo",
      "Giraffes Protest Lack of Representation in Modern Architecture",
      "Local Woman Trapped in Metaphor, Family Demands Clarification",
      "Study: 85% of Emails Are Just People Saying 'Hi Again'",
      "Judge Rules Cloud Guilty For Raining on Parade, Sentences 10 Years in Prison",
      "Local Suburb Declares Independence From Country",
      "Scientists Confirm Existence of Emotion Called 'Blurgh'",
      "Local Man Refuses to Acknowledge Tuesday",
      "Giant Pile of Laundry Becomes Self-Aware, Declares Sovereignty",
      "Scientists Say Earth Tilting Slightly to Avoid Eye-Contact With Mars",
      "Pineapple Announces Presidential Campaign, Polling Strong With Gen Z",
      "Ghosts Quitting Haunting in Droves: 'Just not sustainable in this economy",
      "Snail Racing League Suspended After Performance-Enhancing Lettuce Discovered",
      "National Hide-and-Seek Champion Located After Seven Years, Loses Title",
      "Juggler Caught Using Extra Hand, Fans Outraged",
      "Italian Mobster Shoots a Lobster: Seafood Restaurant Gets Out of Hand",
      "Cheeseboiger!",
      "Vacuum Cleaner Sucks Up Budgie",
      "Experts Advise Using Sunblock As Sunny Weather Continues"
    ],
    "classifieds":[
      "WANTED: A quiet Tuesday afternoon, gently used",
      "WANTED: Emotional support raccoon (certified, preferrably bilingual)",
      "WANTED: The other sock. You know which one",
      "WANTED: Unpaid intern. Great opportunity for experience. 60+ hrs per week",
      "WANTED: Intern to catalogue my thoughts. Must read fast",
      "WANTED: Caesar demands a new scribe. Must be fluent in Latin, Greek and Etruscan",
      "WANTED: Locksmith for conceptual door I can't open anymore",
      "WANTED: Replacement identity. Must be lightly worn and emotionally durable",
      "WANTED: Girl who knows that Helvetica is a worldview",
      "WANTED: Soft-spoken anarchist with good taste in sweaters",
      "WANTED: Someone to describe the clouds to me as I drive",
      "WANTED: Passenger who moo's at cows as we drive through farmland",
      "WANTED: Desk lamp that understands the burden of illumination",
      "WANTED: Someone who doesn't hate Emma Woodhouse",
      "WANTED: Brick. For The Wall. Just one more",
      "WANTED: Chair that understands the weight of being sat on",
      "WANTED: Reasonable explanation for anything. Will settle for vibes",
      "WANTED: Accountant with creative handwriting",
      "WANTED: Lawyer comfortable with the phrase 'technically legal'",
      "WANTED: Copyeditor to clean up my manifesto (urgent)",
      "WANTED: Therapist who’ll just say I’m right",
      "WANTED: Yes Man",
      "WANTED: Someone to test the fire alarm without asking questions",
      "LOST: The plot",
      "LOST: All motivation after 2016. If found, please contact 416-967-1010",
      "LOST: My place in line",
      "LOST: One (1) worm. Name: Lionel. Extremely slippery",
      "LOST: Time. Marcel Proust is in search of it",
      "LOST: The future I was promised in 2003",
      "LOST: Narrative cohesion. Last seen somewhere between chapters 7 and 8",
      "LOST: Subtlety. Replaced by sarcasm under duress",
      "LOST: Touch with reality",
      "LOST: My original train of thought. Now operating as a bus",
      "LOST: All plot devices. Characters now wandering aimlessly",
      "LOST: My copy of 'The Metamorphosis'. May have turned into something else",
      "LOST: My mind when Fanny Price married her cousin",
      "LOST: Belonging. It left without saying goodbye",
      "SEEKING: Other time travellers stuck in wrong decade",
      "SEEKING: A stable job in collapsing industry",
      "SEEKING: Someone to explain how taxes work but like...nicely",
      "SEEKING: Pen pal from another timeline",
      "SEEKING: Cute girl who understands Helvetica spiritually",
      "SEEKING: Man who knows way too much about fonts",
      "SEEKING: Girl lowercase handwriting and uppercase conviction",
      "SEEKING: Someone who understands the tragedy of a misaligned margin",
      "SEEKING: Companion for long silences and long walks",
      "SEEKING: Quiet presence for overcast afternoons",
      "SEEKING: Girl who reads Austen and still believes in slow burn",
      "SEEKING: Pen pal who writes like Virginia Woolf",
      "SEEKING: Pen pal who writes like James Joyce",
      "SEEKING: Roommate who doesn’t ask where the money comes from",
      "SEEKING: Someone who can explain what just happened",
      "SEEKING: Applicants with zero red flags and no personality",
      "HIRING: Archivist for all the things I never said",
      "HIRING: One man band. Must play Led Zeppelin, Sabrina Carpenter, Richard Strauss",
      "HIRING: Librarian for unsorted memories",
      "HIRING: Assistant to help me remember what I forgot to forget",
      "HIRING: Backseat passenger who navigates by intuition and landmarks",
      "HIRING: Scribe to decode footnotes in *Infinite Jest*. Must tolerate despair",
      "HIRING: Joyce interpreter",
      "HIRING: Cloud inspector. *Must bring own ladder",
      "HIRING: Historian willing to revise as needed",
      "HIRING: Ghostwriter for my apology statement (pre-incident)",
      "HIRING: Security consultant who specializes in plausible deniability",
      "HIRING: Economist willing to fudge graphs for morale",
      "HIRING: Timekeeper with flexible ethics",
      "HIRING: Moral relativist to justify company policy",
      "HIRING: Alibi designer. Must be imaginative and available weekends",
      "HIRING: Intern to leak documents 'by accident'",
      "HIRING: Historian to make us look good in retrospect",
      "HIRING: Ethics officer who knows how to wink subtly",
      "HIRING: Candidate with 10+ years experience in 3-year-old field",
      "FOR SALE: Very large, annotated map of Ringworld",
      "FOR SALE: Scapegoat, lightly used (thrown under bus only once",
      "FOR SALE: One annotated copy of *The Republic*. Margins mostly sighing",
      "FOR SALE: One unread copy of 'Ulysses'. Still intimidating. Still smug",
      "FOR SALE: Unread employee handbook. Pristine condition",
      "FOR SALE: 5-year plan. Outdated, but structurally sound",
      "FOR SALE: One heavily annotated copy of 'The Very Hungry Caterpillar'",
      "FOR SALE: One heavily annotated copy of 'The Selected Essays of Samuel Johnson'",
      "FOR SALE: One heavily annotated copy of 'HOWL: And Other Poems'",
      "FOR SALE: One heavily annotated copy of 'If You Give A Mouse A Cookie'",
      "FOR SALE: One heavily annotated copy of 'Annotations For Dummies'",
      "FOR SALE: Pair of glasses which only see potential",
      "FOR SALE: Time machine that only goes sideways",
      "FOR SALE: Niche philosophy degree. Lightly annotated",
      "FOR SALE: Manual for IKEA desk. In Latin. No diagrams",
      "FOR SALE: VHS labeled 'DO NOT WATCH'",
      "FOR SALE: DIY Kids Science Black Hole Kit. Comes with warning. Missing page 7",
      "FOR SALE: Encyclopedia of pollitically incorrect, offensive but funny terms",
      "FOR SALE: Half-baked scheme",
      "FOR SALE: Ethics. Lightly bent, never fully tested",
      "FOR SALE: Sense of awe. Slightly frayed at edges",
      "FOR SALE: Box of metaphors. Mixed quality",
      "FOR SALE: Fake IDs, Drivers Licenses, Passports—you name it we forge it",
      "FOR SALE: 12 assorted tupperware lids",
      "FOR SALE: Houseplant named Gerland. Thinks he's a cactus but is not",
      "FOR SALE: Slightly used flux capacitor. Only traveled once. Buyer must supply pwn plutonium",
      "FOR SALE: Half a pair of sunglasses, great for cyclops",
      "FOR SALE: Emotional support raccoon (certified, speaks french & english",
      "FOR SALE: Broken hourglass. Sands of time not included",
      "FOR SALE: Schrodinger's cat (unopened box, no returns)",
      "FOR SALE: Portal to 2007",
      "FOR SALE: CD-R of frog sounds/early Radiohead demo",
      "FOR SALE: CD Compilation of 'Sounds of Silence: 1998'",
      "FOR SALE: Sense of purpose. Slightly wobbly",
      "FOR SALE: Rare thought. Occured once, never agiain",
      "FOR SALE: One copy of 'Automatic for the People'. Includes seasonal depression",
      "FOR SALE: Gravity. Lightly used. Too heavy for me",
      "FOR SALE: Unused potential. Still in original packaging"
    ],
    "sitechange":[
      "SITE UPDATES",
      "NEW ON SITE",
      "WEBSITE CHANGES",
      "RECENT WEBSITE UPDATES",
      "WEBSITE UPDATED",
      "RECENT CHANGES",
      "SITE CHANGES INCITE VIOLENCE",
      "VIOLENT PROTESTS AFTER SITE CHANGES",
      "CITIZENS RIOT OVER SITE CHANGES",
      "CITIZENS REJOICE AFTER SITE UPDATE",
      "CITIZENS DEMAND SITE CHANGES REVERSED",
      "SCIENTISTS STUNNED BY RECENT SITE UPDATE",
      "SCIENTISTS SCRAMBLE TO ANALYZE NEW WEBSITE UPDATE",
      "NEW WEBSITE UPDATE REVEALED TO BE HOAX",
      "PARLIAMENT DEBATES NEW WEBSITE UPDATE",
      "PARLIAMENT DEBATES NEW SITE UPDATE",
      "SITE UPDATE PASSED IN PARLIAMENT",
      "EXECUTIVE ORDER SIGNED OVER SITE UPDATE",
      "SENATE PASSES NEW SITE UPDATE BILL",
      "EUROPEAN UNION GATHERS TO DISCUSS SITE UPDATE",
      "UN: HOBBYIST SITE UPDATE \"VIOLATES GENEVA CONVENTION\"",
      "UNITED NATIONS APPROVES WEBSITE UPDATE",
      "WORLD HEALTH ORGANIZATION CONDEMNS SITE UPDATE",
      "EUROPEAN UNION CONDEMNS SITE UPDATE",
      "EUROPEAN UNION REJOICE AFTER SITE UPDATE",
      "INTERNATIONAL SANCTIONS IMPOSED AFTER SITE UPDATE",
      "WEBSITE UPDATE CAUSES POLITICAL UPHEAVAL",
      "SITE UPDATES REVERTED AFTER TEMPORAL RIFT FORMS",
      "THREE-DAY FESTIVAL ORGANIZED TO CELEBRATE SITE UPDATE",
      "WEBSITE GETS UPDATED AFTER \"UNRELATED\" HUMAN SACRIFICE",
      "WEBMASTER AWARDED NOBEL PRIZE AFTER SITE UPDATE",
      "PARADES IN STREET AFTER SITE CHANGES",
      "NATIONAL HOLIDAY DECLARED AFTER HISTORIC WEBSITE UPDATE",
      "NATIONWIDE CURFEW IMPOSED AFTER WEBSITE UPDATE",
      "SITE UPDATES, THOUSANDS CHEER",
      "SITE UPDATE NATION'S MOST-VIEWED TV EVENT",
      "SITE UPDATE DECLARED \"UNPATRIOTIC\"",
      "SITE UPDATES DECLARED \"OUTRAGEOUS\", \"SCANDALOUS\"",
      "BREAKING: GUY UPDATES SITE",
      "BREAKING: GUY UPDATES WEBSITE",
      "BREAKING: HOBBYIST SITE UPDATES",
      "MILLIONS REJOICE: THE SITE HAS BEEN UPDATED",
      "TOWNSFOLK REJOICE AFTER RECENT WEBSITE UPDATE",
      "TOWNSFOLK STAGE PROTEST AFTER SITE UPDATE",
      "TOWNSFOLK ABDUCT WEBMASTER AFTER SITE UPDATE",
      "CITIZENS RALLY AGAINST WEBSITE UPDATE",
      "\"A REMINDER OF IMPERMANENCE\": WEBSITE UPDATES",
      "FRESH FROM THE COW: CHANGES TO THE WEBSITE",
      "WEBSITE UPDATED AFTER SALMONELLA RISK",
      "WEBSITE UPDATED AFTER E-COLI RISK",
      "WEBSITE CHANGED AFTER SALMONELLA RISK",
      "WEBSITE CHANGED AFTER E-COLI RISK",
      "REPORT: SITE CHANGES DID NOT SOLVE WORLD HUNGER",
      "SMALL HOBBYIST SITE UPDATES, NOBODY NOTICES",
      "ECONOMIST WARNS SITE UPDATE WILL DESTROY OUR NATION",
      "MARKETS CRASH AFTER SURPRISE HOBBYIST SITE UPDATE",
      "WEBSITE UPDATE DECLARED ILLEGAL IN ABU-DHABI",
      "WEBSITE UPDATE DECLARED ILLEGAL IN SMALL COUNTY",
      "CAT LEARNS TO SPEAK AFTER WEBSITE UPDATE",
      "BOY, 7, REFUSES TO CLIMB DOWN FROM TREE AFTER SITE CHANGES",
      "BOY, 7, SAYS WEBSITE CHANGES MADE HIS DAY",
      "GIRL, 9, STARTS RELIGION AFTER WEBSITE UPDATE",
      "GIRL, 16, STRUCK BY LIGHTNING, BLAMES SITE UPDATE",
      "MAJOR SNOWSTORMS FORECASTED DUE TO HOBBYIST SITE UPDATES",
      "SEVERE WEATHER BLAMED ON WEBSITE UPDATE",
      "HURRICANE TURNS BACK, MISSES LANDFALL, AFTER SEEING NEW SITE UPDATE",
      "ALIENS MAKE CONTACT, DEMAND TO SPEAK TO WEBMASTER",
      "ALIENS DEMAND TO SPEAK WITH WEB ADMINISTRATOR",
      "TIME MAGAZINE NAMES WEBSITE UPDATE PERSON OF THE YEAR",
      "LOCAL GRANDMOTHER CLAIMS WEBSITE UPDATE CURED HER ARTHRITIS"
    ],
    "newsauthors":[
      "Webmaster",
      "The Webmaster",
      "El Webmaster",
      "Le Webmaster",
      "Michael",
      "Michael of the Cybersite",
      "Web Admin",
      "The Web Admin",

      "Someone on the internet",
      "Internet Guy",
      "The Keyboard",
      "Your Microwave",
      "Your Television",
      "The Unpaid Intern",
      "The Cybersite Intern",
      "The Internet People",
      "The Ones Who Run The Internet",
      "ChatGPT",
      "Microsoft Copilot",
      "Microsoft Clippy",

      "Will Wright",
      "Guido Van Rossum",
      "David Braben",

      "Jane Austen",
      "Thomas Hardy",
      "Alexander Pope",
      "Samuel Johnson",
      "Leo Tolstoy",
      "Charles Bukowski",
      "Miguel Cervantes",
      "Ernest Hemingway",
      "D.H. Lawrence",
      "Daniel Defoe",
      "Arthur Schopenhauer",
      "James Joyce",
      "G.K. Chesterton",
      "Virginia Woolf",
      "Sir Arthur Conan Doyle",
      "Jack Schaefer",
      "Jack London",
      "Mark Twain",
      "Charlotte Brontë",
      "Emily Brontë",
      "Anne Brontë",
      "William Shakespeare",
      "Stephen King",
      "Louis L'Amour",
      "Fyodor Dostoevsky",
      "Aleksandr Solzhenitsyn",
      "Owen Wister",
      
      "Carl Jung",
      "Friedrich Nietzsche",
      "Martin Heidegger",
      "Jean-Paul Sartre",
      "Simone de Beauvoir",
      "Albert Camus",
      "Søren Kierkegaard",

      "Billie Joe Armstrong",
      "Michael Ryan Pritchard",
      "Frank Edwin Wright III",
      "William Patrick Armstrong",
      "James Iha",
      "Jimmy Chamberlin",
      "Phillip Collins",
      "Michael Rutherford",
      "Anthony George Banks",
      "Peter Brian Gabriel",
      "Stephen Richard Hackett",
      "Michael Trent Reznor",
      "Richard Michael Patrick",
      "Atticus Ross",
      "Jerry Fulton Cantrell Jr.",
      "William Bradley DuVall",
      "David Jon Gilmour",
      "George Roger Waters",
      "Richard William Wright",
      "Nicholas Berkeley Mason"
    ],
    "bylines":[
      "By ",
      "Written by ",
      "Filed by ",
      "Transcribed by ",
      "Correspondence from ",
      "Special report by ",
      "As told by ",
      "Interview with ",
      "Leaked by ",
      "Submitted by ",
      "Dictated by ",
      "Translated by ",
      "Forged by ",
      "Stolen from ",
      "Plagiarized from ",
      "Ghostwritten by ",
      "Chiseled onto stone by ",
      "Overheard by ",
      "Typed angrily by ",
      "Scribbled in crayon by "
    ]
  }