[    
    {
        "id" : "2001",
        "name" : "2001: A Space Odyssey",
        "year" : "1968",
        "body" : "Where do you even start with a movie like <i>Space Odyssey</i>? It's out-of-this-world crazy—the result of a partnership between legendary science fiction author Arthur C. Clark and legendary screenwriter and directory Stanley Kubrick. <br><br>This movie, to me, is <i>The Dark Side of The Moon</i> for movies: it's grandiose, it's brilliant, you can soak into it, and every time you watch it, you can feel or think something else. It's something that makes you think and invites you to interpret. It's a journey—an experience!<br><br><i>2001</i> is one of my all-time favourites.",
        "tags" : "favourites;scifi;shelfmain",
        "imagefront" : "./assets/vhs/2001ASpaceOdyssey_Front.webp",
        "imagespine" : "./assets/vhs/2001ASpaceOdyssey_Spine.webp"
    },
    {
        "id" : "2010",
        "name" : "2010: The Year We Made Contact",
        "year" : "1984",
        "body" : "The sequel to <i>2001</i> is a very different movie—much more of a conventional one, I suppose you could say. Although it tries to be grand and mildly obtuse like it’s predecessor, it’s got a straightforward plot and you actually have an idea of what’s going on. <br><br>I think that as a science-fiction flick, it’s pretty great and I like the message of hope it tried to deliver during a time of nuclear tension and uncertainty. I think it’s theme of new beginnings and the Star Child representing some kind of rebirth of mankind is awesome, and it actually ties the whole progression of the first movie together really well. It’s Star-Trek-style sci-fi: serious, mildly philosophical and very science-backed. I think that for those reasons, along with being an <i>Space Odyssey</i> enjoyer, it’s a lot of fun. <br><br>You just can’t go into it with the same expectations as the previous movie.",
        "tags" : "scifi;shelfmain",
        "imagefront" : "./assets/vhs/2010TheYearWeMakeContact_Front.webp",
        "imagespine" : "./assets/vhs/2010TheYearWeMakeContact_Spine.webp"
    },
    {
        "id" : "alien",
        "name" : "Alien",
        "year" : "1979",
        "body" : "Whether you’re a fan of it or not, you can’t deny that <i>Alien</i> is an all-time classic science fiction movie. This Giger-inspired space horror has some great writing, directing, acting and special effects for it’s time, showing the world that science fiction can be fun and visually stunning like Star Wars, but entirely serious—even deadly. <br><br>I’m not a huge fan of the Alien franchise, to be honest, but I still respect this movie a lot and I’ll watch it every so often. Maybe it’s just something I’ve got to see a couple times more before I can really appreciate it. That said, the contributions of <i>Alien</i> on the film world are undeniable and still being felt today.  ",
        "tags" : "favourites;scifi;shelfmain",
        "imagefront" : "./assets/vhs/Alien_Front.webp",
        "imagespine" : "./assets/vhs/Alien_Spine.webp"
    },
    {
        "id" : "alien2",
        "name" : "Aliens",
        "year" : "1986",
        "body" : "It’s now the mid 1980’s and the movie companies decided that despite working extremely well as a standalone film, <i>Alien</i> deserved a sequel. They undid the clean ending  of the previous film with a time-skip and convenient cryo-freezing/revival for some more fun sci-fi action. <br><br>I’m usually one to like the first movie over the second, but this is one of those rare cases where I think I might like <i>Aliens</i> more than it’s predecessor—there’s just something about it which I find more attractive than the first movie. That partially might be due to the fact that this was James Cameron’s first big sci-fi role; I might have felt that long before I fell in love with <i>The Terminator</i> and his other work. <br><br>Regardless, this is undeniably another sci-fi classic and it deserves a spot on my shelf with all the rest. ",
        "tags" : "scifi;shelfmain",
        "imagefront" : "./assets/vhs/Aliens_Front.webp",
        "imagespine" : "./assets/vhs/Aliens_Spine.webp"
    },
    {
        "id" : "bttf1",
        "name" : "Back To The Future",
        "year" : "1985",
        "body" : "I never expected to be such a fan of <i>Back To The Future</i>, but it just snuck up on me. This is, I think, one of the best Spielberg-era films, up there with <i>Jurassic Park</i> and <i>Close Encounters</i>. This movie is so much fun every single time, it's quotable, and it's got everything you'd want in a family-friendly drama about your average kid time-travelling.<br><br>I first watched this one when I was very young; my Dad always liked it. On October 21st, 2015, my teacher came into class dressed as Marty McFly and we watched Back To The Future as a class—that'd already been the fourth or fifth time I saw the movie. <br><br>It's one I always highly recommend, and it will always have a space on my shelf.",
        "tags" : "favourites;scifi;shelfmain",
        "imagefront" : "./assets/vhs/BackToTheFutureI_Front.webp",
        "imagespine" : "./assets/vhs/BackToTheFutureI_Spine.webp"
    },
    {
        "id" : "bttf2",
        "name" : "Back To The Future II",
        "year" : "1989",
        "body" : "",
        "tags" : "scifi;shelfmain",
        "imagefront" : "./assets/vhs/BackToTheFutureII_Front.webp",
        "imagespine" : "./assets/vhs/BackToTheFutureII_Spine.webp"
    },
    {
        "id" : "bttf3",
        "name" : "Back To The Future III",
        "year" : "1990",
        "body" : "Did you know that <i>Back To The Future II</i> and <i>Back To The Future III</i> were the first movie sequels to be filmed back-to-back? They managed to get the second and third films greenlit at the same time, so they released one a year after the other—something we saw later in the 1990's and early 2000's with <i>The Matrix</i> trilogy, and even today with the <i>Avatar</i> sequels.<br><br>The first time I saw <i>III</i>, I was at my Aunt and Uncle's house. It'd been a long drive, and we all settled in the living room to watch the continued adventures of Doc and Marty. It's not my favourite of the trilogy—that would be the first—but it's still a lot of fun. I'm glad that we got what we did out of this franchise.",
        "tags" : "scifi;shelfmain",
        "imagefront" : "./assets/vhs/BackToTheFutureIII_Front.webp",
        "imagespine" : "./assets/vhs/BackToTheFutureIII_Spine.webp"
    },
    {
        "id" : "brunner",
        "name" : "Blade Runner",
        "year" : "1982",
        "body" : "The effects in <i>Blade Runner</i> are absolutely stunning for their time—this movie is a testament to how good practical effects were at their peak. Can you believe that Ridley Scott made <i>Alien</i> and followed it up with this movie? <br><br>The set design is awesome, the acting is great and the soundtrack by Vangelis is just top notch. The movie is wild and retro-futuristic, though many aspects of this cyberpunk doomsday prophecy have come true in much less spectacular ways. I think it's a really cool movie and I've enjoyed it a couple times.",
        "tags" : "favourites;scifi;shelfmain",
        "imagefront" : "./assets/vhs/BladeRunner_Front.webp",
        "imagespine" : "./assets/vhs/BladeRunner_Spine.webp"
    },
    {
        "id" : "citkane",
        "name" : "Citizen Kane",
        "year" : "1941",
        "body" : "This one is widely considered one of the greatest films of all time—a clinic in filmmaking made by a man known for his radio and stage work. The movie is beautifully shot and extraordinarily well thought out; you'll see how many movies took inspiration from the techniques used in this one.<br><br>Many would say that this is a boring movie, and I suppose it is for all practical intents and purposes, but I still think it's great. I like the way it's set up and how it hooks you in, and I think it's really cool how all the little details were packed in there. Welles is a brilliant filmmaker, writer, actor and cinematographer—he played the main character in this movie: the newspaper mangate Charles Foster Kane. Welles went on to make dozens of brilliant movies and had a huge influence in hollywood. His final movie was one of my long-time childhood favourites, <i>The Transformers: The Movie (1986)</i>, where he voiced the villain Unicron.<br><br>Maybe this one isn't for everyone, but it deserves a place on my shelf. ",
        "tags" : "favourites;classic;shelfmain",
        "imagefront" : "./assets/vhs/CitizenKane_Front.webp",
        "imagespine" : "./assets/vhs/CitizenKane_Spine.webp"
    },
    {
        "id" : "ceottk",
        "name" : "Close Encounters of The Third Kind",
        "year" : "1977",
        "body" : "My Dad said that when this movie came out, everyone was playing those five iconic alien-summoning notes from the movie whenever there was a piano around. This is a cool movie. I've always been fascinated by the idea of close encounters of the third kind and the way this one unfolds is really cool.<br><br>It's a serious movie and a brilliant production, but it's also got humour in it (Devil's Tower, Wyoming: Mashed Potatoes Version) and a John Williams soundtrack. This one really holds up well.",
        "tags" : "favourites;scifi;shelfmain",
        "imagefront" : "./assets/vhs/CloseEncountersOfTheThirdKind_Front.webp",
        "imagespine" : "./assets/vhs/CloseEncountersOfTheThirdKind_Spine.webp"
    },
    {
        "id" : "destmoon",
        "name" : "Destination Moon",
        "year" : "1950",
        "body" : "",
        "tags" : "scifi;shelfmain",
        "imagefront" : "./assets/vhs/DestinationMoon_Front.webp",
        "imagespine" : "./assets/vhs/DestinationMoon_Spine.webp"
    },
    {
        "id" : "dune",
        "name" : "Dune",
        "year" : "1984",
        "body" : "<i>Dune</i> is easily one of my all-time favourite films, and I think one of the coolest science-fiction movies ever made. This version of it is very quirky—it feels over-the-top like the big 1980’s production it was; it feels very alien. The casting is brilliant, featuring a very young Patrick Stewart years before he took command of the Enterprise D as well as Sting from <i>The Police</i>.<br><br>This is practical effects and old-fashioned filmmaking at it’s finest. I really think this movie, along with <i>Blade Runner</i> are some of the best showcases of what those filmmakers and effects artists were able to do in their prime. It’s stunning, cinematic, action-packed and sincere: I think it’s the best <i>Dune</i> adaptation out there. The new ones have modern effects and all that, but no modern movie can have the soul that hand-crafted films like this do. <br><br>Did you know that the personal shield scenes were hand-drawn to look like computer rendered graphics? They wanted to use CGI initially, but found that computers were not yet powerful enough to achieve the effects they wanted.  ",
        "tags" : "favourites;scifi;shelfmain",
        "imagefront" : "./assets/vhs/Dune_Front.webp",
        "imagespine" : "./assets/vhs/Dune_Spine.webp"
    },
    {
        "id" : "redoct",
        "name" : "The Hunt For Red October",
        "year" : "1990",
        "body" : "",
        "tags" : "favourites;action;shelfmain",
        "imagefront" : "./assets/vhs/TheHuntForRedOctober_Front.webp",
        "imagespine" : "./assets/vhs/TheHuntForRedOctober_Spine.webp"
    },
    {
        "id" : "id4",
        "name" : "Independence Day",
        "year" : "1996",
        "body" : "<i>Independence Day</i> is <i>Top Gun</i>...with Aliens—and Will Smith is Maverick!<br><br>That should be all I have to say to get you to watch this movie, but I'll keep talking anyways. The story is a lot of fun, and it's got the same quality that Jurassic Park has to me—I guess it's a shared kind of storyline that a lot of movies had in the 1980's and 1990's before everyone was a superhero: just regular people in extraordinary situations rising up to save the day.<br><br>Huge alien spaceships, really well-done comedy that's actually funny (compared to modern movies) and really good effects that hold up better than most movies from the 2010's.<br><br>Will Smith, Bill Pullman, Jeff Goldblum—even Brent Spiner plays a part! I can't even remember the first time I watched this movie, only that I've seen it a ridiculous amount of times. <i>Independence Day</i> reminds me of a simpler time before everything was online and we were all more connected—going to blockbuster, going to malls. I wish I had more time in that world. ",
        "tags" : "favourites;scifi;shelfmain",
        "imagefront" : "./assets/vhs/IndependenceDay_Front.webp",
        "imagespine" : "./assets/vhs/IndependenceDay_Spine.webp"
    },
    {
        "id" : "jp1",
        "name" : "Jurassic Park",
        "year" : "1993",
        "body" : "<i>Jurassic Park</i> is one of my all time favourite movies. I first watched it while I was on vacation with my parents in Cancun at around the age of four—I was flipping through channels one evening at the hotel, and the dig-site scene came on. I liked dinosaurs, so I watched. I wasn't as scared as I should have been; instead, <i>Jurassic Park</i> became a formative experience in my young life.<br><br>This is one I come back to time and time again. I love the feeling of this movie, just as I love the feeling of my other favourite movies. There's something about them I just can't describe, but they all share it.<br><br>John Williams' soundtrack is amazing here as well—it really brings the world to life. Stephen Spielberg was really at the top of his game, blending innovation in computer graphics and practical effects to make a movie that's more realistic than Jurassic Park 7 or any of the CGI we have today.",
        "tags" : "favourites;scifi;shelfmain",
        "imagefront" : "./assets/vhs/JurassicPark_Front.webp",
        "imagespine" : "./assets/vhs/JurassicPark_Spine.webp"
    },
    {
        "id" : "jp2",
        "name" : "The Lost World: Jurassic Park",
        "year" : "1998",
        "body" : "",
        "tags" : "scifi;shelfmain",
        "imagefront" : "./assets/vhs/TheLostWorld_Front.webp",
        "imagespine" : "./assets/vhs/TheLostWorld_Spine.webp"
    },
    {
        "id" : "jp3",
        "name" : "Jurassic Park III",
        "year" : "2001",
        "body" : "",
        "tags" : "scifi;shelfmain",
        "imagefront" : "./assets/vhs/JurassicParkIII_Front.webp",
        "imagespine" : "./assets/vhs/JurassicParkIII_Spine.webp"
    },
    {
        "id" : "matrix1",
        "name" : "The Matrix",
        "year" : "1999",
        "body" : "",
        "tags" : "favourites;scifi;shelfmain",
        "imagefront" : "./assets/vhs/TheMatrix_Front.webp",
        "imagespine" : "./assets/vhs/TheMatrix_Spine.webp"
    },
    {
        "id" : "livingdead",
        "name" : "Night Of The Living Dead",
        "year" : "1968",
        "body" : "",
        "tags" : "scifi;shelfmain",
        "imagefront" : "./assets/vhs/NightOfTheLivingDead_Front.webp",
        "imagespine" : "./assets/vhs/NightOfTheLivingDead_Spine.webp"
    },
    {
        "id" : "joseyw",
        "name" : "The Outlaw Josey Wales",
        "year" : "1976",
        "body" : "Clint Eastwood is f****** awesome. In this movie, he's a classic Louis L'Amour-style cowpunching superhero: after losing his family, he goes out on a streak to take revenge and assembles a band of misfits through his natural charisma and good nature. Josey Wales is a very cool character—the exact kind of guy I like reading about in books.<br><br>Despite some heavy subject matter, this movie has some great humour of a very specific kind. I also find it very fun to quote Wales' \"I reckon so\".<br><br>Please watch this movie!",
        "tags" : "favourites;western;shelfmain",
        "imagefront" : "./assets/vhs/TheOutlawJoseyWales_Front.webp",
        "imagespine" : "./assets/vhs/TheOutlawJoseyWales_Spine.webp"
    },
    {
        "id" : "python",
        "name" : "Python",
        "year" : "2000",
        "body" : "I would consider <i>Python</i> to be the last of the true b-movies. Back in the 1950's, they were genuinely trying but the effects were terrible by standards even ten years in the future. As time went on, cheaper productions just had crappy effects, and they spawned cult followings. These effects had charm and gave movies a quality—a soul—just not present in big-budget productions.<br><br>Throughout the 2000's with the rise of home computers capable of editing home video, the barrier to entry lowered and lowered until we arrived to the age of streaming: there are thousands of really crappy movies that nobody wants to watch because they're completely soulless.<br><br>Long-winded digression aside, <i>Python</i> is the last of a dead genre. It's corny as hell, it follows the spirit of B-Movies and (somehow) has Wil Wheaton in it. It's a fun movie.",
        "tags" : "scifi;shelfmain",
        "imagefront" : "./assets/vhs/Python_Front.webp",
        "imagespine" : "./assets/vhs/Python_Spine.webp"
    },
    {
        "id" : "apes1",
        "name" : "Planet of The Apes",
        "year" : "1968",
        "body" : "",
        "tags" : "scifi;shelfmain",
        "imagefront" : "./assets/vhs/PlanetOfTheApes_Front.webp",
        "imagespine" : "./assets/vhs/PlanetOfTheApes_Spine.webp"
    },
    {
        "id" : "apes2",
        "name" : "Beneath The Planet of The Apes",
        "year" : "1970",
        "body" : "",
        "tags" : "scifi;shelfmain",
        "imagefront" : "./assets/vhs/BeneathThePlanetOfTheApes_Front.webp",
        "imagespine" : "./assets/vhs/BeneathThePlanetOfTheApes_Spine.webp"
    },
    {
        "id" : "apes3",
        "name" : "Escape From The Planet of The Apes",
        "year" : "1971",
        "body" : "",
        "tags" : "scifi;shelfmain",
        "imagefront" : "./assets/vhs/EscapeFromThePlanetOfTheApes_Front.webp",
        "imagespine" : "./assets/vhs/EscapeFromThePlanetOfTheApes_Spine.webp"
    },
    {
        "id" : "apes4",
        "name" : "Conquest of The Planet of The Apes",
        "year" : "1972",
        "body" : "",
        "tags" : "scifi;shelfmain",
        "imagefront" : "./assets/vhs/ConquestOfThePlanetOfTheApes_Front.webp",
        "imagespine" : "./assets/vhs/ConquestOfThePlanetOfTheApes_Spine.webp"
    },
    {
        "id" : "apes5",
        "name" : "Battle For The Planet of The Apes",
        "year" : "1973",
        "body" : "",
        "tags" : "scifi;shelfmain",
        "imagefront" : "./assets/vhs/BattleForThePlanetOfTheApes_Front.webp",
        "imagespine" : "./assets/vhs/BattleForThePlanetOfTheApes_Spine.webp"
    },
    {
        "id" : "satfever",
        "name" : "Saturday Night Fever",
        "year" : "1977",
        "body" : "I seriously think this is a great movie. First off, it opens up with one of the most infectiously catchy songs ever written—\"Stayin' Alive\" by the Bee Gees—and features dozens of iconic scenes. It’s quoteable as hell, and it’s so much fun to watch every single time.<br><br>The first time I watched <i>Saturday Night Fever</i>, I was confused and slightly disappointed by the ending. I’ve watched it quite a few times since then, and I’ve realized that this isn’t a movie about getting the girl, it’s a movie about growing up and becoming a man.<br><br>This is a movie about realizing that you are right where you’re supposed to be at that stage of your life. Maybe I just like it so much because—although my life didn’t feature nearly as much disco action—I feel like I can relate to the feelings of alienation from my peers and wanting to move up in the world. I felt like I lived through the plot of this movie in parallel over the course of ten months—it started with me getting a surprise raise and ended with me growing up but not getting the girl.<br><br>Throughout those ten months, this movie made me feel like I wasn’t as lost as I thought I was, and everyone is faking it just as much as I am. But I got out, and I moved up, and I’m right where I’m meant to be. And I can’t dance.",
        "tags" : "favourites;drama;shelfmain",
        "imagefront" : "./assets/vhs/SaturdayNightFever_Front.webp",
        "imagespine" : "./assets/vhs/SaturdayNightFever_Spine.webp"
    },
    {
        "id" : "trek1",
        "name" : "Star Trek: The Motion Picture",
        "year" : "1979",
        "body" : "Around ten years before the release of this movie, the crowdfunded third season of <i>Star Trek</i> ended its run on television and Stanley Kubrick's <i>2001: A Space Odyssey</i> was released. After failing to launch <i>Star Trek: Phase II</i> and <i>Star Trek: The Animated Series</i> received a lukewarm reception, the franchise went dormant. Through the growing popularity of television reruns and fan conventions, Paramount Pictures was convinced to bring the crew back for a full-length motion picture.<br><br>What we got was this: <i>Star Trek The Motion Picture</i>. It's all the absurdity, wacky special effects, philosophical pondering and grandiosity of <i>2001: A Space Odyssey</i> but slightly less obtuse. It's a very cool movie, but it certainly doesn't feel like Star Trek—the rest of the Trek movies are just two-hour long episodes of TOS or TNG.<br><br>It's a fun one to return to from time to time. I've watched all the Star Trek movies a couple times.",
        "tags" : "scifi;shelfbottom",
        "imagefront" : "./assets/vhs/StarTrekI_Front.webp",
        "imagespine" : "./assets/vhs/StarTrekI_Spine.webp"
    },
    {
        "id" : "trek2",
        "name" : "Star Trek II: The Wrath of Khan",
        "year" : "1982",
        "body" : "",
        "tags" : "scifi;shelfbottom",
        "imagefront" : "./assets/vhs/StarTrekII_Front.webp",
        "imagespine" : "./assets/vhs/StarTrekII_Spine.webp"
    },
    {
        "id" : "trek3",
        "name" : "Star Trek III: The Search for Spock",
        "year" : "1984",
        "body" : "",
        "tags" : "scifi;shelfbottom",
        "imagefront" : "./assets/vhs/StarTrekIII_Front.webp",
        "imagespine" : "./assets/vhs/StarTrekIII_Spine.webp"
    },
    {
        "id" : "trek4",
        "name" : "Star Trek IV: The Voyage Home",
        "year" : "1986",
        "body" : "",
        "tags" : "scifi;shelfbottom",
        "imagefront" : "./assets/vhs/StarTrekIV_Front.webp",
        "imagespine" : "./assets/vhs/StarTrekIV_Spine.webp"
    },
    {
        "id" : "trek5",
        "name" : "Star Trek V: The Final Frontier",
        "year" : "1989",
        "body" : "",
        "tags" : "scifi;shelfbottom",
        "imagefront" : "./assets/vhs/StarTrekV_Front.webp",
        "imagespine" : "./assets/vhs/StarTrekV_Spine.webp"
    },
    {
        "id" : "trek6",
        "name" : "Star Trek VI: The Undiscovered Country",
        "year" : "1991",
        "body" : "",
        "tags" : "scifi;shelfbottom",
        "imagefront" : "./assets/vhs/StarTrekVI_Front.webp",
        "imagespine" : "./assets/vhs/StarTrekVI_Spine.webp"
    },
    {
        "id" : "trek7",
        "name" : "Star Trek Generations",
        "year" : "1994",
        "body" : "",
        "tags" : "favourites;scifi;shelfbottom",
        "imagefront" : "./assets/vhs/StarTrekVII_Front.webp",
        "imagespine" : "./assets/vhs/StarTrekVII_Spine.webp"
    },
    {
        "id" : "trek8",
        "name" : "Star Trek First Contact",
        "year" : "1996",
        "body" : "",
        "tags" : "scifi;shelfbottom",
        "imagefront" : "./assets/vhs/StarTrekVIII_Front.webp",
        "imagespine" : "./assets/vhs/StarTrekVIII_Spine.webp"
    },
    {
        "id" : "trek9",
        "name" : "Star Trek: Insurrection",
        "year" : "1998",
        "body" : "",
        "tags" : "scifi;shelfbottom",
        "imagefront" : "./assets/vhs/StarTrekIX_Front.webp",
        "imagespine" : "./assets/vhs/StarTrekIX_Spine.webp"
    },
    {
        "id" : "swars1",
        "name" : "Star Wars",
        "year" : "1977",
        "body" : "What can you even say about <i>Star Wars</i>? It revolutionized special effects and helped bring science fiction to the masses like we'd never seen before. How could you not like Star Wars? It's freakin' space knights with lazer swords!<br><br>I love <i>Star Wars</i> more than any of the other movies; it's got a great plot, great characters and it's a fun adventure every time. This copy I've got on VHS is the original before any of the edits which came about with the later DVD releases.<br><br>The first time I watched Star Wars, I was very young—so young, in fact, that I thought the movie must have been over by the time Obi Wan said 'that's no moon' because my perception of time was still very stretched out, as it is for a child.<br><br>Anyhow, it's great fun and I'll always love this movie. Watching this with my Dad was a formative experience, and I look forward to the day I watch <i>Star Wars</i> with my child for the first time.",
        "tags" : "favourites;scifi;shelfmain",
        "imagefront" : "./assets/vhs/StarWars_Front.webp",
        "imagespine" : "./assets/vhs/StarWars_Spine.webp"
    },
    {
        "id" : "swars2",
        "name" : "The Empire Strikes Back",
        "year" : "1980",
        "body" : "",
        "tags" : "scifi;shelfmain",
        "imagefront" : "./assets/vhs/TheEmpireStrikesBack_Front.webp",
        "imagespine" : "./assets/vhs/TheEmpireStrikesBack_Spine.webp"
    },
    {
        "id" : "swars3",
        "name" : "The Return of The Jedi",
        "year" : "1983",
        "body" : "",
        "tags" : "scifi;shelfmain",
        "imagefront" : "./assets/vhs/TheReturnOfTheJedi_Front.webp",
        "imagespine" : "./assets/vhs/TheReturnOfTheJedi_Spine.webp"
    },
    {
        "id" : "mario",
        "name" : "Super Mario Bros",
        "year" : "1993",
        "body" : "The original adaptation of <i>Super Mario Bros</i>",
        "tags" : "scifi;shelfmain",
        "imagefront" : "./assets/vhs/SuperMarioBros_Front.webp",
        "imagespine" : "./assets/vhs/SuperMarioBros_Spine.webp"
    },
    {
        "id" : "terminator1",
        "name" : "The Terminator",
        "year" : "1984",
        "body" : "<i>The Terminator</i> is probably my all-time favourite movie—I’ve watched it dozens of times and I know so many of its lines. It just has everything I could ever want in a science fiction movie from the 1980’s: sincere but corny-but-cool action, futuristic stuff, a strong female lead, quotable lines and a killer soundtrack. <br><br>These days, you might look at this movie and think it’s formulaic and just “average”, but you could say the same thing about <i>Top Gun</i> as well—these movies were pioneers in their respective genres! They made these now tired formulas which have been rehashed to no end. <br><br>This movie has a simple plot, great direction, writing, and performances, and it’s a lot of fun to watch. For something which most people don’t take seriously, it’s well shot and you can tell the cinematographers and directors put time and thought into it. <i>The Terminator</i> is a complete movie, which is hard to come by. It’s overlooked because it’s so complete that it’s almost taken for granted.<br><br>It’s an odd comfort movie to have, isn’t it? But this is my comfort movie: <i>The Terminator</i>. I will always come back to this movie (probably multiple times a year). ",
        "tags" : "favourites;scifi;shelfmain",
        "imagefront" : "./assets/vhs/TheTerminator_Front.webp",
        "imagespine" : "./assets/vhs/TheTerminator_Spine.webp"
    },
    {
        "id" : "terminator2",
        "name" : "Terminator 2: Judgement Day",
        "year" : "1991",
        "body" : "",
        "tags" : "scifi;shelfmain",
        "imagefront" : "./assets/vhs/Terminator2JudgementDay_Front.webp",
        "imagespine" : "./assets/vhs/Terminator2JudgementDay_Spine.webp"
    },
    {
        "id" : "terminator3",
        "name" : "Terminator 3: Rise of The Machines",
        "year" : "2003",
        "body" : "",
        "tags" : "scifi;shelfbottom",
        "imagefront" : "./assets/vhs/Terminator3RiseOfTheMachines_Front.webp",
        "imagespine" : "./assets/vhs/Terminator3RiseOfTheMachines_Spine.webp"
    },
    {
        "id" : "topgun",
        "name" : "Top Gun",
        "year" : "1986",
        "body" : "",
        "tags" : "favourites;action;shelfmain",
        "imagefront" : "./assets/vhs/TopGun_Front.webp",
        "imagespine" : "./assets/vhs/TopGun_Spine.webp"
    },
    {
        "id" : "topgundoc",
        "name" : "Top Gun: The Story Behind The Story",
        "year" : "1986",
        "body" : "",
        "tags" : "documentary;shelfbottom",
        "imagefront" : "./assets/vhs/TopGunTheStoryBehindTheStory_Front.webp",
        "imagespine" : "./assets/vhs/TopGunTheStoryBehindTheStory_Spine.webp"
    },
    {
        "id" : "trecall",
        "name" : "Total Recall",
        "year" : "1990",
        "body" : "",
        "tags" : "scifi;shelfbottom",
        "imagefront" : "./assets/vhs/TotalRecall_Front.webp",
        "imagespine" : "./assets/vhs/TotalRecall_Spine.webp"
    },
    {
        "id" : "bbcwwd",
        "name" : "Walking With Dinosaurs",
        "year" : "1999",
        "body" : "When I was a young boy, my whole world consisted of school, home, airplanes and dinosaurs. One day, perusing the documentary section at the public library, I discovered <i>Walking With Dinosaurs</i>. I watched it for the first time in the basement of my parents house on a Panasonic CRT using my PlayStation 2 as a DVD player, and it’s a memory that will stick with me for the rest of my life. Somehow, it came to be that whenever I got sick, I would ask my parents to get this from the public library so I could watch it. <i>Walking With Dinosaurs</i>—what is widely considered to be one of the greatest dinosaur documentaries of all time—is one of my oldest comfort films.<br><br>As with many of my favourite films, I own this one on DVD and VHS—you can see from the spine scan that this one comes on two tapes, with three episodes per tape. The CGI still looks really good to this day, and although some of the information is outdated, the production quality of the documentary makes it worth watching even now. <br><br><i>Walking With Dinosaurs</i> treats dinosaurs as if they were living beings in an Attenborough documentary, much like <i>Planet Earth</i>. It is certifiably awesome.",
        "tags" : "favourites;documentary;shelfmain",
        "imagefront" : "./assets/vhs/WalkingWithDinosaurs_Front.webp",
        "imagespine" : "./assets/vhs/WalkingWithDinosaurs_Spine.webp"
    },
    {
        "id" : "warworld",
        "name" : "The War of The Worlds",
        "year" : "1952",
        "body" : "",
        "tags" : "scifi;shelfmain",
        "imagefront" : "./assets/vhs/TheWarOfTheWorlds_Front.webp",
        "imagespine" : "./assets/vhs/TheWarOfTheWorlds_Spine.webp"
    },
    {
        "id" : "ledzep",
        "name" : "Led Zeppelin: The Song Remains The Same",
        "year" : "1976",
        "body" : "",
        "tags" : "music;shelfmain",
        "imagefront" : "./assets/vhs/TheSongRemainsTheSame_Front.webp",
        "imagespine" : "./assets/vhs/TheSongRemainsTheSame_Spine.webp"
    },
    {
        "id" : "woodstock",
        "name" : "Woodstock",
        "year" : "1970",
        "body" : "",
        "tags" : "music;shelfmain",
        "imagefront" : "./assets/vhs/Woodstock_Front.webp",
        "imagespine" : "./assets/vhs/Woodstock_Spine.webp"
    }
]